#ifndef Z2SEMGR_H
#define Z2SEMGR_H

#include "JSystem/JAudio2/JAISoundHandles.h"
#include "JSystem/JAudio2/JASGadget.h"

struct Z2MultiSeMgr {
    Z2MultiSeMgr();
    ~Z2MultiSeMgr();
    s8 registMultiSePos(Vec* posPtr);
    void resetMultiSePos();
    f32 getPanPower();
    f32 getDolbyPower();

    void setVolumeScale(f32 volumeScale) { volumeScale_ = volumeScale; }

    f32 getMaxVolume() {
        return (maxVolume_ > 1.0f) ? 1.0f : (maxVolume_ < 0.0f ? 0.0f : maxVolume_);
    }

    f32 getMaxPowR() {
        return (maxPowR_ > 1.0f) ? 1.0f : (maxPowR_ < 0.0f ? 0.0f : maxPowR_);
    }

    f32 getMaxPowL() {
        return (maxPowL_ > 1.0f) ? 1.0f : (maxPowL_ < 0.0f ? 0.0f : maxPowL_);
    }

    f32 getMaxPowB() {
        return (maxPowB_ > 1.0f) ? 1.0f : (maxPowB_ < 0.0f ? 0.0f : maxPowB_);
    }

    f32 getMaxPowF() {
        return (maxPowF_ > 1.0f) ? 1.0f : (maxPowF_ < 0.0f ? 0.0f : maxPowF_);
    }

    s8 getPosCount() { return posCount_; }

    /* 0x00 */ f32 volumeScale_;
    /* 0x04 */ f32 maxVolume_;
    /* 0x08 */ f32 maxPowL_;
    /* 0x0C */ f32 maxPowR_;
    /* 0x10 */ f32 maxPowF_;
    /* 0x14 */ f32 maxPowB_;
    /* 0x18 */ s8 posCount_;
};  // Size = 0x1C

struct Z2MultiSeObj : Z2MultiSeMgr {
    Z2MultiSeObj();
    ~Z2MultiSeObj() {}

    /* 0x1C */ u32 soundID_;
    /* 0x20 */ s8 reverb_;
};  // Size = 0x24

class Z2SeMgr : public JASGlobalInstance<Z2SeMgr> {
public:
    Z2SeMgr();
    void initSe();
    void resetModY();
    void modHeightAtCamera(const Vec**);
    void incrCrowdSize();
    void decrCrowdSize();
    bool seStart(JAISoundID soundID, const Vec* posPtr, u32, s8 reverb,
                                f32 pitch, f32 volume, f32 pan, f32 dolby, u8);
    bool seStartLevel(JAISoundID soundID, const Vec* posPtr, u32, s8 reverb,
                                     f32 pitch, f32 volume, f32 pan, f32 dolby, u8);
    void seStop(JAISoundID soundID, u32 fadeTime);
    void seStopAll(u32 fadeTime);
    void seMoveVolumeAll(f32 volume, u32 moveTime);
    void messageSePlay(u16, Vec*, s8);
    void talkInSe();
    void talkOutSe();
    void menuInSe();
    void setLevObjSE(u32 soundID, Vec* posPtr, s8 reverb);
    void setMultiTriggerSE(u32 soundID, Vec* posPtr, s8 reverb);
    void processSeFramework();
    bool isLevelSe(JAISoundID soundID);
    bool isSoundCulling(JAISoundID soundID);
    void resetCrowdSize() { mCrowdSize = 0; }

#if PLATFORM_WII || PLATFORM_SHIELD
    void homeMenuSeCallback(s32);    
#endif

private:
    /* 0x000 */ JAISoundHandle mSoundHandle[24];
    /* 0x060 */ JAISoundHandles mSoundHandles;
    #if VERSION == VERSION_SHIELD_DEBUG
    /* 0x068 */ JAISoundHandle dbg_field_0x68;
    /* 0x06C */ f32 dbg_field_0x6c;
    /* 0x070 */ f32 dbg_field_0x70;
    /* 0x074 */ f32 dbg_field_0x74;
    /* 0x078 */ f32 dbg_field_0x78;
    #endif
    /* 0x068 */ Z2MultiSeObj mLevelObjSe[10];
    /* 0x1D0 */ u8 mLevelObjectSeCount;
    /* 0x1D4 */ Z2MultiSeObj mMultiTriggerSe[10];
    /* 0x33C */ u8 mMultiTriggerSeCount;
    /* 0x340 */ Vec field_0x340[8];
    /* 0x3A0 */ const Vec* mModY[8];
    /* 0x3C0 */ u8 field_0x3c0;
    /* 0x3C1 */ u8 field_0x3c1;
    /* 0x3C2 */ u8 field_0x3c2;
    /* 0x3C3 */ u8 field_0x3c3;
    /* 0x3C4 */ u8 field_0x3c4;
    /* 0x3C5 */ u8 field_0x3c5;
    /* 0x3C6 */ u8 field_0x3c6;
    /* 0x3C7 */ u8 field_0x3c7;
    /* 0x3C8 */ u8 field_0x3c8;
    /* 0x3C9 */ u8 field_0x3c9;
    /* 0x3CA */ u8 field_0x3ca;
    /* 0x3CB */ u8 field_0x3cb;
    /* 0x3CC */ u8 mCrowdSize;
};  // Size = 0x3D0

inline Z2SeMgr* Z2GetSeMgr() {
    return JASGlobalInstance<Z2SeMgr>::getInstance();
}

// JAISoundID's for sound effects
enum Z2SoundID {
    Z2SE_SY_DUMMY = 0x0,
    Z2SE_ENTER_GAME = 0x1,
    Z2SE_QUIT_GAME = 0x2,
    Z2SE_TITLE_ENTER = 0x3,
    Z2SE_FILE_SELECT_CURSOR = 0x4,
    Z2SE_FILE_SELECT_SUB = 0x5,
    Z2SE_POINT_ON_ICON = 0x6,
    Z2SE_NAVI_POINTER_MOVE = 0x7,
    Z2SE_NAVI_FLY = 0x8,
    Z2SE_NAVI_RETURN = 0x9,
    Z2SE_FILE_SELECT_LEVEL = 0xA,
    Z2SE_NO_SOUND = 0xB,
    Z2SE_READ_RIDDLE_A = 0xC,
    Z2SE_READ_RIDDLE_B = 0xD,
    Z2SE_NAVI_CALLVOICE = 0xE,
    Z2SE_NAVI_BLINK = 0xF,
    Z2SE_NAVI_TALK_START = 0x10,
    Z2SE_NAVI_TALK_END = 0x11,
    Z2SE_OPTION_MENU_CURSOR = 0x12,
    Z2SE_DPD_SCREEN_IN = 0x13,
    Z2SE_DPD_SCREEN_OUT = 0x14,
    Z2SE_HEART_PIECE_GET = 0x17,
    Z2SE_CONSUMP_ITEM_GET = 0x18,
    Z2SE_CONSUM_INC_CNT_1 = 0x1B,
    Z2SE_CONSUM_INC_CNT_2 = 0x1C,
    JA_SE_SYS_EV_TIMER_20 = 0x1D,
