//
// Generated By: dol2asm
// Translation Unit: d_a_b_ob
//

#include "rel/d/a/b/d_a_b_ob/d_a_b_ob.h"
#include "JSystem/J3DGraphBase/J3DMaterial.h"
#include "SSystem/SComponent/c_math.h"
#include "c/c_damagereaction.h"
#include "cmath.h"
#include "d/a/d_a_player.h"
#include "d/com/d_com_inf_game.h"
#include "d/s/d_s_play.h"
#include "dol2asm.h"
#include "f_op/f_op_msg_mng.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_graphic.h"
#include "rel/d/a/b/d_a_b_oh/d_a_b_oh.h"
#include "rel/d/a/obj/d_a_obj_lv3WaterB/d_a_obj_lv3WaterB.h"
#include "rel/d/a/obj/d_a_obj_ystone/d_a_obj_ystone.h"

//
// Types:
//

class daB_OB_HIO_c {
public:
    /* 8061056C */ daB_OB_HIO_c();
    /* 8061A808 */ virtual ~daB_OB_HIO_c();

    /* 0x04 */ s8 field_0x04;
    /* 0x08 */ f32 mCoreSize;
    /* 0x0C */ f32 mCoreMoveSpeed;
    /* 0x10 */ f32 mBodySize;
    /* 0x14 */ s16 mLightR;
    /* 0x16 */ s16 mLightG;
    /* 0x18 */ s16 mLightB;
    /* 0x1C */ f32 mRange;
};

//
// Forward References:
//

extern "C" void __ct__12daB_OB_HIO_cFv();
extern "C" static void anm_init__FP10b_ob_classifUcf();
extern "C" static void HeadCallBack__FP8J3DJointi();
extern "C" static void TailCallBack__FP8J3DJointi();
extern "C" static void FinACallBack__FP8J3DJointi();
extern "C" static void FinBCallBack__FP8J3DJointi();
extern "C" static void FinCCallBack__FP8J3DJointi();
extern "C" static void sui_nodeCallBack__FP8J3DJointi();
extern "C" static void dark__FP12J3DModelDatas();
extern "C" static void daB_OB_Draw__FP10b_ob_class();
extern "C" void __dt__4cXyzFv();
extern "C" static void core_start__FP10b_ob_class();
extern "C" static void core_hand_move__FP10b_ob_class();
extern "C" static void s_bf_sub__FPvPv();
extern "C" static void s_bfdel_sub__FPvPv();
extern "C" static void s_kaisoudel_sub__FPvPv();
extern "C" static void bombfishset__FP10b_ob_class();
extern "C" void __dt__5csXyzFv();
