#ifndef D_COM_D_COM_INF_GAME_H
#define D_COM_D_COM_INF_GAME_H

#include "d/a/d_a_alink.h"
#include "d/bg/d_bg_s.h"
#include "d/cc/d_cc_s.h"
#include "d/d_attention.h"
#include "d/d_drawlist.h"
#include "d/d_resorce.h"
#include "d/d_simple_model.h"
#include "d/d_stage.h"
#include "d/d_vibration.h"
#include "d/event/d_event.h"
#include "d/event/d_event_manager.h"
#include "d/particle/d_particle.h"
#include "d/save/d_save.h"
#include "dolphin/types.h"
#include "f_op/f_op_camera_mng.h"
#include "f_op/f_op_scene_mng.h"

class dTimer_c;
class __d_timer_info_c {
public:
    __d_timer_info_c() {
        mTimerMode = -1;
        mTimerLimitTimeMs = 0;
        mTimerNowTimeMs = 0;
        mTimerPtr = NULL;
    }
    dTimer_c* mTimerPtr;
    s32 mTimerNowTimeMs;
    s32 mTimerLimitTimeMs;
    s32 mTimerMode;
    u8 mTimerType;
};

class phaseParam_c {
public:
    phaseParam_c(const char* name, JKRHeap* heap) {
        mResName = name;
        mpHeap = heap;
    }

    /* 0x0 */ const char* mResName;
    /* 0x4 */ JKRHeap* mpHeap;
};

class dComIfG_camera_info_class {
public:
    dComIfG_camera_info_class() {}
    ~dComIfG_camera_info_class() {}

    /* 0x00 */ camera_class* mCamera;
    /* 0x04 */ u8 field_0x4;
    /* 0x05 */ u8 field_0x5;
    /* 0x06 */ s8 field_0x6;
    /* 0x07 */ u8 field_0x7;
    /* 0x08 */ u32 mCameraAttentionStatus;
    /* 0x0C */ f32 mCameraZoomScale;
    /* 0x10 */ f32 mCameraZoomForcus;
    /* 0x14 */ char* mCameraParamFileName;
    /* 0x18 */ cXyz mCameraPos;
    /* 0x24 */ cXyz mCameraTarget;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ s16 field_0x34;
};
STATIC_ASSERT(sizeof(dComIfG_camera_info_class) == 0x38);

class dComIfG_resLoader_c {
public:
    /* 8002F314 */ dComIfG_resLoader_c();
    /* 8002F328 */ ~dComIfG_resLoader_c();
    /* 8002F3B4 */ int load(char const**, JKRHeap*);

private:
    /* 0x0 */ const char** field_0x0;
    /* 0x4 */ request_of_phase_process_class field_0x4;
    /* 0xC */ u8 field_0xc;
};

enum PlayerPtr { LINK_PTR, HORSE_PTR };

class daHorse_c;
class dPa_control_c;
class daAlink_c;
class dMsgObject_c;

class dComIfG_play_c {
public:
    dComIfG_play_c() { this->ct(); }
    void ct();
    void init();
    void itemInit();
    void setItemBombNumCount(u8 i_item, s16 count);
    s16 getItemBombNumCount(u8 i_item);
    void clearItemBombNumCount(u8 i_item);
    void setNowVibration(u8 vib_status);
    u32 getNowVibration();
    void setStartStage(dStage_startStage_c* p_startStage);
    static int getLayerNo_common_common(char const* stageName, int roomId, int layer);
    static int getLayerNo_common(char const* stageName, int roomId, int layer);
    static int getLayerNo(int);
    void createParticle();
    dSmplMdl_draw_c* createSimpleModel();
    void deleteSimpleModel();
    void drawSimpleModel();
    int addSimpleModel(J3DModelData* i_modelData, int roomNo, u8 drawBG);
    int removeSimpleModel(J3DModelData* i_modelData, int roomNo);
    void entrySimpleModel(J3DModel* i_model, int roomNo);
    void setTimerNowTimeMs(int time);
    int getTimerNowTimeMs();
    void setTimerLimitTimeMs(int time);
    int getTimerLimitTimeMs();
    void setTimerMode(int mode);
    int getTimerMode();
    void setTimerType(u8 type);
    u8 getTimerType();
    void setTimerPtr(dTimer_c* ptr);
    dTimer_c* getTimerPtr();
    void setWarpItemData(const char* stage, cXyz pos, s16 angle, s8 roomNo, u8, u8);
    ~dComIfG_play_c() {}

    dMsgObject_c* getMsgObjectClass() { return mMsgObjectClass; }
    dStage_roomControl_c* getRoomControl() { return &mRoomControl; }
    dStage_stageDt_c& getStage() { return mStageData; }
    dEvt_control_c& getEvent() { return mEvent; }
    daHorse_c* getHorseActor() { return (daHorse_c*)mPlayerPtr[1]; }
    J2DGrafContext* getCurrentGrafPort() { return mCurrentGrafPort; }
    dVibration_c& getVibration() { return mVibration; }
    camera_class* getCamera(int idx) { return mCameraInfo[idx].mCamera; }
    void* getPlayerPtr(int ptrIdx) { return mPlayerPtr[ptrIdx]; }
    fopAc_ac_c* getPlayer(int idx) { return (fopAc_ac_c*)mPlayer[idx]; }
    dPa_control_c* getParticle() { return mParticle; }
    dEvent_manager_c& getEvtManager() { return mEvtManager; }
    dAttention_c& getAttention() { return mAttention; }
    dStage_startStage_c* getStartStage() { return &mStartStage; }

    void setSelectItem(int idx, u8 i_itemNo) { mSelectItem[idx] = i_itemNo; }
    u8 getSelectItem(int idx) { return mSelectItem[idx]; }
    void setSelectEquip(int idx, u8 item_id) { mSelectEquip[idx] = item_id; }
    void setItem(u8 slot, u8 i_no) {
        mItemSlot = slot;
        mItemID = i_no;
    }

    u8 getDoStatus() { return mDoStatus; }
    u8 getRStatus() { return mRStatus; }
    u8 getAStatus() { return mAStatus; }
    u8 getXStatus() { return mXStatus; }
    u8 getYStatus() { return mYStatus; }
    u8 getZStatus() { return mZStatus; }
    u8 get3DStatus() { return m3DStatus; }
    u8 getCStickStatus() { return mCStickStatus; }
    u8 getSButtonStatus() { return mSButtonStatus; }
    u8 getNunStatus() { return mNunStatus; }
    u8 getRemoConStatus() { return mRemoConStatus; }
    u8 getNunZStatus() { return mNunZStatus; }
    u8 getNunCStatus() { return mNunCStatus; }
    u8 getBottleStatus() { return mBottleStatus; }
    u8 getSButtonStatusForce() { return mSButtonStatusForce; }
    u8 getSButtonSetFlagForce() { return mSButtonSetFlagForce; }
    u8 getCStickStatusForce() { return mCStickStatusForce; }
    u8 getCStickSetFlagForce() { return mCStickSetFlagForce; }
    u8 getCStickDirectionForce() { return mCStickDirectionForce; }
    u8 getFaceAnimeID() { return mFaceAnimeID; }
    u8 getBaseAnimeID() { return mBaseAnimeID; }
    bool isCStickSetFlag(u8 flag) { return mCStickSetFlag & flag; }
    bool isDoSetFlag(u8 flag) { return flag & mDoSetFlag; }
    bool isASetFlag(u8 flag) { return flag & mASetFlag; }
    bool isRSetFlag(u8 flag) { return flag & mRSetFlag; }
    bool isXSetFlag(u8 flag) { return flag & mXSetFlag; }
    bool isYSetFlag(u8 flag) { return flag & mYSetFlag; }

    void setZStatus(u8 status, u8 flag) {
        mZStatus = status;
        mZSetFlag = flag;
    }

    void setRStatus(u8 status, u8 flag) {
        mRStatus = status;
        mRSetFlag = flag;
    }

    void setDoStatus(u8 status, u8 flag) {
        mDoStatus = status;
        mDoSetFlag = flag;
    }

    void setAStatus(u8 status, u8 flag) {
        mAStatus = status;
        mASetFlag = flag;
    }

    void setXStatus(u8 status, u8 flag) {
        mXStatus = status;
        mXSetFlag = flag;
    }

    void setYStatus(u8 status, u8 flag) {
        mYStatus = status;
        mYSetFlag = flag;
    }

    void setBottleStatus(u8 status, u8 flag) {
        mBottleStatus = status;
        mBottleSetFlag = flag;
    }

    void setNunStatus(u8 status, u8 param_1, u8 flag) {
        mNunStatus = status;
        field_0x4ef0 = param_1;
        mNunSetFlag = flag;
    }

    void setRemoConStatus(u8 status, u8 param_1, u8 flag) {
        mRemoConStatus = status;
        field_0x4ef2 = param_1;
        mRemoConSetFlag = flag;
    }

    void setNunZStatus(u8 status, u8 flag) {
        mNunZStatus = status;
        mNunZSetFlag = flag;
    }

    void setNunCStatus(u8 status, u8 flag) {
        mNunCStatus = status;
        mNunCSetFlag = flag;
    }

    void setCStickStatus(u8 status, u8 param_1, u8 flag) {
        mCStickStatus = status;
        mCStickDirection = param_1;
        mCStickSetFlag = flag;
    }

    void setCStickStatusForce(u8 status, u8 param_1, u8 flag) {
        mCStickStatusForce = status;
        mCStickDirectionForce = param_1;
        mCStickSetFlagForce = flag;
    }

    void setSButtonStatus(u8 status, u8 flag) {
        mSButtonStatus = status;
        mSButtonSetFlag = flag;
    }

    void setSButtonStatusForce(u8 status, u8 flag) {
        mSButtonStatusForce = status;
        mSButtonSetFlagForce = flag;
    }

    void set3DStatus(u8 status, u8 direction, u8 flag) {
        m3DStatus = status;
        m3DDirection = direction;
        m3DSetFlag = flag;
    }

    void setDoStatusForce(u8 status, u8 flag) {
        mDoStatusForce = status;
        mDoSetFlagForce = flag;
    }

    void setAStatusForce(u8 status, u8 flag) {
        mAStatusForce = status;
        mASetFlagForce = flag;
    }

    void setItemRupeeCount(s32 rupees) { mItemRupeeCount += rupees; }
    void setItemMagicCount(s16 magic) { mItemMagicCount += magic; }
    void setItemMaxMagicCount(s16 max) { mItemMaxMagicCount += max; }
    void setItemArrowNumCount(s16 arrows) { mItemArrowNumCount += arrows; }
    void setItemPachinkoNumCount(s16 seeds) { mItemPachinkoNumCount += seeds; }
    void setItemKeyNumCount(s16 keys) { mItemKeyNumCount += keys; }
    void setItemMaxLifeCount(s16 max) { mItemMaxLifeCount += max; }
    void setOxygen(int oxygen) { mOxygen = oxygen; }
    void setNowOxygen(s32 oxygen) { mNowOxygen = oxygen; }
    void setOxygenCount(s32 oxygen) { mOxygenCount += oxygen; }
    int getOxygen() { return mOxygen; }
    void setMaxOxygen(int max) { mMaxOxygen = max; }
    int getMaxOxygen() { return mMaxOxygen; }
    int getNowOxygen() { return mNowOxygen; }
    void setItemNowLife(u16 life) { mItemNowLife = life; }
    void setItemNowMagic(s16 magic) { mItemNowMagicCount = magic; }
    void setItemNowOil(s32 oil) { mItemNowOil = oil; }
    void setItemOilCount(s32 oil) { mItemOilCount += oil; }
    s16 getItemMaxLifeCount() { return mItemMaxLifeCount; }
    f32 getItemLifeCount() { return mItemLifeCount; }
    s16 getItemMaxArrowNumCount() { return mItemMaxArrowNumCount; }
    void clearNowAnimeID() { mNowAnimeID = -1; }
    void clearMesgCamInfoID() { mMesgCamInfo = (void*)-1; }
    void clearItemMaxLifeCount() { mItemMaxLifeCount = 0; }
    void clearItemLifeCount() {
        mItemLifeCount = 0.0f;
        mItemLifeCountType = 0;
    }

    void setItemLifeCount(f32 hearts, u8 type) {
        mItemLifeCount += hearts;
        mItemLifeCountType = type;
    }

    u8& getItemLifeCountType() { return mItemLifeCountType; }
    s16 getItemPachinkoNumCount() { return mItemPachinkoNumCount; }
    void clearItemPachinkoNumCount() { mItemPachinkoNumCount = 0; }
    u8 getNeedLightDropNum() { return mNeedLightDropNum; }

    const char* getStartStageName() { return mStartStage.getName(); }
    s8 getStartStageRoomNo() { return mStartStage.getRoomNo(); }
    s8 getStartStageLayer() { return mStartStage.getLayer(); }
    s16 getStartStagePoint() { return mStartStage.getPoint(); }
    s8 getStartStageDarkArea() { return mStartStage.getDarkArea(); }
    void setStartStageDarkArea(s8 darkArea) { mStartStage.setDarkArea(darkArea); }
    void setStartStageLayer(s8 layer) { mStartStage.setLayer(layer); }

    const char* getNextStageName() { return mNextStage.getName(); }
    dStage_startStage_c* getNextStartStage() { return &mNextStage; }
    s8 getNextStageRoomNo() { return mNextStage.getRoomNo(); }
    s8 getNextStageLayer() { return mNextStage.getLayer(); }
    s16 getNextStagePoint() { return mNextStage.getPoint(); }
    s8 getNextStageWipe() { return mNextStage.getWipe(); }
    bool isEnableNextStage() { return mNextStage.isEnable(); }
    void offEnableNextStage() { mNextStage.offEnable(); }
    void setNextStage(const char* stage, s8 roomNo, s16 point, s8 layer, s8 wipe, u8 wipe_speed) {
        mNextStage.set(stage, roomNo, point, layer, wipe, wipe_speed);
    }

    u8 isHeapLockFlag() { return mHeapLockFlag; }
    void setHeapLockFlag(u8 status) { mHeapLockFlag = status; }
    void setSubHeapLockFlag(int idx, u8 status) { mSubHeapLockFlag[idx] = status; }
    u8 getSubHeapLockFlag(int idx) { return mSubHeapLockFlag[idx]; }
    void offHeapLockFlag() { mHeapLockFlag = 0; }

    JKRExpHeap* getExpHeap2D() { return mExpHeap2D; }
    JKRExpHeap* getMsgExpHeap() { return mMsgExpHeap; }
    JKRExpHeap* getSubExpHeap2D(int idx) { return mSubExpHeap2D[idx]; }
    void setSubExpHeap2D(int idx, void* heap) { mSubExpHeap2D[idx] = (JKRExpHeap*)heap; }
    void setExpHeap2D(void* heap) { mExpHeap2D = (JKRExpHeap*)heap; }
    void setMsgExpHeap(void* heap) { mMsgExpHeap = (JKRExpHeap*)heap; }

    JKRArchive* getMsgDtArchive(int idx) { return mMsgDtArchive[idx]; }
    JKRArchive* getMsgArchive(int idx) { return mMsgArchive[idx]; }
    JKRArchive* getMain2DArchive() { return mMain2DArchive; }
    JKRArchive* getAnmArchive() { return mAnmArchive; }
    JKRArchive* getCollectResArchive() { return mCollectResArchive; }
    JKRArchive* getItemIconArchive() { return mItemIconArchive; }
    JKRArchive* getNameResArchive() { return mNameResArchive; }
    JKRAramArchive* getFieldMapArchive2() { return (JKRAramArchive*)mFieldMapArchive2; }

    void setFieldMapArchive2(JKRArchive* arc) { mFieldMapArchive2 = arc; }
    void setAnmArchive(JKRArchive* arc) { mAnmArchive = arc; }
    void setFmapResArchive(JKRArchive* arc) { mFmapResArchive = arc; }
    void setDmapResArchive(JKRArchive* arc) { mDmapResArchive = arc; }
    void setCollectResArchive(JKRArchive* arc) { mCollectResArchive = arc; }
    void setItemIconArchive(JKRArchive* arc) { mItemIconArchive = arc; }
    void setAllMapArchive(JKRArchive* arc) { mAllMapArchive = arc; }
    void setRingResArchive(JKRArchive* arc) { mRingResArchive = arc; }
    void setNameResArchive(JKRArchive* arc) { mNameResArchive = arc; }
    void setDemoMsgArchive(JKRArchive* arc) { mDemoMsgArchive = arc; }
    void setMeterButtonArchive(JKRArchive* arc) { mMeterButtonArchive = arc; }
    void setErrorResArchive(JKRArchive* arc) { mErrorResArchive = arc; }
    void setCardIconResArchive(JKRArchive* arc) { mCardIconResArchive = arc; }
    void setMsgDtArchive(int i, JKRArchive* arc) { mMsgDtArchive[i] = arc; }
    void setMsgCommonArchive(JKRArchive* arc) { mMsgCommonArchive = arc; }
    void setMsgArchive(int i, JKRArchive* arc) { mMsgArchive[i] = arc; }
    void setFontArchive(JKRArchive* arc) { mFontArchive = arc; }
    void setRubyArchive(JKRArchive* arc) { mRubyArchive = arc; }
    void setMain2DArchive(JKRArchive* arc) { mMain2DArchive = arc; }
    void setItemTable(void* data) { mItemTable = data; }
    void* getItemTable() { return mItemTable; }

    void setPlayerPtr(int i, fopAc_ac_c* ptr) { mPlayerPtr[i] = ptr; }
    void setPlayer(int i, fopAc_ac_c* player) { mPlayer[i] = (daAlink_c*)player; }
    void setPlayerInfo(int i, fopAc_ac_c* ptr, int camIdx) {
        mPlayer[i] = (daAlink_c*)ptr;
        mPlayerCameraID[camIdx] = 0;
    }
    void setPlayerStatus(int param_0, int i, u32 flag) { mPlayerStatus[i] |= flag; }
    void clearPlayerStatus(int param_0, int i, u32 flag) { mPlayerStatus[i] &= ~flag; }
    bool checkPlayerStatus(int param_0, int i, u32 flag) { return flag & mPlayerStatus[i]; }

    s8 getPlayerCameraID(int i) { return mPlayerCameraID[i]; }
    void setCameraParamFileName(int i, char* name) { mCameraInfo[i].mCameraParamFileName = name; }
    void setCamera(int i, camera_class* cam) { mCameraInfo[i].mCamera = cam; }
    const char* getCameraParamFileName(int i) { return mCameraInfo[i].mCameraParamFileName; }
    BOOL checkCameraAttentionStatus(int i, u32 flag) {
        return mCameraInfo[i].mCameraAttentionStatus & flag;
    }
    void setCameraAttentionStatus(int i, u32 flag) { mCameraInfo[i].mCameraAttentionStatus = flag; }
    void onCameraAttentionStatus(int i, u32 flag) { mCameraInfo[i].mCameraAttentionStatus |= flag; }
    void offCameraAttentionStatus(int i, u32 flag) {
        mCameraInfo[i].mCameraAttentionStatus &= ~flag;
    }
    void setCameraInfo(int camIdx, camera_class* p_cam, int param_2, int param_3, int param_4) {
        mCameraInfo[camIdx].mCamera = p_cam;
        mCameraInfo[camIdx].field_0x4 = param_2;
        mCameraInfo[camIdx].field_0x5 = param_3;
        mCameraInfo[camIdx].field_0x6 = param_4;
        setCameraAttentionStatus(camIdx, 0);
    }

    void setStatus(u16 status) { mStatus = status; }
    s32 checkStatus(u16 flags) { return flags & mStatus; }

    void setDirection(u8 i_dir) { mDirection = i_dir; }

    bool& isPauseFlag() { return mPauseFlag; }
    void offPauseFlag() { mPauseFlag = false; }
    void onPauseFlag() { mPauseFlag = true; }
    u8 getOxygenShowFlag() { return mOxygenShowFlag; }
    void setOxygenShowFlag(u8 flag) { mOxygenShowFlag = flag; }
    void show2dOn() { mShow2D = 1; }
    void show2dOff() { mShow2D = 0; }
    s8 getLayerOld() { return mLayerOld; }
    void setMesgCancelButton(u8 button) { mMesgCancelButton = button; }
    void setMesgBgm(u8 param_0) { mMesgBgm = param_0; }
    int getMessageCountNumber() { return mMessageCountNum; }

    void setWindowNum(u8 num) { mWindowNum = num; }
    int getWindowNum() { return mWindowNum; }
    dDlst_window_c* getWindow(int i) { return &mWindow[i]; }
    void setWindow(int i, f32 param_1, f32 param_2, f32 param_3, f32 param_4, f32 param_5,
                   f32 param_6, int camID, int mode) {
        mWindow[i].setViewPort(param_1, param_2, param_3, param_4, param_5, param_6);
        mWindow[i].setScissor(param_1, param_2, param_3, param_4);
        mWindow[i].setCameraID(camID);
        mWindow[i].setMode(mode);
    }

    void setLastPlayStageName(char* name) {
        strncpy(mLastPlayStageName, name, 7);
        mLastPlayStageName[7] = 0;
    }
    char* getLastPlayStageName() { return mLastPlayStageName; }

    u8 getGameoverStatus() { return mGameoverStatus; }

public:
    /* 0x00000 */ dBgS mBgs;
    /* 0x01404 */ dCcS mCcs;
    /* 0x03EC8 */ dStage_startStage_c mStartStage;
    /* 0x03ED6 */ dStage_nextStage_c mNextStage;
    /* 0x03EE8 */ dStage_stageDt_c mStageData;
    /* 0x03F8C */ dStage_roomControl_c mRoomControl;
    /* 0x03F90 */ dEvt_control_c mEvent;
    /* 0x040C0 */ dEvent_manager_c mEvtManager;
    /* 0x04780 */ dAttention_c mAttention;
    /* 0x04C9C */ dVibration_c mVibration;
    /* 0x04D2C */ u8 field_0x4d2c[4];
    /* 0x04D30 */ JKRArchive* mFieldMapArchive2;
    /* 0x04D34 */ JKRArchive* mMsgArchive[11];
    /* 0x04D60 */ JKRArchive* mDemoMsgArchive;
    /* 0x04D64 */ JKRArchive* mMeterButtonArchive;
    /* 0x04D68 */ void* field_0x4d68;
    /* 0x04D6C */ JKRArchive* mFontArchive;
    /* 0x04D70 */ JKRArchive* mRubyArchive;
    /* 0x04D74 */ JKRArchive* mAnmArchive;
    /* 0x04D78 */ void* field_0x4d78[2];
    /* 0x04D80 */ JKRArchive* mCollectResArchive;
    /* 0x04D84 */ JKRArchive* mFmapResArchive;
    /* 0x04D88 */ JKRArchive* mDmapResArchive;
    /* 0x04D8C */ JKRArchive* mOptionResArchive;
    /* 0x04D90 */ void* field_0x4d90[2];
    /* 0x04D98 */ JKRArchive* mItemIconArchive;
    /* 0x04D9C */ JKRArchive* mNameResArchive;
    /* 0x04DA0 */ JKRArchive* mErrorResArchive;
    /* 0x04DA4 */ void* field_0x4da4;
    /* 0x04DA8 */ JKRArchive* mAllMapArchive;
    /* 0x04DAC */ JKRArchive* mMsgCommonArchive;
    /* 0x04DB0 */ JKRArchive* mRingResArchive;
    /* 0x04DB4 */ void* field_0x4db4;
    /* 0x04DB8 */ JKRArchive* mCardIconResArchive;
    /* 0x04DBC */ JKRArchive* mMsgDtArchive[15];
    /* 0x04DF8 */ JKRArchive* mMain2DArchive;
    /* 0x04DFC */ void* field_0x4dfc[2];
    /* 0x04E04 */ dPa_control_c* mParticle;
    /* 0x04E08 */ dSmplMdl_draw_c* mSimpleModel;
    /* 0x04E0C */ u8 mWindowNum;
    /* 0x04E0D */ s8 mLayerOld;
    /* 0x04E0E */ u16 mStatus;
    /* 0x04E10 */ dDlst_window_c mWindow[1];
    /* 0x04E3C */ dComIfG_camera_info_class mCameraInfo[1];
    /* 0x04E74 */ daAlink_c* mPlayer[1];
    /* 0x04E78 */ s8 mPlayerCameraID[1];
    /* 0x04E7C */ fopAc_ac_c* mPlayerPtr[2];  // 0: Player, 1: Horse ; type may be wrong
    /* 0x04E84 */ dMsgObject_c* mMsgObjectClass;
    /* 0x04E88 */ f32 mItemLifeCount;
    /* 0x04E8C */ s32 mItemRupeeCount;
    /* 0x04E90 */ s16 mItemKeyNumCount;
    /* 0x04E92 */ s16 mItemMaxLifeCount;
    /* 0x04E94 */ s16 mItemMagicCount;
    /* 0x04E96 */ s16 mItemNowMagicCount;
    /* 0x04E98 */ s16 mItemMaxMagicCount;
    /* 0x04E9A */ s16 field_0x4e9a;
    /* 0x04E9C */ s32 mItemOilCount;
    /* 0x04EA0 */ s32 mItemNowOil;
    /* 0x04EA4 */ int mItemMaxOilCount;
    /* 0x04EA8 */ int mOxygen;
    /* 0x04EAC */ int mNowOxygen;
    /* 0x04EB0 */ int mMaxOxygen;
    /* 0x04EB4 */ int mOxygenCount;
    /* 0x04EB8 */ int mMaxOxygenCount;
    /* 0x04EBC */ s16 mItemArrowNumCount;
    /* 0x04EBE */ s16 mItemPachinkoNumCount;
    /* 0x04EC0 */ s16 mItemMaxArrowNumCount;
    /* 0x04EC2 */ s16 mItemBombNumCount[3];
    /* 0x04EC8 */ u8 field_0x4ec8[4];
    /* 0x04ECC */ s16 mItemMaxBombNumCount1;
    /* 0x04ECE */ s16 mItemMaxBombNumCount2;
    /* 0x04ED0 */ u8 field_0x4ed0[4];
    /* 0x04ED4 */ int mMessageCountNum;
    /* 0x04ED8 */ u8 field_0x4ed8[6];
    /* 0x04EDE */ u16 mItemNowLife;
    /* 0x04EE0 */ u8 field_0x4ee0[2];
    /* 0x04EE2 */ u8 mMesgStatus;
    /* 0x04EE3 */ u8 field_0x4ee3;
    /* 0x04EE4 */ u8 mRStatus;
    /* 0x04EE5 */ u8 mAStatus;  // B button
    /* 0x04EE6 */ u8 field_0x4ee6;
    /* 0x04EE7 */ u8 mNunStatus;
    /* 0x04EE8 */ u8 mBottleStatus;
    /* 0x04EE9 */ u8 mRemoConStatus;
    /* 0x04EEA */ u8 field_0x4eea[2];
    /* 0x04EEC */ u8 mDoStatus;  // A button
    /* 0x04EED */ u8 field_0x4eed;
    /* 0x04EEE */ u8 m3DStatus;
    /* 0x04EEF */ u8 field_0x4eef;  // related to NunStatusForce
    /* 0x04EF0 */ u8 field_0x4ef0;  // related to NunStatus
    /* 0x04EF1 */ u8 field_0x4ef1;  // related to RemoConStatusForce
    /* 0x04EF2 */ u8 field_0x4ef2;  // related to RemoConStatus
    /* 0x04EF3 */ u8 field_0x4ef3[2];
    /* 0x04EF5 */ u8 m3DDirection;
    /* 0x04EF6 */ u8 m3DDirectionForce;
    /* 0x04EF7 */ u8 mCStickStatus;
    /* 0x04EF8 */ u8 mCStickDirection;
    /* 0x04EF9 */ u8 mCStickDirectionForce;
    /* 0x04EFA */ u8 mSButtonStatus;
    /* 0x04EFB */ u8 mZStatus;
    /* 0x04EFC */ u8 mRStatusForce;
    /* 0x04EFD */ u8 mAStatusForce;
    /* 0x04EFE */ u8 field_0x4efe;
    /* 0x04EFF */ u8 field_0x4eff;  // related to NunStatusForce
    /* 0x04F00 */ u8 mBottleStatusForce;
    /* 0x04F01 */ u8 field_0x4f01;  // related to RemoConStatusForce
    /* 0x04F02 */ u8 field_0x4f02[2];
    /* 0x04F04 */ u8 mDoStatusForce;
    /* 0x04F05 */ u8 mTouchStatusForce;
    /* 0x04F06 */ u8 m3DStatusForce;
    /* 0x04F07 */ u8 mCStickStatusForce;
    /* 0x04F08 */ u8 mSButtonStatusForce;
    /* 0x04F09 */ u8 mZStatusForce;
    /* 0x04F0A */ u8 mRSetFlag;
    /* 0x04F0B */ u8 mASetFlag;
    /* 0x04F0C */ u8 field_0x4f0c;
    /* 0x04F0D */ u8 mNunSetFlag;
    /* 0x04F0E */ u8 mBottleSetFlag;
    /* 0x04F0F */ u8 mRemoConSetFlag;
    /* 0x04F10 */ u8 field_0x4f10[2];
    /* 0x04F12 */ u8 mDoSetFlag;
    /* 0x04F13 */ u8 m3DSetFlag;
    /* 0x04F14 */ u8 mCStickSetFlag;
    /* 0x04F15 */ u8 mSButtonSetFlag;
    /* 0x04F16 */ u8 mZSetFlag;
    /* 0x04F17 */ u8 mRSetFlagForce;
    /* 0x04F18 */ u8 mASetFlagForce;
    /* 0x04F19 */ u8 field_0x4f19;
    /* 0x04F1A */ u8 field_0x4f1a;  // related to NunStatusForce
    /* 0x04F1B */ u8 mBottleSetFlagForce;
    /* 0x04F1C */ u8 field_0x4f1c;  // related to RemoConStatusForce
    /* 0x04F1D */ u8 field_0x4f1d[2];
    /* 0x04F1F */ u8 mDoSetFlagForce;
    /* 0x04F20 */ u8 m3DSetFlagForce;
    /* 0x04F21 */ u8 mCStickSetFlagForce;
    /* 0x04F22 */ u8 mSButtonSetFlagForce;
    /* 0x04F23 */ u8 mZSetFlagForce;
    /* 0x04F24 */ u8 mXStatus;
    /* 0x04F25 */ u8 mXStatusForce;
    /* 0x04F26 */ u8 mXSetFlag;
    /* 0x04F27 */ u8 mXSetFlagForce;
    /* 0x04F28 */ u8 mYStatus;
    /* 0x04F29 */ u8 mYStatusForce;
    /* 0x04F2A */ u8 mYSetFlag;
    /* 0x04F2B */ u8 mYSetFlagForce;
    /* 0x04F2C */ u8 mNunZStatus;
    /* 0x04F2D */ u8 mNunZSetFlag;
    /* 0x04F2E */ u8 field_0x4fc6;  // related to NunZStatusForce
    /* 0x04F2F */ u8 field_0x4fc7;  // related to NunZStatusForce
    /* 0x04F30 */ u8 mNunCStatus;
    /* 0x04F31 */ u8 mNunCSetFlag;
    /* 0x04F32 */ u8 field_0x4fca;  // related to NunCStatusForce
    /* 0x04F33 */ u8 field_0x4fcb;  // related to NunCStatusForce
    /* 0x04F34 */ u8 mSelectItem[8];
    /* 0x04F3C */ u8 mSelectEquip[6];
    /* 0x04F42 */ u8 mBaseAnimeID;
    /* 0x04F43 */ u8 mFaceAnimeID;
    /* 0x04F44 */ u8 mNowAnimeID;
    /* 0x04F45 */ u8 mItemSlot;
    /* 0x04F46 */ u8 mItemID;
    /* 0x04F47 */ u8 field_0x4f47[2];
    /* 0x04F49 */ u8 mDirection;
    /* 0x04F4A */ u8 field_0x4f4a;
    /* 0x04F4B */ u8 field_0x4f4b;  // related to itemInit
    /* 0x04F4C */ u8 field_0x4f4c;  // related to itemInit
    /* 0x04F4D */ u8 field_0x4f4d;
    /* 0x04F4E */ u8 mMesgCancelButton;
    /* 0x04F4F */ u8 field_0x4f4f[2];
    /* 0x04F51 */ u8 mGameoverStatus;
    /* 0x04F52 */ u8 field_0x4f52[5];
    /* 0x04F57 */ u8 mHeapLockFlag;
    /* 0x04F58 */ u8 mSubHeapLockFlag[2];
    /* 0x04F5A */ u8 mNowVibration;
    /* 0x04F5B */ u8 field_0x4f5b[2];
    /* 0x04F5D */ u8 mWolfAbility;
    /* 0x04F5E */ u8 field_0x4f5e[11];
    /* 0x04F69 */ u8 mNeedLightDropNum;
    /* 0x04F6A */ u8 field_0x4f6a[18];
    /* 0x04F7C */ u8 mMesgBgm;
    /* 0x04F7D */ bool mPauseFlag;
    /* 0x04F7E */ u8 mItemLifeCountType;
    /* 0x04F7F */ u8 mOxygenShowFlag;
    /* 0x04F80 */ u8 mShow2D;
    /* 0x04F81 */ u8 field_0x4f81[3];
    /* 0x04F84 */ JKRExpHeap* mExpHeap2D;
    /* 0x04F88 */ JKRExpHeap* mSubExpHeap2D[2];
    /* 0x04F90 */ JKRExpHeap* mMsgExpHeap;
    /* 0x04F94 */ char mWarpItemStage[8];
    /* 0x04F9C */ cXyz mWarpItemPos;
    /* 0x04FA8 */ s16 mWarpItemAngle;
    /* 0x04FAA */ s8 mWarpItemRoom;
    /* 0x04FAB */ u8 field_0x4fab;  // related to setWarpItemData
    /* 0x04FAC */ u8 field_0x4fac;  // related to setWarpItemData
    /* 0x04FAD */ u8 field_0x4fad[3];
    /* 0x04FB0 */ void* mMesgCamInfo;
    /* 0x04FB4 */ int mMesgCamInfoBasicID;
    /* 0x04FB8 */ fopAc_ac_c* mMesgCamInfoActor1;
    /* 0x04FBC */ fopAc_ac_c* mMesgCamInfoActor2;
    /* 0x04FC0 */ fopAc_ac_c* mMesgCamInfoActor3;
    /* 0x04FC4 */ fopAc_ac_c* mMesgCamInfoActor4;
    /* 0x04FC8 */ fopAc_ac_c* mMesgCamInfoActor5;
    /* 0x04FCC */ fopAc_ac_c* mMesgCamInfoActor6;
    /* 0x04FD0 */ fopAc_ac_c* mMesgCamInfoActor7;
    /* 0x04FD4 */ fopAc_ac_c* mMesgCamInfoActor8;
    /* 0x04FD8 */ fopAc_ac_c* mMesgCamInfoActor9;
    /* 0x04FDC */ fopAc_ac_c* mMesgCamInfoActor10;
    /* 0x04FE0 */ u32 mPlayerStatus[2];
    /* 0x04FE8 */ u8 field_0x4fe8[0x10];
    /* 0x04FF8 */ __d_timer_info_c mTimerInfo;
    /* 0x0500C */ dDlst_window_c* mCurrentWindow;
    /* 0x05010 */ view_class* mCurrentView;
    /* 0x05014 */ view_port_class* mCurrentViewport;
    /* 0x05018 */ J2DGrafContext* mCurrentGrafPort;
    /* 0x0501C */ void* mItemTable;
    /* 0x0501D */ u8 field_0x501d[4];
    /* 0x05024 */ char mLastPlayStageName[8];
};

class dComIfG_inf_c {
public:
    dComIfG_inf_c() { this->ct(); }
    ~dComIfG_inf_c() {}
    void ct();
    dComIfG_play_c& getPlay() { return play; }

    /* 0x00000 */ dSv_info_c info;
    /* 0x00F38 */ dComIfG_play_c play;
    /* 0x05F64 */ dDlst_list_c drawlist;
    /* 0x1C2F8 */ dRes_control_c mResControl;
    /* 0x1DDF8 */ u8 mFadeBrightness;
    /* 0x1DDF9 */ u8 mWorldDark;
    /* 0x1DDFA */ s8 field_0x1ddfa;
    /* 0x1DDFB */ s8 field_0x1ddfb;
    /* 0x1DDFC */ s8 field_0x1ddfc;
    /* 0x1DE00 */ u32 field_0x1de00;
    /* 0x1DE04 */ u32 field_0x1de04;
    /* 0x1DE08 */ u8 field_0x1de08;
    /* 0x1DE09 */ u8 field_0x1de09;
    /* 0x1DE0A */ u8 field_0x1de0a;
    /* 0x1DE0B */ u8 field_0x1de0b;
    /* 0x1DE0C */ u8 field_0x1de0c;

    static __d_timer_info_c dComIfG_mTimerInfo;
};  // Size: 0x1DE10

STATIC_ASSERT(122384 == sizeof(dComIfG_inf_c));

extern dComIfG_inf_c g_dComIfG_gameInfo;
extern GXColor g_blackColor;
extern GXColor g_clearColor;
extern GXColor g_whiteColor;

int dComLbG_PhaseHandler(request_of_phase_process_class*, request_of_phase_process_fn, void*);
BOOL dComIfG_resetToOpening(scene_class* scene);
char* dComIfG_getRoomArcName(int roomNo);
void* dComIfG_getStageRes(char const* resName);
void* dComIfG_getOldStageRes(char const* resName);
void dComIfG_get_timelayer(int* layer);
int dComIfG_resDelete(request_of_phase_process_class* i_phase, char const* resName);
int dComIfG_changeOpeningScene(scene_class* scene, s16 procName);
int dComIfG_resLoad(request_of_phase_process_class* i_phase, char const* arc_name);
int dComIfG_resLoad(request_of_phase_process_class* i_phase, char const* resName, JKRHeap* heap);

inline void dComIfG_setBrightness(u8 brightness) {
