//
// Generated By: dol2asm
// Translation Unit: d_a_obj_kantera
//

#include "rel/d/a/obj/d_a_obj_kantera/d_a_obj_kantera.h"
#include "JSystem/JKernel/JKRHeap.h"
#include "SSystem/SComponent/c_math.h"
#include "d/a/d_a_itembase_static.h"
#include "d/cc/d_cc_d.h"
#include "d/com/d_com_inf_game.h"
#include "d/d_item.h"
#include "d/d_item_data.h"
#include "d/d_procname.h"
#include "dol2asm.h"
#include "f_op/f_op_actor_mng.h"

//
// Types:
//

#ifdef NONMATCHING
class daItemKantera_c : public daItemBase_c {
public:
    /* 80C389BC */ void initBaseMtx();
    /* 80C389F8 */ void setBaseMtx();
    /* 80C38A64 */ int Create();
    /* 80C38BA8 */ int __CreateHeap();
    /* 80C38BB0 */ int create();
    /* 80C38F78 */ void bg_check();
    /* 80C39068 */ int actionInit();
    /* 80C390A0 */ int actionWaitInit();
    /* 80C3911C */ int actionWait();
    /* 80C39234 */ int initActionOrderGetDemo();
    /* 80C392D0 */ int actionOrderGetDemo();
    /* 80C3934C */ int actionGetDemo();
    /* 80C393B0 */ int execute();
    /* 80C394DC */ int draw();
    /* 80C39530 */ int _delete();

    void setStatus(u8 i_status) { mStatus = i_status; }

    /* 0x92C */ u32 field_0x92c;
    /* 0x930 */ s32 field_0x930;
    /* 0x934 */ u8 mStatus;
    /* 0x935 */ u8 field_0x935;
    /* 0x936 */ u8 field_0x936;
    /* 0x937 */ u8 field_0x937;
    /* 0x938 */ s16 field_0x938;
    /* 0x93A */ s16 field_0x93a;
    /* 0x93C */ cXyz field_0x93c;
};  // Size: 0x948
#else
struct daItemKantera_c {
    /* 80C389BC */ void initBaseMtx();
    /* 80C389F8 */ void setBaseMtx();
    /* 80C38A64 */ int Create();
    /* 80C38BA8 */ int __CreateHeap();
    /* 80C38BB0 */ int create();
    /* 80C38F78 */ void bg_check();
    /* 80C39068 */ int actionInit();
    /* 80C390A0 */ int actionWaitInit();
    /* 80C3911C */ int actionWait();
    /* 80C39234 */ int initActionOrderGetDemo();
    /* 80C392D0 */ int actionOrderGetDemo();
    /* 80C3934C */ int actionGetDemo();
    /* 80C393B0 */ int execute();
    /* 80C394DC */ int draw();
    /* 80C39530 */ int _delete();
};
#endif

//
// Forward References:
//

extern "C" static void Reflect__FP4cXyzRC13cBgS_PolyInfof();
extern "C" void __dt__8cM3dGPlaFv();
extern "C" void initBaseMtx__15daItemKantera_cFv();
extern "C" void setBaseMtx__15daItemKantera_cFv();
extern "C" void Create__15daItemKantera_cFv();
extern "C" bool __CreateHeap__15daItemKantera_cFv();
