#ifndef F_OP_ACTOR_MNG_H_
#define F_OP_ACTOR_MNG_H_

#include "d/d_bg_s.h"
#include "d/d_bg_s_gnd_chk.h"
#include "d/d_bg_s_lin_chk.h"
#include "d/d_bg_s_roof_chk.h"
#include "d/d_bg_s_wtr_chk.h"
#include "f_op/f_op_actor.h"
#include "f_op/f_op_actor_iter.h"
#include "f_op/f_op_draw_tag.h"
#include "f_pc/f_pc_manager.h"
#include "m_Do/m_Do_hostIO.h"

#define fopAcM_SetupActor(ptr, ClassName)                                                          \
    if (!fopAcM_CheckCondition(ptr, fopAcCnd_INIT_e)) {                                            \
        new (ptr) ClassName();                                                                     \
        fopAcM_OnCondition(ptr, fopAcCnd_INIT_e);                                                  \
    }

#define fopAcM_SetupActor2(ptr, ClassName, ...)                                                    \
    if (!fopAcM_CheckCondition(ptr, fopAcCnd_INIT_e)) {                                            \
        new (ptr) ClassName(__VA_ARGS__);                                                          \
        fopAcM_OnCondition(ptr, fopAcCnd_INIT_e);                                                  \
    }

#define fopAcM_RegisterDeleteID(i_this, actor_name_str)                                            \
    const fpc_ProcID procID = fopAcM_GetID(i_this);                                                \
    "Delete -> " actor_name_str "(id=%d)\n"

#define fopAcM_RegisterCreateID(actor_class, i_this, actor_name_str)                               \
    actor_class* a_this = static_cast<actor_class*>(i_this);                                       \
    const fpc_ProcID procID = fopAcM_GetID(i_this);                                                \
    "Create -> " actor_name_str "(id=%d)\n"

#define fopAcM_RegisterDelete(i_this, actor_name_str) "Delete -> " actor_name_str "\n"

#define fopAcM_RegisterCreate(actor_class, i_this, actor_name_str)                                 \
    static_cast<actor_class*>(i_this);                                                             \
    "Create -> " actor_name_str "\n"

class J3DModelData;  // placeholder
class JKRHeap;
class cM3dGPla;

struct fopAcM_prmBase_class {
    /* 0x00 */ u32 parameters;
    /* 0x04 */ cXyz position;
    /* 0x10 */ csXyz angle;
    /* 0x16 */ u16 setID;
};  // Size: 0x18

struct fopAcM_prmScale_class {
    /* 0x0 */ u8 x;
    /* 0x1 */ u8 y;
    /* 0x2 */ u8 z;
};  // Size: 0x3

struct fopAcM_prm_class {
    /* 0x00 */ fopAcM_prmBase_class base;
    /* 0x18 */ fopAcM_prmScale_class scale;
    /* 0x1C */ fpc_ProcID parent_id;
    /* 0x20 */ s8 subtype;
    /* 0x21 */ s8 room_no;
};

struct fopAcM_search4ev_prm {
    fopAcM_search4ev_prm() { clear(); }
    void clear() {
        name[0] = 0;
        event_id = -1;
        procname = PROC_PLAY_SCENE;
        subtype = 0;
    }

    /* 0x00 */ char name[30];
    /* 0x1E */ s16 event_id;
    /* 0x20 */ s16 procname;
    /* 0x22 */ s8 subtype;
};

struct fopAcM_search_prm {
    /* 0x00 */ u32 prm0;
    /* 0x04 */ u32 prm1;
    /* 0x08 */ s16 procname;
    /* 0x0A */ s8 subtype;
};

struct fOpAcm_HIO_entry_c : public mDoHIO_entry_c {
    virtual ~fOpAcm_HIO_entry_c() {}

    #ifdef DEBUG
    void removeHIO(const fopAc_ac_c* i_this) { removeHIO(*i_this); }
    void removeHIO(const fopAc_ac_c& i_this) { removeHIO(static_cast<const leafdraw_class&>(i_this)); }
    void removeHIO(const leafdraw_class& i_this) { removeHIO(i_this.base); }
    void removeHIO(const base_process_class& i_this) { removeHIO(i_this.state); }
    void removeHIO(const state_class& state) {
        if (state.create_phase == cPhs_NEXT_e) {
            mDoHIO_entry_c::removeHIO();
        }
    }
    #endif
};

dBgS& dComIfG_Bgsp();

class dKy_tevstr_c;
class cBgS_PolyInfo;
typedef int (*createFunc)(void*);
typedef int (*heapCallbackFunc)(fopAc_ac_c*);

struct DOUBLE_POS {
    double x, y, z;
};

enum fopAcM_STATUS {
    /* 0x0000001 */ fopAcM_STATUS_UNK_000001 = 1 << 0,
    /* 0x0000002 */ fopAcM_STATUS_UNK_000002 = 1 << 1,
