//
// Generated By: dol2asm
// Translation Unit: d_a_door_push
//

#include "rel/d/a/door/d_a_door_push/d_a_door_push.h"
#include "JSystem/JKernel/JKRHeap.h"
#include "d/a/d_a_player.h"
#include "d/bg/d_bg_s_movebg_actor.h"
#include "d/bg/d_bg_w.h"
#include "d/com/d_com_inf_game.h"
#include "d/d_procname.h"
#include "dol2asm.h"
#include "f_op/f_op_actor_mng.h"

//
// Types:
//

class daDoorPush_c : public dBgS_MoveBgActor {
public:
    /* 80677E08 */ void initBaseMtx();
    /* 80677F38 */ void setBaseMtx();
    /* 8067809C */ int Create();
    /* 806781FC */ int CreateHeap();
    /* 80678318 */ int create1st();
    /* 8067839C */ int Execute(Mtx**);
    /* 8067840C */ void action();
    /* 80678488 */ void init_modeWait();
    /* 806784B4 */ void modeWait();
    /* 80678664 */ void event_proc_call();
    /* 80678708 */ void actionOpenWait();
    /* 8067877C */ void actionOrderEvent();
    /* 806787F8 */ void actionEvent();
    /* 80678818 */ void demoProc();
    /* 80678AEC */ void rotateInit();
    /* 80678B10 */ int rotate();
    /* 80678BC0 */ void setGoal();
    /* 80678C70 */ int Draw();
    /* 80678D2C */ int Delete();

    void setAction(u8 i_action) { mAction = i_action; }
    u32 getSceneNo() { return fopAcM_GetParamBit(this, 4, 6); }

    /* 0x5A0 */ request_of_phase_process_class mPhaseReq;
    /* 0x5A8 */ J3DModel* mpModel[2];
    /* 0x5B0 */ dBgW* field_0x5b0;
    /* 0x5B4 */ Mtx field_0x5b4;
    /* 0x5E4 */ Mtx field_0x5e4;
    /* 0x614 */ cXyz field_0x614[2];
    /* 0x62C */ u8 field_0x62c[2];
    /* 0x62E */ u8 field_0x62e[2];
    /* 0x630 */ s16 field_0x630[2];
    /* 0x634 */ s16 field_0x634[2];
    /* 0x638 */ u8 field_0x638;
    /* 0x639 */ u8 field_0x639;
    /* 0x63A */ s16 field_0x63a[2];
    /* 0x63E */ u8 field_0x63e[2];
    /* 0x640 */ u8 mAction;
    /* 0x641 */ u8 field_0x641;
    /* 0x642 */ u8 field_0x642[0x644 - 0x642];
    /* 0x644 */ s32 field_0x644;
    /* 0x648 */ u8 field_0x648;
    /* 0x649 */ u8 field_0x649;
    /* 0x64A */ s16 field_0x64a;
    /* 0x64C */ s16 field_0x64c;
    /* 0x64E */ s16 field_0x64e;
    /* 0x650 */ s16 field_0x650;
    /* 0x652 */ u8 field_0x652[0x654 - 0x652];
    /* 0x654 */ cXyz field_0x654;
};  // Size: 0x660

//
// Forward References:
//

extern "C" static void PPCallBack__FP10fopAc_ac_cP10fopAc_ac_csQ29dBgW_Base13PushPullLabel();
extern "C" static void PPCallBack2__FP10fopAc_ac_cP10fopAc_ac_csQ29dBgW_Base13PushPullLabel();
extern "C" void initBaseMtx__12daDoorPush_cFv();
extern "C" void setBaseMtx__12daDoorPush_cFv();
extern "C" void __dt__4cXyzFv();
extern "C" void Create__12daDoorPush_cFv();
extern "C" void CreateHeap__12daDoorPush_cFv();
extern "C" void create1st__12daDoorPush_cFv();
extern "C" void Execute__12daDoorPush_cFPPA3_A4_f();
extern "C" void action__12daDoorPush_cFv();
extern "C" void init_modeWait__12daDoorPush_cFv();
extern "C" void modeWait__12daDoorPush_cFv();
extern "C" void event_proc_call__12daDoorPush_cFv();
extern "C" void actionOpenWait__12daDoorPush_cFv();
extern "C" void actionOrderEvent__12daDoorPush_cFv();
extern "C" void actionEvent__12daDoorPush_cFv();
extern "C" void demoProc__12daDoorPush_cFv();
