#ifndef D_COM_D_COM_INF_GAME_H
#define D_COM_D_COM_INF_GAME_H

#include "d/d_attention.h"
#include "d/d_cc_s.h"
#include "d/d_event.h"
#include "d/d_event_manager.h"
#include "d/d_particle.h"
#include "d/d_resorce.h"
#include "d/d_vibration.h"
#include "d/d_drawlist.h"
#include "d/d_stage.h"
#include "d/d_save.h"
#include "f_op/f_op_actor.h"
#include "global.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_graphic.h"

enum dComIfG_ButtonStatus {
    /* 0x00 */ BUTTON_STATUS_NONE,
    /* 0x01 */ BUTTON_STATUS_LET_GO,
    /* 0x02 */ BUTTON_STATUS_PEEK,
    /* 0x03 */ BUTTON_STATUS_ATTACK,
    /* 0x04 */ BUTTON_STATUS_PUT_AWAY,
    /* 0x05 */ BUTTON_STATUS_HOWL,
    /* 0x06 */ BUTTON_STATUS_OPEN,
    /* 0x07 */ BUTTON_STATUS_ENTER,
    /* 0x08 */ BUTTON_STATUS_CHECK,
    /* 0x09 */ BUTTON_STATUS_DASH,
    /* 0x0A */ BUTTON_STATUS_CROUCH,
    /* 0x0B */ BUTTON_STATUS_DEFEND,
    /* 0x0C */ BUTTON_STATUS_PICK_UP,
    /* 0x0D */ BUTTON_STATUS_DIG,
    /* 0x0E */ BUTTON_STATUS_EAT,
    /* 0x0F */ BUTTON_STATUS_SELECT,
    /* 0x10 */ BUTTON_STATUS_LOCK,
    /* 0x11 */ BUTTON_STATUS_SWITCH,
    /* 0x12 */ BUTTON_STATUS_BACK,
    /* 0x13 */ BUTTON_STATUS_THROW,
    /* 0x14 */ BUTTON_STATUS_PLACE,
    /* 0x15 */ BUTTON_STATUS_GRAB,
    /* 0x16 */ BUTTON_STATUS_GET_OFF,
    /* 0x17 */ BUTTON_STATUS_GET_ON,
    /* 0x18 */ BUTTON_STATUS_PADDLE,
    /* 0x19 */ BUTTON_STATUS_JUMP,
    /* 0x1A */ BUTTON_STATUS_READ,
    /* 0x1B */ BUTTON_STATUS_LOOK,

    /* 0x52 */ BUTTON_STATUS_HOOK,
    /* 0x53 */ BUTTON_STATUS_CHANGE_LOCKS,
    /* 0x54 */ BUTTON_STATUS_EQUIP,
    /* 0x55 */ BUTTON_STATUS_PULL,
    /* 0x56 */ BUTTON_STATUS_REEL,
    /* 0x57 */ BUTTON_STATUS_EXTRACT,
    /* 0x58 */ BUTTON_STATUS_SPIN,
    /* 0x59 */ BUTTON_STATUS_UNK_89,
    /* 0x5A */ BUTTON_STATUS_SPIN_ATTACK,
    /* 0x5B */ BUTTON_STATUS_REEL_FAST,
    /* 0x5C */ BUTTON_STATUS_RAISE,
    /* 0x5D */ BUTTON_STATUS_RELEASE,
    /* 0x5E */ BUTTON_STATUS_UNK_94,
    /* 0x5F */ BUTTON_STATUS_MAP,
    /* 0x60 */ BUTTON_STATUS_ITEMS,
    /* 0x61 */ BUTTON_STATUS_INSERT,
    /* 0x62 */ BUTTON_STATUS_DRAW,
    /* 0x63 */ BUTTON_STATUS_STRIKE,
    /* 0x64 */ BUTTON_STATUS_BLANK,
    /* 0x65 */ BUTTON_STATUS_UNK_101,
    /* 0x66 */ BUTTON_STATUS_POINT_WII_REMOTE,
    /* 0x67 */ BUTTON_STATUS_FLIP,
    /* 0x68 */ BUTTON_STATUS_CHANGE_VIEW,
    /* 0x69 */ BUTTON_STATUS_UNK_105,
    /* 0x6A */ BUTTON_STATUS_UNK_106,
    /* 0x6B */ BUTTON_STATUS_CHANCE,
    /* 0x6C */ BUTTON_STATUS_SCOOP,
    /* 0x6D */ BUTTON_STATUS_SURVEY,
    /* 0x6E */ BUTTON_STATUS_CANCEL,
    /* 0x6F */ BUTTON_STATUS_SEIZE,
    /* 0x70 */ BUTTON_STATUS_COLLECTION,
    /* 0x71 */ BUTTON_STATUS_AREA_MAP,
    /* 0x72 */ BUTTON_STATUS_ACTION,
    /* 0x73 */ BUTTON_STATUS_SET_HOOK,
    /* 0x74 */ BUTTON_STATUS_TILT,
    /* 0x75 */ BUTTON_STATUS_THRUST,
    /* 0x76 */ BUTTON_STATUS_ROTATE,
    /* 0x77 */ BUTTON_STATUS_HELM_SPLITTER,
    /* 0x78 */ BUTTON_STATUS_MOVE,
    /* 0x79 */ BUTTON_STATUS_UNK_121,
    /* 0x7A */ BUTTON_STATUS_HOLD_ON,
    /* 0x7B */ BUTTON_STATUS_UNK_123,
    /* 0x7C */ BUTTON_STATUS_HELP,
    /* 0x7D */ BUTTON_STATUS_ZOOM_IN,
    /* 0x7E */ BUTTON_STATUS_ZOOM_OUT,
    /* 0x7F */ BUTTON_STATUS_MOVE_CLOSER_TV,
    /* 0x80 */ BUTTON_STATUS_UNK_128,
    /* 0x81 */ BUTTON_STATUS_UNK_129,
    /* 0x82 */ BUTTON_STATUS_UNK_130,
    /* 0x83 */ BUTTON_STATUS_UNK_131,
    /* 0x84 */ BUTTON_STATUS_UNK_132,
    /* 0x85 */ BUTTON_STATUS_UNK_133,
    /* 0x86 */ BUTTON_STATUS_UNK_134,
    /* 0x87 */ BUTTON_STATUS_UNK_135,
    /* 0x88 */ BUTTON_STATUS_UNK_136,
    /* 0x89 */ BUTTON_STATUS_UNK_137,
    /* 0x8A */ BUTTON_STATUS_UNK_138,
    /* 0x8B */ BUTTON_STATUS_UNK_139,
    /* 0x8C */ BUTTON_STATUS_UNK_140,
    /* 0x8D */ BUTTON_STATUS_UNK_141,
    /* 0x8E */ BUTTON_STATUS_UNK_142,
    /* 0x8F */ BUTTON_STATUS_UNK_143,
    /* 0x90 */ BUTTON_STATUS_UNK_144,
    /* 0x91 */ BUTTON_STATUS_UNK_145,
    /* 0x92 */ BUTTON_STATUS_UNK_146,
    /* 0x93 */ BUTTON_STATUS_UNK_147,
    /* 0x94 */ BUTTON_STATUS_UNK_148,
    /* 0x95 */ BUTTON_STATUS_UNK_149,
    /* 0x96 */ BUTTON_STATUS_UNK_150,
    /* 0x97 */ BUTTON_STATUS_UNK_151,
    /* 0x98 */ BUTTON_STATUS_UNK_152,
    /* 0x99 */ BUTTON_STATUS_UNK_153,
};

enum dComIfG_ButtonStatusFlag {
    /* 0x0 */ BUTTON_STATUS_FLAG_NONE,
    /* 0x2 */ BUTTON_STATUS_FLAG_EMPHASIS = 2,
    /* 0x4 */ BUTTON_STATUS_FLAG_CONTINUATION = 4,
};

class JKRAramArchive;
class dSmplMdl_draw_c;
class dTimer_c;
class daPy_py_c;
class scene_class;

class __d_timer_info_c {
public:
    __d_timer_info_c() {
        mTimerMode = -1;
        mTimerLimitTimeMs = 0;
        mTimerNowTimeMs = 0;
        mTimerPtr = NULL;
    }
    dTimer_c* mTimerPtr;
    s32 mTimerNowTimeMs;
    s32 mTimerLimitTimeMs;
    s32 mTimerMode;
    u8 mTimerType;
};

class phaseParam_c {
public:
    phaseParam_c(const char* name, JKRHeap* heap) {
        mResName = name;
        mpHeap = heap;
    }

    /* 0x0 */ const char* mResName;
    /* 0x4 */ JKRHeap* mpHeap;
};

class camera_class;
class dComIfG_camera_info_class {
public:
    dComIfG_camera_info_class() {}
    ~dComIfG_camera_info_class() {}

    /* 0x00 */ camera_class* mCamera;
    /* 0x04 */ s8 field_0x4;
    /* 0x05 */ s8 field_0x5;
    /* 0x06 */ s8 field_0x6;
    /* 0x07 */ u8 field_0x7;
    /* 0x08 */ u32 mCameraAttentionStatus;
    /* 0x0C */ f32 mCameraZoomScale;
    /* 0x10 */ f32 mCameraZoomForcus;
    /* 0x14 */ char* mCameraParamFileName;
    class {
    public:
        /* 0x18 */ cXyz mCameraPos;
        /* 0x24 */ cXyz mCameraTarget;
        /* 0x30 */ f32 mCameraFovy;
        /* 0x34 */ s16 mCameraBank;
    } mCamInfo;
};
STATIC_ASSERT(sizeof(dComIfG_camera_info_class) == 0x38);

class dComIfG_resLoader_c {
public:
    dComIfG_resLoader_c();
    ~dComIfG_resLoader_c();
    int load(char const**, JKRHeap*);

private:
    /* 0x0 */ const char** mResNameTable;
    /* 0x4 */ request_of_phase_process_class mPhase;
    /* 0xC */ u8 mLoadIndex;
};

enum PlayerPtr { LINK_PTR, HORSE_PTR };

class daHorse_c;
class dPa_control_c;
class daAlink_c;
class dMsgObject_c;
class J2DOrthoGraph;

class dComIfG_MesgCamInfo_c {
public:
    /* 0x00 */ int mID;
    /* 0x04 */ int mBasicID;
    /* 0x08 */ fopAc_ac_c* mActor[10];
};

class dComIfG_item_info_class {
public:
    /* 0x04E84 */ dMsgObject_c* mMsgObjectClass;
    /* 0x04E88 */ f32 mItemLifeCount;
    /* 0x04E8C */ s32 mItemRupeeCount;
    /* 0x04E90 */ s16 mItemKeyNumCount;
    /* 0x04E92 */ s16 mItemMaxLifeCount;
    /* 0x04E94 */ s16 mItemMagicCount;
    /* 0x04E96 */ s16 mItemNowMagicCount;
    /* 0x04E98 */ s16 mItemMaxMagicCount;
    /* 0x04E9A */ s16 field_0x4e9a;
    /* 0x04E9C */ s32 mItemOilCount;
    /* 0x04EA0 */ s32 mItemNowOil;
    /* 0x04EA4 */ int mItemMaxOilCount;
    /* 0x04EA8 */ int mOxygen;
    /* 0x04EAC */ int mNowOxygen;
    /* 0x04EB0 */ int mMaxOxygen;
    /* 0x04EB4 */ int mOxygenCount;
    /* 0x04EB8 */ int mMaxOxygenCount;
    /* 0x04EBC */ s16 mItemArrowNumCount;
    /* 0x04EBE */ s16 mItemPachinkoNumCount;
    /* 0x04EC0 */ s16 mItemMaxArrowNumCount;
    /* 0x04EC2 */ s16 mItemBombNumCount[3];
    /* 0x04EC8 */ s16 field_0x4ec8;
    /* 0x04ECA */ u8 field_0x4eca[2];
    /* 0x04ECC */ s16 mItemMaxBombNumCount1;
    /* 0x04ECE */ s16 mItemMaxBombNumCount2;
    /* 0x04ED0 */ u8 field_0x4ed0[4];
    /* 0x04ED4 */ int mMessageCountNum;
    /* 0x04ED8 */ s16 field_0x4ed8;
    /* 0x04EDA */ u8 field_0x4eda[0x4EDE - 0x4EDA];
    /* 0x04EDE */ u16 mItemNowLife;
    /* 0x04EE0 */ u8 field_0x4ee0[2];
    /* 0x04EE2 */ u8 mMesgStatus;
    /* 0x04EE3 */ u8 field_0x4ee3;
    /* 0x04EE4 */ u8 mRStatus;
    /* 0x04EE5 */ u8 mAStatus;  // B button
    /* 0x04EE6 */ u8 field_0x4ee6;
    /* 0x04EE7 */ u8 mNunStatus;
    /* 0x04EE8 */ u8 mBottleStatus;
    /* 0x04EE9 */ u8 mRemoConStatus;
    /* 0x04EEA */ u8 field_0x4eea[2];
    /* 0x04EEC */ u8 mDoStatus;  // A button
    /* 0x04EED */ u8 field_0x4eed;
    /* 0x04EEE */ u8 m3DStatus;
    /* 0x04EEF */ u8 field_0x4eef;  // related to NunStatusForce
    /* 0x04EF0 */ u8 field_0x4ef0;  // related to NunStatus
    /* 0x04EF1 */ u8 field_0x4ef1;  // related to RemoConStatusForce
    /* 0x04EF2 */ u8 field_0x4ef2;  // related to RemoConStatus
    /* 0x04EF3 */ u8 field_0x4ef3[2];
    /* 0x04EF5 */ u8 m3DDirection;
    /* 0x04EF6 */ u8 m3DDirectionForce;
    /* 0x04EF7 */ u8 mCStickStatus;
    /* 0x04EF8 */ u8 mCStickDirection;
    /* 0x04EF9 */ u8 mCStickDirectionForce;
    /* 0x04EFA */ u8 mSButtonStatus;
    /* 0x04EFB */ u8 mZStatus;
    /* 0x04EFC */ u8 mRStatusForce;
    /* 0x04EFD */ u8 mAStatusForce;
    /* 0x04EFE */ u8 field_0x4efe;
    /* 0x04EFF */ u8 field_0x4eff;  // related to NunStatusForce
    /* 0x04F00 */ u8 mBottleStatusForce;
    /* 0x04F01 */ u8 field_0x4f01;  // related to RemoConStatusForce
    /* 0x04F02 */ u8 field_0x4f02[2];
    /* 0x04F04 */ u8 mDoStatusForce;
    /* 0x04F05 */ u8 mTouchStatusForce;
    /* 0x04F06 */ u8 m3DStatusForce;
    /* 0x04F07 */ u8 mCStickStatusForce;
    /* 0x04F08 */ u8 mSButtonStatusForce;
    /* 0x04F09 */ u8 mZStatusForce;
    /* 0x04F0A */ u8 mRSetFlag;
    /* 0x04F0B */ u8 mASetFlag;
    /* 0x04F0C */ u8 field_0x4f0c;
    /* 0x04F0D */ u8 mNunSetFlag;
    /* 0x04F0E */ u8 mBottleSetFlag;
    /* 0x04F0F */ u8 mRemoConSetFlag;
    /* 0x04F10 */ u8 field_0x4f10[2];
    /* 0x04F12 */ u8 mDoSetFlag;
    /* 0x04F13 */ u8 m3DSetFlag;
    /* 0x04F14 */ u8 mCStickSetFlag;
    /* 0x04F15 */ u8 mSButtonSetFlag;
    /* 0x04F16 */ u8 mZSetFlag;
    /* 0x04F17 */ u8 mRSetFlagForce;
    /* 0x04F18 */ u8 mASetFlagForce;
    /* 0x04F19 */ u8 field_0x4f19;
    /* 0x04F1A */ u8 field_0x4f1a;  // related to NunStatusForce
    /* 0x04F1B */ u8 mBottleSetFlagForce;
    /* 0x04F1C */ u8 field_0x4f1c;  // related to RemoConStatusForce
    /* 0x04F1D */ u8 field_0x4f1d[2];
    /* 0x04F1F */ u8 mDoSetFlagForce;
    /* 0x04F20 */ u8 m3DSetFlagForce;
    /* 0x04F21 */ u8 mCStickSetFlagForce;
    /* 0x04F22 */ u8 mSButtonSetFlagForce;
    /* 0x04F23 */ u8 mZSetFlagForce;
    /* 0x04F24 */ u8 mXStatus;
    /* 0x04F25 */ u8 mXStatusForce;
    /* 0x04F26 */ u8 mXSetFlag;
    /* 0x04F27 */ u8 mXSetFlagForce;
    /* 0x04F28 */ u8 mYStatus;
    /* 0x04F29 */ u8 mYStatusForce;
    /* 0x04F2A */ u8 mYSetFlag;
    /* 0x04F2B */ u8 mYSetFlagForce;
    /* 0x04F2C */ u8 mNunZStatus;
    /* 0x04F2D */ u8 mNunZSetFlag;
    /* 0x04F2E */ u8 field_0x4fc6;  // related to NunZStatusForce
    /* 0x04F2F */ u8 field_0x4fc7;  // related to NunZStatusForce
    /* 0x04F30 */ u8 mNunCStatus;
    /* 0x04F31 */ u8 mNunCSetFlag;
    /* 0x04F32 */ u8 field_0x4fca;  // related to NunCStatusForce
    /* 0x04F33 */ u8 field_0x4fcb;  // related to NunCStatusForce
    /* 0x04F34 */ u8 mSelectItem[8];
    /* 0x04F3C */ u8 mSelectEquip[6];
    /* 0x04F42 */ u8 mBaseAnimeID;
    /* 0x04F43 */ u8 mFaceAnimeID;
    /* 0x04F44 */ u8 mNowAnimeID;
    /* 0x04F45 */ u8 mItemSlot;
    /* 0x04F46 */ u8 mItemID;
    /* 0x04F47 */ u8 field_0x4f47[2];
    /* 0x04F49 */ u8 mDirection;
    /* 0x04F4A */ u8 field_0x4f4a;
#if PLATFORM_WII || PLATFORM_SHIELD
    /* 0x04FE3 */ u8 unk_0x4fe3;
#endif
    /* 0x04F4B */ u8 field_0x4f4b;  // related to itemInit
    /* 0x04F4C */ u8 field_0x4f4c;  // related to itemInit
    /* 0x04F4D */ u8 field_0x4f4d;
    /* 0x04F4E */ u8 mMesgCancelButton;
    /* 0x04F4F */ u8 field_0x4f4f[2];
    /* 0x04F51 */ u8 mGameoverStatus;
    /* 0x04F52 */ u8 field_0x4f52[5];
    /* 0x04F57 */ u8 mHeapLockFlag;
    /* 0x04F58 */ u8 mSubHeapLockFlag[2];
    /* 0x04F5A */ u8 mNowVibration;
    /* 0x04F5B */ u8 field_0x4f5b[2];
    /* 0x04F5D */ u8 mWolfAbility[12];
    /* 0x04F69 */ u8 mNeedLightDropNum;
    /* 0x04F6A */ u8 field_0x4f6a[18];
    /* 0x04F7C */ u8 mMesgBgm;
    /* 0x04F7D */ u8 mPauseFlag;
    /* 0x04F7E */ u8 mItemLifeCountType;
    /* 0x04F7F */ u8 mOxygenShowFlag;
    /* 0x04F80 */ u8 mShow2D;
    /* 0x04F84 */ JKRExpHeap* mExpHeap2D;
    /* 0x04F88 */ JKRExpHeap* mSubExpHeap2D[2];
    /* 0x04F90 */ JKRExpHeap* mMsgExpHeap;
    /* 0x04F94 */ dSv_memBit_c::WarpItemData_c mWarpItemData;
};

class dComIfG_play_c {
public:
    dComIfG_play_c() { this->ct(); }
    void ct();
    void init();
    void itemInit();
    void setItemBombNumCount(u8 i_item, s16 count);
    s16 getItemBombNumCount(u8 i_item);
    void clearItemBombNumCount(u8 i_item);
    s16 getItemMaxBombNumCount(u8 i_bombType);
    void setNowVibration(u8 vib_status);
    u32 getNowVibration();
    void setStartStage(dStage_startStage_c* p_startStage);
    static int getLayerNo_common_common(char const* stageName, int roomId, int layer);
    static int getLayerNo_common(char const* stageName, int roomId, int layer);
    static int getLayerNo(int);
    void createParticle();
    dSmplMdl_draw_c* createSimpleModel();
    void deleteSimpleModel();
    void drawSimpleModel();
    int addSimpleModel(J3DModelData* i_modelData, int roomNo, u8 drawBG);
    int removeSimpleModel(J3DModelData* i_modelData, int roomNo);
    void entrySimpleModel(J3DModel* i_model, int roomNo);
    void setTimerNowTimeMs(int time);
    int getTimerNowTimeMs();
    void setTimerLimitTimeMs(int time);
    int getTimerLimitTimeMs();
    void setTimerMode(int mode);
    int getTimerMode();
    void setTimerType(u8 type);
    u8 getTimerType();
    void setTimerPtr(dTimer_c* ptr);
    dTimer_c* getTimerPtr();
    void setWarpItemData(const char* stage, cXyz pos, s16 angle, s8 roomNo, u8, u8);
    ~dComIfG_play_c() {}

    dStage_startStage_c* getStartStage() { return &mStartStage; }
    const char* getStartStageName() { return mStartStage.getName(); }
    s16 getStartStagePoint() { return mStartStage.getPoint(); }
    s8 getStartStageRoomNo() { return mStartStage.getRoomNo(); }
    s8 getStartStageLayer() { return mStartStage.getLayer(); }
    void setStartStageLayer(s8 layer) { mStartStage.setLayer(layer); }
    s8 getStartStageDarkArea() { return mStartStage.getDarkArea(); }
    void setStartStageDarkArea(s8 darkArea) { mStartStage.setDarkArea(darkArea); }

    dStage_startStage_c* getNextStartStage() { return mNextStage.getStartStage(); }
    const char* getNextStageName() { return mNextStage.getName(); }
    s16 getNextStagePoint() { return mNextStage.getPoint(); }
    s8 getNextStageRoomNo() { return mNextStage.getRoomNo(); }
    s8 getNextStageLayer() { return mNextStage.getLayer(); }
    BOOL isEnableNextStage() { return mNextStage.isEnable(); }
    void offEnableNextStage() { mNextStage.offEnable(); }
    s8 getNextStageWipe() { return mNextStage.getWipe(); }
    u8 getNextStageWipeSpeed() { return mNextStage.getWipeSpeed(); }
    void setNextStage(const char* stage, s8 roomNo, s16 point, s8 layer, s8 wipe, u8 wipe_speed) {
        mNextStage.set(stage, roomNo, point, layer, wipe, wipe_speed);
    }

    dStage_stageDt_c& getStage() { return mStageData; }
    dStage_roomControl_c* getRoomControl() { return &mRoomControl; }
    dEvt_control_c* getEvent() { return &mEvent; }
    dEvent_manager_c& getEvtManager() { return mEvtManager; }
    dAttention_c* getAttention() { return &mAttention; }
    dVibration_c& getVibration() { return mVibration; }

    JKRAramArchive* getFieldMapArchive2() { return (JKRAramArchive*)mFieldMapArchive2; }
    void setFieldMapArchive2(JKRArchive* arc) { mFieldMapArchive2 = arc; }
    JKRArchive* getMsgArchive(int idx) { return mMsgArchive[idx]; }
    void setMsgArchive(int i, JKRArchive* arc) { mMsgArchive[i] = arc; }
    JKRArchive* getDemoMsgArchive() { return mDemoMsgArchive; }
    void setDemoMsgArchive(JKRArchive* arc) { mDemoMsgArchive = arc; }
    JKRArchive* getMeterButtonArchive() { return mMeterButtonArchive; }
    void setMeterButtonArchive(JKRArchive* arc) { mMeterButtonArchive = arc; }
    JKRArchive* getFontArchive() { return mFontArchive; }
    void setFontArchive(JKRArchive* arc) { mFontArchive = arc; }
    JKRArchive* getRubyArchive() { return mRubyArchive; }
    void setRubyArchive(JKRArchive* arc) { mRubyArchive = arc; }
    JKRArchive* getAnmArchive() { return mAnmArchive; }
    void setAnmArchive(JKRArchive* arc) { mAnmArchive = arc; }
    JKRArchive* getCollectResArchive() { return mCollectResArchive; }
    void setCollectResArchive(JKRArchive* arc) { mCollectResArchive = arc; }
    JKRArchive* getFmapResArchive() { return mFmapResArchive; }
    void setFmapResArchive(JKRArchive* arc) { mFmapResArchive = arc; }
    JKRArchive* getDmapResArchive() { return mDmapResArchive; }
    void setDmapResArchive(JKRArchive* arc) { mDmapResArchive = arc; }
    JKRArchive* getOptionResArchive() { return mOptionResArchive; }
    void setOptionResArchive(JKRArchive* arc) { mOptionResArchive = arc; }
    JKRArchive* getItemIconArchive() { return mItemIconArchive; }
    void setItemIconArchive(JKRArchive* arc) { mItemIconArchive = arc; }
    JKRArchive* getNameResArchive() { return mNameResArchive; }
    void setNameResArchive(JKRArchive* arc) { mNameResArchive = arc; }
    void setErrorResArchive(JKRArchive* arc) { mErrorResArchive = arc; }
    JKRArchive* getAllMapArchive() { return mAllMapArchive; }
    void setAllMapArchive(JKRArchive* arc) { mAllMapArchive = arc; }
    JKRArchive* getMsgCommonArchive() { return mMsgCommonArchive; }
    void setMsgCommonArchive(JKRArchive* arc) { mMsgCommonArchive = arc; }
    JKRArchive* getRingResArchive() { return mRingResArchive; }
    void setRingResArchive(JKRArchive* arc) { mRingResArchive = arc; }
    JKRArchive* getCardIconResArchive() { return mCardIconResArchive; }
    void setCardIconResArchive(JKRArchive* arc) { mCardIconResArchive = arc; }
    JKRArchive* getMsgDtArchive() { return mMsgDtArchive[0]; }
    JKRArchive* getMsgDtArchive(int idx) { return mMsgDtArchive[idx]; }
    void setMsgDtArchive(int i, JKRArchive* arc) { mMsgDtArchive[i] = arc; }
    JKRArchive* getMain2DArchive() { return mMain2DArchive; }
    void setMain2DArchive(JKRArchive* arc) { mMain2DArchive = arc; }

    dPa_control_c* getParticle() { return mParticle; }
    dSmplMdl_draw_c* getSimpleModel() { return mSimpleModel; }
    int getWindowNum() { return mWindowNum; }
    void setWindowNum(u8 num) { mWindowNum = num; }
    s8 getLayerOld() { return mLayerOld; }
    s32 checkStatus(u16 flags) { return flags & mStatus; }
    void setStatus(u16 status) { mStatus = status; }
    void onStatus(u16 i_status) { mStatus |= i_status; }
    dDlst_window_c* getWindow(int i) { return &mWindow[i]; }
    void setWindow(int i, f32 param_1, f32 param_2, f32 param_3, f32 param_4, f32 param_5,
                   f32 param_6, int camID, int mode) {
        mWindow[i].setViewPort(param_1, param_2, param_3, param_4, param_5, param_6);
        mWindow[i].setScissor(param_1, param_2, param_3, param_4);
        mWindow[i].setCameraID(camID);
        mWindow[i].setMode(mode);
    }

    camera_class* getCamera(int idx) { return mCameraInfo[idx].mCamera; }
    void setCamera(int i, camera_class* cam) { mCameraInfo[i].mCamera = cam; }
    int getCameraWinID(int i) { return mCameraInfo[i].field_0x4; }
    int getCameraPlayer1ID(int i) { return mCameraInfo[i].field_0x5; }
    int getCameraPlayer2ID(int i) { return mCameraInfo[i].field_0x6; }
    u32 getCameraAttentionStatus(int i) { return mCameraInfo[i].mCameraAttentionStatus; }
    BOOL checkCameraAttentionStatus(int i, u32 flag) {
        return mCameraInfo[i].mCameraAttentionStatus & flag;
    }
    void setCameraAttentionStatus(int i, u32 flag) { mCameraInfo[i].mCameraAttentionStatus = flag; }
    void onCameraAttentionStatus(int i, u32 flag) { mCameraInfo[i].mCameraAttentionStatus |= flag; }
    void offCameraAttentionStatus(int i, u32 flag) {
        mCameraInfo[i].mCameraAttentionStatus &= ~flag;
    }
    void setCameraInfo(int camIdx, camera_class* p_cam, int param_2, int param_3, int param_4) {
        mCameraInfo[camIdx].mCamera = p_cam;
        mCameraInfo[camIdx].field_0x4 = param_2;
        mCameraInfo[camIdx].field_0x5 = param_3;
        mCameraInfo[camIdx].field_0x6 = param_4;
        setCameraAttentionStatus(camIdx, 0);
    }
    f32 getCameraZoomScale(int i_no) { return mCameraInfo[i_no].mCameraZoomScale; }
    void setCameraZoomScale(int i_no, f32 i_scale) { mCameraInfo[i_no].mCameraZoomScale = i_scale; }
    f32 getCameraZoomForcus(int i_no) { return mCameraInfo[i_no].mCameraZoomForcus; }
    void setCameraZoomForcus(int i_no, f32 i_focus) {
        mCameraInfo[i_no].mCameraZoomForcus = i_focus;
    }
    const char* getCameraParamFileName(int i) { return mCameraInfo[i].mCameraParamFileName; }
    void setCameraParamFileName(int i, char* name) { mCameraInfo[i].mCameraParamFileName = name; }
    void saveCameraPosition(int i, cXyz* i_pos, cXyz* i_target, f32 i_fovy, s16 i_bank) {
        mCameraInfo[i].mCamInfo.mCameraPos = *i_pos;
        mCameraInfo[i].mCamInfo.mCameraTarget = *i_target;
        mCameraInfo[i].mCamInfo.mCameraFovy = i_fovy;
        mCameraInfo[i].mCamInfo.mCameraBank = i_bank;
    }
    void loadCameraPosition(int i, cXyz* o_pos, cXyz* o_target, f32* o_fovy, s16* o_bank) {
        *o_pos = mCameraInfo[i].mCamInfo.mCameraPos;
        *o_target = mCameraInfo[i].mCamInfo.mCameraTarget;
        *o_fovy = mCameraInfo[i].mCamInfo.mCameraFovy;
        *o_bank = mCameraInfo[i].mCamInfo.mCameraBank;
    }

    fopAc_ac_c* getPlayer(int idx) { return mPlayerInfo[idx].mpPlayer; }
    void setPlayer(int i, fopAc_ac_c* player) { mPlayerInfo[i].mpPlayer = player; }
    int getPlayerCameraID(int i) { return mPlayerInfo[i].mCameraID; }
    void setPlayerInfo(int i, fopAc_ac_c* player, int cam) {
        mPlayerInfo[i].mpPlayer = player;
        mPlayerInfo[i].mCameraID = cam;
    }

    void* getPlayerPtr(int ptrIdx) { return mPlayerPtr[ptrIdx]; }
    void setPlayerPtr(int i, fopAc_ac_c* ptr) { mPlayerPtr[i] = ptr; }
    daHorse_c* getHorseActor() { return (daHorse_c*)mPlayerPtr[1]; }

    dMsgObject_c* getMsgObjectClass() { return mItemInfo.mMsgObjectClass; }
    void setMsgObjectClass(dMsgObject_c* obj) { mItemInfo.mMsgObjectClass = obj; }
    f32 getItemLifeCount() { return mItemInfo.mItemLifeCount; }
    u8& getItemLifeCountType() { return mItemInfo.mItemLifeCountType; }
    void setItemLifeCount(f32 hearts, u8 type) {
        mItemInfo.mItemLifeCount += hearts;
        mItemInfo.mItemLifeCountType = type;
    }
    void clearItemLifeCount() {
        mItemInfo.mItemLifeCount = 0.0f;
        mItemInfo.mItemLifeCountType = 0;
    }
    s32 getItemRupeeCount() { return mItemInfo.mItemRupeeCount; }
    void setItemRupeeCount(s32 rupees) { mItemInfo.mItemRupeeCount += rupees; }
    void clearItemRupeeCount() { mItemInfo.mItemRupeeCount = 0; }
    s16 getItemKeyNumCount() { return mItemInfo.mItemKeyNumCount; }
    void setItemKeyNumCount(s16 keys) { mItemInfo.mItemKeyNumCount += keys; }
    void clearItemKeyNumCount() { mItemInfo.mItemKeyNumCount = 0; }
    s16 getItemMaxLifeCount() { return mItemInfo.mItemMaxLifeCount; }
    void setItemMaxLifeCount(s16 max) { mItemInfo.mItemMaxLifeCount += max; }
    void clearItemMaxLifeCount() { mItemInfo.mItemMaxLifeCount = 0; }
    void setItemMagicCount(s16 magic) { mItemInfo.mItemMagicCount += magic; }
    void setItemNowMagic(s16 magic) { mItemInfo.mItemNowMagicCount = magic; }
    void setItemMaxMagicCount(s16 max) { mItemInfo.mItemMaxMagicCount += max; }
    s32 getItemOilCount() { return mItemInfo.mItemOilCount; }
    void setItemOilCount(s32 oil) { mItemInfo.mItemOilCount += oil; }
    void clearItemOilCount() { mItemInfo.mItemOilCount = 0; }
    s32 getItemNowOil() { return mItemInfo.mItemNowOil; }
    void setItemNowOil(s32 oil) { mItemInfo.mItemNowOil = oil; }
    s32 getItemMaxOilCount() { return mItemInfo.mItemMaxOilCount; }
    void clearItemMaxOilCount() { mItemInfo.mItemMaxOilCount = 0; }
    int getOxygen() { return mItemInfo.mOxygen; }
    void setOxygen(s32 oxygen) { mItemInfo.mOxygen = oxygen; }
    int getNowOxygen() { return mItemInfo.mNowOxygen; }
    void setNowOxygen(s32 oxygen) { mItemInfo.mNowOxygen = oxygen; }
    int getMaxOxygen() { return mItemInfo.mMaxOxygen; }
    void setMaxOxygen(s32 max) { mItemInfo.mMaxOxygen = max; }
    s32 getOxygenCount() { return mItemInfo.mOxygenCount; }
    void setOxygenCount(s32 oxygen) { mItemInfo.mOxygenCount += oxygen; }
    void clearOxygenCount() { mItemInfo.mOxygenCount = 0; }
    s32 getMaxOxygenCount() { return mItemInfo.mMaxOxygenCount; }
    void clearMaxOxygenCount() { mItemInfo.mMaxOxygenCount = 0; }
    s16 getItemArrowNumCount() { return mItemInfo.mItemArrowNumCount; }
    void setItemArrowNumCount(s16 arrows) { mItemInfo.mItemArrowNumCount += arrows; }
    void clearItemArrowNumCount() { mItemInfo.mItemArrowNumCount = 0; }
    s16 getItemPachinkoNumCount() { return mItemInfo.mItemPachinkoNumCount; }
    void setItemPachinkoNumCount(s16 seeds) { mItemInfo.mItemPachinkoNumCount += seeds; }
    void clearItemPachinkoNumCount() { mItemInfo.mItemPachinkoNumCount = 0; }
    s16 getItemMaxArrowNumCount() { return mItemInfo.mItemMaxArrowNumCount; }
    int getMessageCountNumber() { return mItemInfo.mMessageCountNum; }
    void setMessageCountNumber(u32 number) { mItemInfo.mMessageCountNum = number; }
    u16 getItemNowLife() { return mItemInfo.mItemNowLife; }
    void setItemNowLife(u16 life) { mItemInfo.mItemNowLife = life; }
    u8 getMesgStatus() { return mItemInfo.mMesgStatus; }
    u8 getRStatus() { return mItemInfo.mRStatus; }
    bool isRSetFlag(u8 flag) { return (mItemInfo.mRSetFlag & flag) ? true : false; }
    void setRStatus(u8 status, u8 flag) {
        mItemInfo.mRStatus = status;
        mItemInfo.mRSetFlag = flag;
    }
    u8 getRStatusForce() { return mItemInfo.mRStatusForce; }
    u8 getRSetFlagForce() { return mItemInfo.mRSetFlagForce; }
    void setRStatusForce(u8 status, u8 flag) {
        mItemInfo.mRStatusForce = status;
        mItemInfo.mRSetFlagForce = flag;
    }
    u8 getAStatus() { return mItemInfo.mAStatus; }
    bool isASetFlag(u8 flag) { return (mItemInfo.mASetFlag & flag) ? true : false; }
    void setAStatus(u8 status, u8 flag) {
        mItemInfo.mAStatus = status;
        mItemInfo.mASetFlag = flag;
    }
    u8 getAStatusForce() { return mItemInfo.mAStatusForce; }
    u8 getASetFlagForce() { return mItemInfo.mASetFlagForce; }
    void setAStatusForce(u8 status, u8 flag) {
        mItemInfo.mAStatusForce = status;
        mItemInfo.mASetFlagForce = flag;
    }
    u8 getNunStatus() { return mItemInfo.mNunStatus; }
    bool isNunSetFlag(u8 flag) { return (mItemInfo.mNunSetFlag & flag) ? true : false; }
    void setNunStatus(u8 status, u8 param_1, u8 flag) {
        mItemInfo.mNunStatus = status;
        mItemInfo.field_0x4ef0 = param_1;
        mItemInfo.mNunSetFlag = flag;
    }
    u8 getBottleStatus() { return mItemInfo.mBottleStatus; }
    bool isBottleSetFlag(u8 flag) { return (mItemInfo.mBottleSetFlag & flag) ? true : false; }
    void setBottleStatus(u8 status, u8 flag) {
        mItemInfo.mBottleStatus = status;
        mItemInfo.mBottleSetFlag = flag;
    }
    u8 getBottleStatusForce() { return mItemInfo.mBottleStatusForce; }
    u8 getBottleSetFlagForce() { return mItemInfo.mBottleSetFlagForce; }
    void setBottleStatusForce(u8 status, u8 flag) {
        mItemInfo.mBottleStatusForce = status;
        mItemInfo.mBottleSetFlagForce = flag;
    }
    u8 getRemoConStatus() { return mItemInfo.mRemoConStatus; }
    bool isRemoConSetFlag(u8 flag) { return (mItemInfo.mRemoConSetFlag & flag) ? true : false; }
    void setRemoConStatus(u8 status, u8 param_1, u8 flag) {
        mItemInfo.mRemoConStatus = status;
        mItemInfo.field_0x4ef2 = param_1;
        mItemInfo.mRemoConSetFlag = flag;
    }
    u8 getDoStatus() { return mItemInfo.mDoStatus; }
    bool isDoSetFlag(u8 flag) { return (mItemInfo.mDoSetFlag & flag) ? true : false; }
    void setDoStatus(u8 status, u8 flag) {
        mItemInfo.mDoStatus = status;
        mItemInfo.mDoSetFlag = flag;
    }
    u8 getDoStatusForce() { return mItemInfo.mDoStatusForce; }
    u8 getDoSetFlagForce() { return mItemInfo.mDoSetFlagForce; }
    void setDoStatusForce(u8 status, u8 flag) {
        mItemInfo.mDoStatusForce = status;
        mItemInfo.mDoSetFlagForce = flag;
    }
    u8 get3DStatus() { return mItemInfo.m3DStatus; }
    u8 get3DDirection() { return mItemInfo.m3DDirection; }
    bool is3DSetFlag(u8 flag) { return (mItemInfo.m3DSetFlag & flag) ? true : false; }
    void set3DStatus(u8 status, u8 direction, u8 flag) {
        mItemInfo.m3DStatus = status;
        mItemInfo.m3DDirection = direction;
        mItemInfo.m3DSetFlag = flag;
    }
    u8 get3DStatusForce() { return mItemInfo.m3DStatusForce; }
    u8 get3DDirectionForce() { return mItemInfo.m3DDirectionForce; }
    u8 get3DSetFlagForce() { return mItemInfo.m3DSetFlagForce; }
    void set3DStatusForce(u8 status, u8 direction, u8 flag) {
        mItemInfo.m3DStatusForce = status;
        mItemInfo.m3DDirectionForce = direction;
        mItemInfo.m3DSetFlagForce = flag;
    }
    u8 getCStickStatus() { return mItemInfo.mCStickStatus; }
    u8 getCStickDirection() { return mItemInfo.mCStickDirection; }
    bool isCStickSetFlag(u8 flag) { return (mItemInfo.mCStickSetFlag & flag) ? true : false; }
    void setCStickStatus(u8 status, u8 param_1, u8 flag) {
        mItemInfo.mCStickStatus = status;
        mItemInfo.mCStickDirection = param_1;
        mItemInfo.mCStickSetFlag = flag;
    }
    u8 getCStickStatusForce() { return mItemInfo.mCStickStatusForce; }
    u8 getCStickDirectionForce() { return mItemInfo.mCStickDirectionForce; }
    u8 getCStickSetFlagForce() { return mItemInfo.mCStickSetFlagForce; }
    void setCStickStatusForce(u8 status, u8 param_1, u8 flag) {
        mItemInfo.mCStickStatusForce = status;
        mItemInfo.mCStickDirectionForce = param_1;
        mItemInfo.mCStickSetFlagForce = flag;
    }
    u8 getSButtonStatus() { return mItemInfo.mSButtonStatus; }
    bool isSButtonSetFlag(u8 flag) { return (mItemInfo.mSButtonSetFlag & flag) ? true : false; }
    void setSButtonStatus(u8 status, u8 flag) {
        mItemInfo.mSButtonStatus = status;
        mItemInfo.mSButtonSetFlag = flag;
    }
    u8 getSButtonStatusForce() { return mItemInfo.mSButtonStatusForce; }
    u8 getSButtonSetFlagForce() { return mItemInfo.mSButtonSetFlagForce; }
    void setSButtonStatusForce(u8 status, u8 flag) {
        mItemInfo.mSButtonStatusForce = status;
        mItemInfo.mSButtonSetFlagForce = flag;
    }
    u8 getZStatus() { return mItemInfo.mZStatus; }
    bool isZSetFlag(u8 flag) { return (mItemInfo.mZSetFlag & flag) ? true : false; }
    void setZStatus(u8 status, u8 flag) {
        mItemInfo.mZStatus = status;
        mItemInfo.mZSetFlag = flag;
    }
    u8 getZStatusForce() { return mItemInfo.mZStatusForce; }
    u8 getZSetFlagForce() { return mItemInfo.mZSetFlagForce; }
    void setZStatusForce(u8 status, u8 flag) {
        mItemInfo.mZStatusForce = status;
        mItemInfo.mZSetFlagForce = flag;
    }
    u8 getXStatus() { return mItemInfo.mXStatus; }
    bool isXSetFlag(u8 flag) { return (mItemInfo.mXSetFlag & flag) ? true : false; }
    void setXStatus(u8 status, u8 flag) {
        mItemInfo.mXStatus = status;
        mItemInfo.mXSetFlag = flag;
    }
    u8 getXStatusForce() { return mItemInfo.mXStatusForce; }
    u8 getXSetFlagForce() { return mItemInfo.mXSetFlagForce; }
    void setXStatusForce(u8 status, u8 flag) {
        mItemInfo.mXStatusForce = status;
        mItemInfo.mXSetFlagForce = flag;
    }
    u8 getYStatus() { return mItemInfo.mYStatus; }
    bool isYSetFlag(u8 flag) { return (mItemInfo.mYSetFlag & flag) ? true : false; }
    void setYStatus(u8 status, u8 flag) {
        mItemInfo.mYStatus = status;
        mItemInfo.mYSetFlag = flag;
    }
    u8 getYStatusForce() { return mItemInfo.mYStatusForce; }
    u8 getYSetFlagForce() { return mItemInfo.mYSetFlagForce; }
    void setYStatusForce(u8 status, u8 flag) {
        mItemInfo.mYStatusForce = status;
        mItemInfo.mYSetFlagForce = flag;
    }
    u8 getNunZStatus() { return mItemInfo.mNunZStatus; }
    bool isNunZSetFlag(u8 flag) { return (mItemInfo.mNunZSetFlag & flag) ? true : false; }
    void setNunZStatus(u8 status, u8 flag) {
        mItemInfo.mNunZStatus = status;
        mItemInfo.mNunZSetFlag = flag;
    }
    u8 getNunCStatus() { return mItemInfo.mNunCStatus; }
    bool isNunCSetFlag(u8 flag) { return (mItemInfo.mNunCSetFlag & flag) ? true : false; }
    void setNunCStatus(u8 status, u8 flag) {
        mItemInfo.mNunCStatus = status;
        mItemInfo.mNunCSetFlag = flag;
    }
    u8 getSelectItem(int idx) { return mItemInfo.mSelectItem[idx]; }
    void setSelectItem(int idx, u8 i_itemNo) { mItemInfo.mSelectItem[idx] = i_itemNo; }
    void setSelectEquip(int idx, u8 item_id) { mItemInfo.mSelectEquip[idx] = item_id; }
    u8 getBaseAnimeID() { return mItemInfo.mBaseAnimeID; }
    void setBaseAnimeID(u8 id) { mItemInfo.mBaseAnimeID = id; }
    void clearBaseAnimeID() { mItemInfo.mBaseAnimeID = 0; }
    u8 getFaceAnimeID() { return mItemInfo.mFaceAnimeID; }
    void setFaceAnimeID(u8 id) { mItemInfo.mFaceAnimeID = id; }
    void clearFaceAnimeID() { mItemInfo.mFaceAnimeID = 0; }
    void clearNowAnimeID() { mItemInfo.mNowAnimeID = -1; }
    void setItem(u8 slot, u8 i_no) {
        mItemInfo.mItemSlot = slot;
        mItemInfo.mItemID = i_no;
    }
    u8 getDirection() { return mItemInfo.mDirection; }
    void setDirection(u8 i_dir) { mItemInfo.mDirection = i_dir; }
    u8 checkMesgCancelButton() { return mItemInfo.mMesgCancelButton; }
    void setMesgCancelButton(u8 button) { mItemInfo.mMesgCancelButton = button; }
    u8 getGameoverStatus() { return mItemInfo.mGameoverStatus; }
    void setGameoverStatus(u8 status) { mItemInfo.mGameoverStatus = status; }
    u8 isHeapLockFlag() { return mItemInfo.mHeapLockFlag; }
    void setHeapLockFlag(u8 status) { mItemInfo.mHeapLockFlag = status; }
    void offHeapLockFlag() { mItemInfo.mHeapLockFlag = 0; }
    u8 getSubHeapLockFlag(int idx) { return mItemInfo.mSubHeapLockFlag[idx]; }
    void setSubHeapLockFlag(int idx, u8 status) { mItemInfo.mSubHeapLockFlag[idx] = status; }
    u8 getWolfAbility(int i_idx) { return mItemInfo.mWolfAbility[i_idx]; }
    u8 getNeedLightDropNum() { return mItemInfo.mNeedLightDropNum; }
    void setNeedLightDropNum(u8 i_num) { mItemInfo.mNeedLightDropNum = i_num; }
    u8 checkMesgBgm() { return mItemInfo.mMesgBgm; }
    void setMesgBgm(u8 param_0) { mItemInfo.mMesgBgm = param_0; }
    u8 isPauseFlag() { return mItemInfo.mPauseFlag; }
    void offPauseFlag() { mItemInfo.mPauseFlag = false; }
    void onPauseFlag() { mItemInfo.mPauseFlag = true; }
    u8 getOxygenShowFlag() { return mItemInfo.mOxygenShowFlag; }
    void setOxygenShowFlag(u8 flag) { mItemInfo.mOxygenShowFlag = flag; }
    u8 show2dCheck() { return mItemInfo.mShow2D; }
    void show2dOn() { mItemInfo.mShow2D = 1; }
    void show2dOff() { mItemInfo.mShow2D = 0; }
    JKRExpHeap* getExpHeap2D() { return mItemInfo.mExpHeap2D; }
    void setExpHeap2D(void* heap) { mItemInfo.mExpHeap2D = (JKRExpHeap*)heap; }
    JKRExpHeap* getSubExpHeap2D(int idx) { return mItemInfo.mSubExpHeap2D[idx]; }
    void setSubExpHeap2D(int idx, void* heap) { mItemInfo.mSubExpHeap2D[idx] = (JKRExpHeap*)heap; }
    JKRExpHeap* getMsgExpHeap() { return mItemInfo.mMsgExpHeap; }
    void setMsgExpHeap(void* heap) { mItemInfo.mMsgExpHeap = (JKRExpHeap*)heap; }

    dComIfG_MesgCamInfo_c* getMesgCamInfo() { return &mMesgCamInfo; }
    void setMesgCamInfoID(int param_0) { mMesgCamInfo.mID = param_0; }
    void clearMesgCamInfoID() { mMesgCamInfo.mID = -1; }
    void setMesgCamInfoBasicID(int id) { mMesgCamInfo.mBasicID = id; }
    void clearMesgCamInfoBasicID() { mMesgCamInfo.mBasicID = 0; }
    void setMesgCamInfoActor(fopAc_ac_c* param_1, fopAc_ac_c* param_2, fopAc_ac_c* param_3,
                             fopAc_ac_c* param_4, fopAc_ac_c* param_5, fopAc_ac_c* param_6,
                             fopAc_ac_c* param_7, fopAc_ac_c* param_8, fopAc_ac_c* param_9,
                             fopAc_ac_c* param_10) {
        mMesgCamInfo.mActor[0] = param_1;
        mMesgCamInfo.mActor[1] = param_2;
        mMesgCamInfo.mActor[2] = param_3;
        mMesgCamInfo.mActor[3] = param_4;
        mMesgCamInfo.mActor[4] = param_5;
        mMesgCamInfo.mActor[5] = param_6;
        mMesgCamInfo.mActor[6] = param_7;
        mMesgCamInfo.mActor[7] = param_8;
        mMesgCamInfo.mActor[8] = param_9;
        mMesgCamInfo.mActor[9] = param_10;
    }

    u32 checkPlayerStatus(int param_0, int i, u32 flag) { return mPlayerStatus[param_0][i] & flag; }
    void setPlayerStatus(int param_0, int i, u32 flag) { mPlayerStatus[param_0][i] |= flag; }
    void clearPlayerStatus(int param_0, int i, u32 flag) { mPlayerStatus[param_0][i] &= ~flag; }

    void setCurrentWindow(dDlst_window_c* i_window) { mCurrentWindow = i_window; }
    void setCurrentView(view_class* i_view) { mCurrentView = i_view; }
    void setCurrentViewport(view_port_class* i_viewport) { mCurrentViewport = i_viewport; }
    J2DGrafContext* getCurrentGrafPort() { return (J2DGrafContext*)mCurrentGrafPort; }
    void setCurrentGrafPort(J2DOrthoGraph* i_graf) { mCurrentGrafPort = i_graf; }
    void* getItemTable() { return mItemTable; }
    void setItemTable(void* data) { mItemTable = data; }
    char* getLastPlayStageName() { return mLastPlayStageName; }
    void setLastPlayStageName(char* name) {
        strncpy(mLastPlayStageName, name, 7);
        mLastPlayStageName[7] = 0;
    }

public:
    /* 0x00000 */ dBgS mBgs;
    /* 0x01404 */ dCcS mCcs;
    /* 0x03EC8 */ dStage_startStage_c mStartStage;
    /* 0x03ED6 */ dStage_nextStage_c mNextStage;
    /* 0x03EE8 */ dStage_stageDt_c mStageData;
    /* 0x03F8C */ dStage_roomControl_c mRoomControl;
    /* 0x03F90 */ dEvt_control_c mEvent;
    /* 0x040C0 */ dEvent_manager_c mEvtManager;
    /* 0x04780 */ dAttention_c mAttention;
    #if PLATFORM_WII || VERSION == VERSION_SHIELD
    /* 0x04C9C */ u8 unk_0x4c9c[8];
    #endif
    /* 0x04C9C */ dVibration_c mVibration;
    /* 0x04D2C */ u8 field_0x4d2c[4];
    /* 0x04D30 */ JKRArchive* mFieldMapArchive2;
    /* 0x04D34 */ JKRArchive* mMsgArchive[11];
    /* 0x04D60 */ JKRArchive* mDemoMsgArchive;
    /* 0x04D64 */ JKRArchive* mMeterButtonArchive;
    /* 0x04D68 */ void* field_0x4d68;
    /* 0x04D6C */ JKRArchive* mFontArchive;
    /* 0x04D70 */ JKRArchive* mRubyArchive;
    /* 0x04D74 */ JKRArchive* mAnmArchive;
    /* 0x04D78 */ void* field_0x4d78[2];
    /* 0x04D80 */ JKRArchive* mCollectResArchive;
    /* 0x04D84 */ JKRArchive* mFmapResArchive;
    /* 0x04D88 */ JKRArchive* mDmapResArchive;
    /* 0x04D8C */ JKRArchive* mOptionResArchive;
    /* 0x04D90 */ void* field_0x4d90[2];
    /* 0x04D98 */ JKRArchive* mItemIconArchive;
    /* 0x04D9C */ JKRArchive* mNameResArchive;
    /* 0x04DA0 */ JKRArchive* mErrorResArchive;
    /* 0x04DA4 */ void* field_0x4da4;
    /* 0x04DA8 */ JKRArchive* mAllMapArchive;
    /* 0x04DAC */ JKRArchive* mMsgCommonArchive;
    /* 0x04DB0 */ JKRArchive* mRingResArchive;
    /* 0x04DB4 */ void* field_0x4db4;
    /* 0x04DB8 */ JKRArchive* mCardIconResArchive;
    /* 0x04DBC */ JKRArchive* mMsgDtArchive[15];
    /* 0x04DF8 */ JKRArchive* mMain2DArchive;
    /* 0x04DFC */ void* field_0x4dfc[2];
    /* 0x04E04 */ dPa_control_c* mParticle;
    /* 0x04E08 */ dSmplMdl_draw_c* mSimpleModel;
    /* 0x04E0C */ u8 mWindowNum;
    /* 0x04E0D */ s8 mLayerOld;
    /* 0x04E0E */ u16 mStatus;
    /* 0x04E10 */ dDlst_window_c mWindow[1];
    /* 0x04E3C */ dComIfG_camera_info_class mCameraInfo[1];
    /* 0x04E74 */ struct {
        /* 0x0 */ fopAc_ac_c* mpPlayer;
        /* 0x4 */ s8 mCameraID;
    } mPlayerInfo[1];
    /* 0x04E7C */ fopAc_ac_c* mPlayerPtr[2];  // 0: Player, 1: Horse ; type may be wrong
    /* 0x04E84 */ dComIfG_item_info_class mItemInfo;
    /* 0x04FB0 */ dComIfG_MesgCamInfo_c mMesgCamInfo;
    /* 0x04FE0 */ u32 mPlayerStatus[1][4];
    /* 0x04FF0 */ u8 field_0x4ff0[0x8];
    /* 0x04FF8 */ __d_timer_info_c mTimerInfo;
    /* 0x0500C */ dDlst_window_c* mCurrentWindow;
    /* 0x05010 */ view_class* mCurrentView;
    /* 0x05014 */ view_port_class* mCurrentViewport;
    /* 0x05018 */ J2DOrthoGraph* mCurrentGrafPort;
    /* 0x0501C */ void* mItemTable;
    /* 0x0501D */ u8 field_0x501d[4];
    /* 0x05024 */ char mLastPlayStageName[8];
};

class dComIfG_inf_c {
public:
    dComIfG_inf_c() { this->ct(); }
    ~dComIfG_inf_c() {}
    void ct();
    void createBaseCsr();

#if PLATFORM_WII || VERSION == VERSION_SHIELD_DEBUG
    class baseCsr_c : public mDoGph_gInf_c::csr_c {
    public:
        class navi_c {
        public:
            navi_c() : m_heap(NULL), m_model(NULL), field_0x40(0.0f, 0.0f, 0.0f), field_0x4c(0, 0, 0) {
                field_0x54 = 0.0f;
                mParticleId = 0;
            }
            virtual ~navi_c() {}
            void create();
            bool draw(f32, f32, u8);
            u32 getParticleId() { return mParticleId; }

            JKRSolidHeap* m_heap;
            J3DModel* m_model;
            mDoExt_bckAnm m_bck;
            mDoExt_brkAnm m_brk;
            cXyz field_0x40;
            csXyz field_0x4c;
            f32 field_0x54;
            f32 field_0x58;
            f32 field_0x5c;
            u32 mParticleId;
        };

        virtual ~baseCsr_c() {}
        baseCsr_c(u8);
        void draw(f32, f32);
        void create();
        static void particleExecute();
        static navi_c* getNavi() { return m_navi; }

        /* 0x008 */ dDlst_blo_c field_0x8;
        /* 0x130 */ dDlst_blo_c::anm_c anm;
        /* 0x13C */ u8 field_0x13c;
        /* 0x13D */ u8 field_0x13d;
        /* 0x13E */ u8 field_0x13e;

        static dPa_hermiteEcallBack_c m_blurCB;
        static u32 _m_blurID;
        static navi_c* m_navi;
    };

    class anmCsr_c : public mDoGph_gInf_c::csr_c {
    public:
        virtual ~anmCsr_c() {}
        void draw(f32, f32);

        dDlst_blo_c field_0x8;
    };
#endif

    /* 0x00000 */ dSv_info_c info;
    /* 0x00F38 */ dComIfG_play_c play;
    /* 0x05F64 */ dDlst_list_c drawlist;
    /* 0x1C2F8 */ dRes_control_c mResControl;
    /* 0x1DDF8 */ u8 mFadeBrightness;
    /* 0x1DDF9 */ u8 mWorldDark;
    /* 0x1DDFA */ s8 field_0x1ddfa;
    /* 0x1DDFB */ s8 mPolyDamageOff;
    /* 0x1DDFC */ s8 field_0x1ddfc;
    /* 0x1DE00 */ u32 field_0x1de00;
    /* 0x1DE04 */ u32 field_0x1de04;
    /* 0x1DE08 */ u8 field_0x1de08;
    /* 0x1DE09 */ u8 field_0x1de09;
    /* 0x1DE0A */ u8 field_0x1de0a;
    /* 0x1DE0B */ u8 mIsDebugMode;
    /* 0x1DE0C */ u8 field_0x1de0c;

    static __d_timer_info_c dComIfG_mTimerInfo;
    #if PLATFORM_WII || VERSION == VERSION_SHIELD_DEBUG
    static baseCsr_c* m_baseCsr;
    #endif
};  // Size: 0x1DE10

STATIC_ASSERT(122384 == sizeof(dComIfG_inf_c));

extern dComIfG_inf_c g_dComIfG_gameInfo;
extern GXColor g_blackColor;
extern GXColor g_clearColor;
extern GXColor g_whiteColor;
extern GXColor g_saftyWhiteColor;

BOOL dComIfGs_isStageTbox(int i_stageNo, int i_no);
void dComIfGs_onStageSwitch(int i_stageNo, int i_no);
void dComIfGs_offStageSwitch(int i_stageNo, int i_no);
BOOL dComIfGs_isStageSwitch(int i_stageNo, int i_no);
void dComIfGs_onDungeonItemMap(int i_stageNo);
void dComIfGs_offDungeonItemMap(int i_stageNo);
s32 dComIfGs_isDungeonItemMap(int i_stageNo);
void dComIfGs_onDungeonItemCompass(int i_stageNo);
void dComIfGs_offDungeonItemCompass(int i_stageNo);
s32 dComIfGs_isDungeonItemCompass(int i_stageNo);
void dComIfGs_onDungeonItemBossKey(int i_stageNo);
