/**
 * @file d_a_obj_chest.cpp
 * @brief Object - Chest
 * 
*/

#include "rel/d/a/obj/d_a_obj_chest/d_a_obj_chest.h"
#include "dol2asm.h"
#include "JSystem/JKernel/JKRHeap.h"
#include "d/d_procname.h"
#include "d/bg/d_bg_w.h"
#include "d/bg/d_bg_s.h"
#include "d/a/d_a_player.h"
#include "SSystem/SComponent/c_math.h"
#include "rel/d/a/obj/d_a_obj_eff/d_a_obj_eff.h"

//
// Types:
//

class daObjChest_c : public dBgS_MoveBgActor {
public:
    /* 80BC8EF8 */ void initBaseMtx();
    /* 80BC8F34 */ void setBaseMtx();
    /* 80BC9088 */ int Create();
    /* 80BC9240 */ int CreateHeap();
    /* 80BC92B0 */ int create();
    /* 80BC970C */ int Execute(Mtx**);
    /* 80BC9764 */ void action();
    /* 80BC9808 */ void actionWait();
    /* 80BC9BF0 */ void actionMove();
    /* 80BC9DFC */ void actionEnd();
    /* 80BC9E00 */ int Draw();
    /* 80BC9EA4 */ int Delete();

    void setAction(u8 i_action) { mAction = i_action; }
    u8 getSwNo() { return fopAcM_GetParamBit(this, 0, 8); }
    u32 getArg0() { return fopAcM_GetParamBit(this, 8, 4); }

    /* 0x5A0 */ request_of_phase_process_class mPhaseReq;
    /* 0x5A8 */ J3DModel* mpModel;
    /* 0x5AC */ dBgS_ObjAcch mObjAcch;
    /* 0x784 */ dBgS_AcchCir mAcchCir;
    /* 0x7C4 */ dCcD_Stts mStts;
    /* 0x800 */ dCcD_Cyl mCyl[2];
    /* 0xA78 */ cXyz field_0xa78;
    /* 0xA84 */ csXyz field_0xa84;
    /* 0xA8A */ csXyz field_0xa8a;
    /* 0xA90 */ u8 mAction;
    /* 0xA91 */ u8 field_0xa91;
    /* 0xA92 */ u16 field_0xa92;
    /* 0xA94 */ s32 field_0xa94;
    /* 0xA98 */ s16 field_0xa98;
    /* 0xA9A */ s16 field_0xa9a;
    /* 0xA9C */ f32 field_0xa9c;
    /* 0xAA0 */ f32 field_0xaa0;
}; // Size: 0xAA4

//
// Forward References:
//

extern "C" void initBaseMtx__12daObjChest_cFv();
extern "C" void setBaseMtx__12daObjChest_cFv();
extern "C" void Create__12daObjChest_cFv();
extern "C" void CreateHeap__12daObjChest_cFv();
extern "C" void create__12daObjChest_cFv();
extern "C" void __dt__8dCcD_CylFv();
extern "C" void __ct__8dCcD_CylFv();
extern "C" void __dt__8cM3dGCylFv();
extern "C" void __dt__8cM3dGAabFv();
extern "C" void __dt__10dCcD_GSttsFv();
extern "C" void __dt__12dBgS_AcchCirFv();
extern "C" void __dt__12dBgS_ObjAcchFv();
extern "C" void Execute__12daObjChest_cFPPA3_A4_f();
extern "C" void action__12daObjChest_cFv();
extern "C" void actionWait__12daObjChest_cFv();
extern "C" void actionMove__12daObjChest_cFv();
extern "C" void actionEnd__12daObjChest_cFv();
extern "C" void Draw__12daObjChest_cFv();
extern "C" void Delete__12daObjChest_cFv();
extern "C" static void daObjChest_Draw__FP12daObjChest_c();
