//
// Generated By: dol2asm
// Translation Unit: d_a_kytag06
//

#include "rel/d/a/kytag/d_a_kytag06/d_a_kytag06.h"
#include "SSystem/SComponent/c_counter.h"
#include "SSystem/SComponent/c_math.h"
#include "d/com/d_com_inf_game.h"
#include "d/d_path.h"
#include "dol2asm.h"

//
// Types:
//

class kytag06_class : public fopAc_ac_c {
public:
    /* 0x568 */ dPath* mpPath;
    /* 0x56C */ f32 mWindPower;
    /* 0x570 */ f32 field_0x570;
    /* 0x574 */ int field_0x574;
    /* 0x578 */ int field_0x578;
    /* 0x57C */ int field_0x57c;
    /* 0x580 */ u32 field_0x580[4];
    /* 0x590 */ u8 field_0x590;
    /* 0x591 */ u8 field_0x591;
    /* 0x592 */ u8 field_0x592;
    /* 0x593 */ u8 mType;
    /* 0x594 */ u8 mPathNo;
    /* 0x595 */ u8 mSwNo;
    /* 0x596 */ u8 field_0x596;
    /* 0x597 */ u8 field_0x597;
    /* 0x598 */ u8 field_0x598;
};

//
// Forward References:
//

extern "C" static void dice_wether_init__FUcff();
extern "C" static void dice_wether_execute__FUcff();
extern "C" static void dice_rain_minus__Fv();
extern "C" static void dKy_event_proc__Fv();
extern "C" static void daKytag06_type_04_Execute__FP13kytag06_class();
extern "C" static void set_path_info__FP10fopAc_ac_c();
extern "C" static void near_rail_get__FP13kytag06_classP4cXyz();
extern "C" static void daKytag06_Draw__FP13kytag06_class();
extern "C" static void daKytag06_lv7_boss_wether_proc__FP13kytag06_classUc();
extern "C" static void daKytag06_Ganon_wether_proc__FP13kytag06_classUc();
extern "C" static void daKytag06_wether_proc__FP13kytag06_classUc();
extern "C" static void daKytag06_type_07_wether_Execute__FP13kytag06_class();
extern "C" static void daKytag06_type_07_Execute__FP13kytag06_class();
extern "C" void __dt__4cXyzFv();
extern "C" static void daKytag06_type_06_Execute__FP13kytag06_class();
