/**
 * d_bg_s.cpp
 * Background (Map) Collision main handler
 */

#include "d/dolzel.h" // IWYU pragma: keep

#include "d/d_bg_s.h"
#include "d/d_bg_s_sph_chk.h"
#include "d/d_bg_w.h"
#include "d/d_com_inf_game.h"
#include "f_op/f_op_actor_mng.h"

#if DEBUG
#include "d/d_debug_viewer.h"
#include "d/d_bg_s_capt_poly.h"
#endif

#if DEBUG
int g_ground_counter;
int g_line_counter;
int g_acch_wall_counter;
int g_roof_counter;
int g_spl_counter;
int g_shdw_counter;
int g_sph_counter;
int g_capt_poly_counter;
#endif

#if DEBUG
void dBgS_HIO::genMessage(JORMContext* mctx) {
    mctx->genLabel("zelda地形チェック", 0);

    mctx->genLabel("チェック回数 ----------", 0);
    mctx->genCheckBox("チェックカウンター", &m_flags, FLAG_CHECK_COUNTER_e);

    mctx->genLabel("平均処理時間(Mean) -----------", 0);
    mctx->genCheckBox("ラインチェック時間(->terminal)", &m_flags2, FLAG2_LINE_TIMER_e);
    mctx->genCheckBox("アクターチェック時間[壁、床（+天井、水面）](->terminal)", &m_flags, 1);
    mctx->genCheckBox("アクターチェック 壁チェック時間(->terminal)", &m_flags, FLAG_ACCH_WALL_TIMER_e);
    mctx->genCheckBox("天井チェック時間(->terminal)", &m_flags, FLAG_ROOF_TIMER_e);
    mctx->genCheckBox("Splチェック(水、溶岩、毒水面)時間(->terminal)", &m_flags2, FLAG2_SPL_TIMER_e);
    mctx->genCheckBox("床チェック時間(->terminal)", &m_flags2, FLAG2_GROUND_CHECK_TIMER_e);
    mctx->genCheckBox("リアル影描画時間(->terminal)", &m_flags2, FLAG2_SHDW_DRAW_TIMER_e);
    mctx->genCheckBox("球チェック時間[コールバック処理含む](->terminal)", &m_flags2, FLAG2_SPH_CHK_TIMER_e);

            OS_REPORT_ERROR("[ERROR] cBgS::Release() %dに登録されている作業領域のポインターと、Release()に引数で渡されているポインターが異なる。(%x,%x) [解放実行]", id, m_chk_element[id].m_bgw_base_ptr, pbgw);
            JUT_WARN(431, "%s", "cBgS::Release() data error.");
        }
        #endif

        m_chk_element[id].Release();
        pbgw->Release();
    } else {
        #if DEBUG
        if (id == 0x100) {
            // "cBgS::Release() attempting to release unregistered terrain. operation won't be processed."
            OS_WARNING("cBgS::Release() 登録していない地形をReleaseしようとしています。処理しません。\n");
        } else {
            // "[Error] cBgS::Release() Error[Check id=%d won't be released.](dBgW_Base=%x)"
            OS_REPORT_ERROR("[Error] cBgS::Release() Error[id=%d番のチェックはリリースしません。](dBgW_Base=%x)\n", id, pbgw);

            if (!pbgw->ChkUsed()) {
                // "Data [%d] is not being used."
                OS_REPORT_ERROR("データ[%d]は使っていません。\n", id);
            }

            if (!m_chk_element[id].ChkUsed()) {
                // "Table [%d] is not being used."
                OS_REPORT_ERROR("テーブル[%d]は使っていません。\n", id);
            }
        }
        #endif

        return 1;
    }

    return 0;
}

#if DEBUG
u8 lbl_8074C7F0;  // belongs in d_bg_w?
static u8 lbl_8074C7F8;
#endif

void cBgS::Ct() {
    l_SetCounter = 0;
    for (int i = 0; i < 0x100; i++) {
        m_chk_element[i].Init();
    }

    #if DEBUG
    lbl_8074C7F8 = 0;
    lbl_8074C7F0 = 0;
    #endif
}

void cBgS::Dt() {
    for (int i = 0; i < 0x100; i++) {
        if (m_chk_element[i].ChkUsed()) {
            JUT_WARN(499, "%s", "cBgS::Dt() release error.");
            OS_REPORT_ERROR("[ERROR] ========== cBgS::Dt() 消し残し地形チェックがあります。id=%d ==========\n", i);
            OS_REPORT_ERROR("!!!!!!!!! 勝手に消しときます !!!!!!!!\n");
            m_chk_element[i].Release();
        }
    }

    for (int i = 0; i < 0x100; i++) {
        m_chk_element[i].Init();
    }
}

bool cBgS::LineCross(cBgS_LinChk* plinchk) {
    plinchk->ClearPi();
    plinchk->ClrHit();
    plinchk->PreCalc();

    cBgS_ChkElm* elm = m_chk_element;
    for (int i = 0; i < 0x100; i++) {
        if (elm->ChkUsed() && !elm->m_bgw_base_ptr->ChkNotReady() &&
            !plinchk->ChkSameActorPid(elm->m_actor_id) && elm->m_bgw_base_ptr->LineCheck(plinchk))
        {
            plinchk->SetActorInfo(i, elm->m_bgw_base_ptr, elm->m_actor_id);
            plinchk->SetHit();
        }
        elm++;
    }

    return plinchk->ChkHit();
}

f32 cBgS::GroundCross(cBgS_GndChk* pgndchk) {
    pgndchk->SetNowY(-G_CM3D_F_INF);
    pgndchk->ClearPi();
    pgndchk->PreCheck();

    cBgS_ChkElm* elm = m_chk_element;
    for (int i = 0; i < 0x100; i++) {
        if (elm->ChkUsed() && !elm->m_bgw_base_ptr->ChkNotReady() &&
            !pgndchk->ChkSameActorPid(elm->m_actor_id) && elm->m_bgw_base_ptr->GroundCross(pgndchk))
        {
            pgndchk->SetActorInfo(i, elm->m_bgw_base_ptr, elm->m_actor_id);
        }
        elm++;
    }

    return pgndchk->GetNowY();
}

// this is identical to cBgD_t except using u32's for the table offsets.
// u32 is needed to match in ConvDzb ?
struct cBgD_t_ {
    // Vertex Info
    /* 0x00 */ int m_v_num;
    /* 0x04 */ u32 m_v_tbl;

    // Triangle Info
    /* 0x08 */ int m_t_num;
    /* 0x0C */ u32 m_t_tbl;

    // Spatial List Info
    /* 0x10 */ int m_b_num;
    /* 0x14 */ u32 m_b_tbl;

    // Face Group Data Info
    /* 0x18 */ int m_tree_num;
    /* 0x1C */ u32 m_tree_tbl;

    // String Group Info
    /* 0x20 */ int m_g_num;
    /* 0x24 */ u32 m_g_tbl;

    // Surface Property Info
    /* 0x28 */ int m_ti_num;
    /* 0x2C */ u32 m_ti_tbl;

    /* 0x30 */ u32 m_flags;
};  // Size: 0x34

struct cBgD_Grp_t_ {
    u32 strOffset;
    u8 data[0x30];
};

void* cBgS::ConvDzb(void* pdzb) {
    cBgD_t_* pbgd = (cBgD_t_*)pdzb;

    if (((pbgd->m_flags & 0x80000000) == 0)) {
        pbgd->m_flags |= 0x80000000;
    } else {
        return pdzb;
    }

    JUT_ASSERT(596, ((int)pbgd->m_v_tbl % 4) == 0);
    JUT_ASSERT(597, ((int)pbgd->m_t_tbl % 2) == 0);
    JUT_ASSERT(598, ((int)pbgd->m_b_tbl % 2) == 0);
    JUT_ASSERT(599, ((int)pbgd->m_tree_tbl % 2) == 0);
    JUT_ASSERT(600, ((int)pbgd->m_g_tbl % 4) == 0);
    JUT_ASSERT(601, ((int)pbgd->m_ti_tbl % 4) == 0);

    if (pbgd->m_v_tbl != 0) {
        pbgd->m_v_tbl += (uintptr_t)pdzb;
    }

    pbgd->m_t_tbl += (uintptr_t)pdzb;
    pbgd->m_b_tbl += (uintptr_t)pdzb;
    pbgd->m_tree_tbl += (uintptr_t)pdzb;
    pbgd->m_g_tbl += (uintptr_t)pdzb;
    pbgd->m_ti_tbl += (uintptr_t)pdzb;

    for (int i = 0; i < pbgd->m_g_num; i++) {
