/**
 * d_com_inf_game.cpp
 * Game Information
 */

#include "d/dolzel.h" // IWYU pragma: keep

#include "JSystem/JKernel/JKRAramArchive.h"
#include "JSystem/JKernel/JKRExpHeap.h"
#include "d/actor/d_a_alink.h"
#include "d/d_com_inf_game.h"
#include "d/d_item.h"
#include "d/d_map_path_dmap.h"
#include "d/d_menu_fmap.h"
#include "d/d_menu_window_HIO.h"
#include "d/d_meter2_info.h"
#include "d/d_meter_HIO.h"
#include "d/d_simple_model.h"
#include "d/d_timer.h"
#include "f_op/f_op_msg_mng.h"
#include "f_op/f_op_scene_mng.h"
#include "m_Do/m_Do_Reset.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_graphic.h"
#include <cstdio>

void dComIfG_play_c::ct() {
    mWindowNum = 0;
    mParticle = NULL;
    mLayerOld = 0;

    memset(mLastPlayStageName, 0, 8);
    init();
}

static __d_timer_info_c dComIfG_mTimerInfo;

void dComIfG_play_c::init() {
    for (int i = 0; i < ARRAY_SIZE(mPlayerInfo); i++) {
        mPlayerInfo[i].mpPlayer = NULL;
        mPlayerInfo[i].mCameraID = -1;
    }
    for (int i = 0; i < ARRAY_SIZE(mCameraInfo); i++) {
        mCameraInfo[i].mCamera = NULL;
    }

    for (int i = 0; i < ARRAY_SIZE(mPlayerPtr); i++) {
        mPlayerPtr[i] = NULL;
    }

    if (mItemInfo.mGameoverStatus == 2) {
        dComIfGp_roomControl_initZone();
    }
    mItemInfo.mGameoverStatus = 0;
}

BOOL dComIfGp_checkItemGet(u8 i_itemNo, int param_1) {
    return checkItemGet(i_itemNo, param_1);
}

void dComIfG_play_c::itemInit() {
    dMeter2Info_Initialize();


    dComIfGs_offItemFirstBit(fpcNm_ITEM_LIGHT_SWORD);
    dComIfGs_offItemFirstBit(fpcNm_ITEM_SHIELD);
    dComIfGs_offItemFirstBit(fpcNm_ITEM_ZORAS_JEWEL);

    for (int i = 0; i < 19; i++) {
        dComIfGs_offItemFirstBit(i);
    }

    dComIfGs_setCollectSmell(fpcNm_ITEM_SMELL_PUMPKIN);

    if (!mDoCPd_c::isConnect(PAD_3)) {
        dComIfGs_offItemFirstBit(fpcNm_ITEM_SMELL_POH);
    }

    dComIfGs_setArrowNum(30);
    dComIfGs_setArrowMax(30);
    dComIfGs_setPachinkoNum(dComIfGs_getPachinkoMax());
    dComIfGs_setBombNum(0, 30);
    dComIfGs_setBombNum(1, 15);
    dComIfGs_setBombNum(2, 10);

    for (int i = 0; i < 4; i++) {
        dComIfGs_setBottleNum(i, dComIfGs_getBottleMax());
    }

    dComIfGs_setSaveTotalTime(dComIfGs_getTotalTime());
    dComIfGs_setSaveStartTime(OSGetTime());

    dComIfGs_setBombNum(8, 30);
    dComIfGs_setBombMax(fpcNm_ITEM_NORMAL_BOMB, 30);
    dComIfGs_setBombMax(fpcNm_ITEM_WATER_BOMB, 15);
    dComIfGs_setBombMax(fpcNm_ITEM_POKE_BOMB, 10);

    dMeter2Info_setCloth(fpcNm_ITEM_WEAR_KOKIRI, false);
    dMeter2Info_setSword(fpcNm_ITEM_SWORD, false);
    dMeter2Info_setShield(fpcNm_ITEM_HYLIA_SHIELD, false);
    dComIfGs_onGetMagicUseFlag();

    dComIfGs_onEventBit(0x540);
    dComIfGs_onEventBit(0xc10);
    dComIfGs_onEventBit(0x510);
    dMeter2Info_offTempBit(0);
    dComIfGs_onEventBit(0x5c01);
    dComIfGs_onEventBit(0x5d80);

    if (!mDoCPd_c::isConnect(PAD_3)) {
        g_fmapHIO.mAllRegionsUnlocked = 0;
    } else {
        g_fmapHIO.mAllRegionsUnlocked = 1;
    }

    g_fmapHIO.mPortalWarpON = 1;
    g_fmapHIO.update();

    g_mwHIO.setArrowFlag(1);
    g_mwHIO.setPachinkoFlag(1);
    g_mwHIO.setBombFlag(1);
    g_mwHIO.update();
    g_mwHIO.setBombFlag(1);
}

void dComIfG_playerStatusD_pre_clear() {
    dComIfGs_setDataNum(0);
    dComIfGs_setMaxLife(15);
    dComIfGs_setLife(12);
    dComIfGs_setRupee(0);
    dComIfGs_setMaxMagic(0);
    dComIfGs_setMagic(0);
    dComIfGs_setWalletSize(0);
    dComIfGs_setMaxOil(21600);
    dComIfGs_setOil(21600);
    dComIfGp_setMaxOxygen(600);
    dComIfGp_setOxygen(600);

    for (int i = 0; i < 4; i++) {
        dComIfGs_setMixItemIndex(i, 0xFF);
        dComIfGs_setSelectItemIndex(i, 0xFF);
    }

    dComIfGs_setSelectEquipClothes(fpcNm_ITEM_WEAR_CASUAL);
    dComIfGp_setSelectEquipClothes(fpcNm_ITEM_WEAR_CASUAL);
    dComIfGs_setSelectEquipSword(fpcNm_ITEM_NONE);
    dComIfGp_setSelectEquipSword(fpcNm_ITEM_NONE);
    dComIfGs_setSelectEquipShield(fpcNm_ITEM_NONE);
    dComIfGp_setSelectEquipShield(fpcNm_ITEM_NONE);

    for (int i = 0; i < 24; i++) {
        dComIfGs_setItem(i, fpcNm_ITEM_NONE);
    }

    for (int i = 0; i < 0x100; i++) {
        dComIfGs_offItemFirstBit(i);
    }

    dComIfGs_setArrowNum(0);
    dComIfGs_setBombNum(0);
    dComIfGs_setArrowMax(0);
    dComIfGs_setBombMax(0);
    dComIfGs_setSelectEquipShield(fpcNm_ITEM_SHIELD);
    dComIfGp_setSelectEquipShield(fpcNm_ITEM_SHIELD);
}
#endif

u32 dComIfG_getTrigA(u32 i_padNo) {
    return mDoCPd_c::getTrigA(i_padNo);
}

struct field_data_header {
    /* 0x00 */ u32 field_0x0;
    /* 0x04 */ u32 field_0x4;
    /* 0x08 */ u32 field_0x8;
    /* 0x0C */ u32 field_0xc;
    /* 0x10 */ u32 field_0x10;
    /* 0x14 */ u32 field_0x14;
};

struct field_data {
    /* 0x00 */ char stage_name[8];
    /* 0x08 */ u8 room_no;
    /* 0x09 */ u8 region_no;
    /* 0x0A */ u8 field_0xa[0x14 - 0xA];
};

void dComIfGp_calcNowRegion() {
    u8 buffer[0x800] ATTRIBUTE_ALIGN(32);

    dComIfGp_getFieldMapArchive2()->readResource(buffer, 0x800, "dat/field.dat");
    u8* entry_num_p = &buffer[((field_data_header*)buffer)->field_0x4];
    u8* entries_p = entry_num_p + 4;

    for (int i = 0; i < 64; i++) {
        dStage_roomControl_c::setRegionNo(i, 0xFF);
    }

    dComIfGs_offPlayerFieldLastStayFieldDataExistFlag();

    if (!dComIfGs_isTmpBit(dSv_event_tmp_flag_c::NO_TELOP)) {
        if (strcmp(dComIfGp_getStartStageName(), "F_SP104") != 0 ||
            dComIfG_play_c::getLayerNo(0) != 12)
        {
            if (strcmp(dComIfGp_getStartStageName(), "F_SP115") == 0 &&
                dComIfGp_getStartStageRoomNo() == 1)
            {
                cXyz pos(dComIfGs_getPlayerFieldLastStayPos());
                pos.x = -90300.0f;
                pos.z = 51800.0f;

