//
// Generated By: dol2asm
// Translation Unit: d/d_drawlist
//

#include "d/dolzel.h"

#include "JSystem/J2DGraph/J2DAnimation.h"
#include "JSystem/J2DGraph/J2DGrafContext.h"
#include "JSystem/J2DGraph/J2DScreen.h"
#include "JSystem/J3DGraphBase/J3DDrawBuffer.h"
#include "SSystem/SComponent/c_bg_s_shdw_draw.h"
#include "SSystem/SComponent/c_math.h"
#include "d/d_com_inf_game.h"
#include "d/d_drawlist.h"
#include "d/d_s_play.h"
#include "dol2asm.h"
#include "m_Do/m_Do_graphic.h"
#include "m_Do/m_Do_lib.h"
#include "m_Do/m_Do_mtx.h"

class dDlst_blo_c : public dDlst_base_c {
public:
    /* 80053B64 */ virtual void draw();
    bool create(JKRArchive* param_1, char* param_2) {
        return mScreen.setPriority(param_2,0x20000,param_1) != 0;
    }

    J2DPane* getPane(u64 i_tag) {
        return mScreen.search(i_tag);
    }

    J2DPicture* getPicture(u64 i_tag) {
        J2DPane* pane = getPane(i_tag);
        JUT_ASSERT(1553, pane != 0);
        if (pane->getTypeID() != 0x12) {
            return NULL;
        }
        return (J2DPicture*)pane;
    }

    /* 0x004 */ int field_0x4;
    /* 0x008 */ J2DScreen mScreen;
    /* 0x120 */ f32 field_0x120;
    /* 0x124 */ f32 field_0x124;
};

class dDlst_2Dm_c {
public:
    /* 8005312C */ virtual void draw();

    /* 0x04 */ s16 field_0x4;
    /* 0x06 */ s16 field_0x6;
    /* 0x08 */ s16 field_0x8;
    /* 0x0A */ s16 field_0xa;
    /* 0x0C */ f32 field_0xc;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ GXColor field_0x14;
    /* 0x18 */ GXColor field_0x18;
    /* 0x1C */ GXTexObj field_0x1c;
    /* 0x3C */ GXTlutObj field_0x3c;
    /* 0x48 */ s16 field_0x48;
    /* 0x4A */ s16 field_0x4a;
    /* 0x4C */ u8 field_0x4c;
    /* 0x50 */ GXTexObj field_0x50;
    /* 0x70 */ GXTlutObj field_0x70;
    /* 0x7C */ s16 field_0x7c;
    /* 0x7E */ s16 field_0x7e;
    /* 0x80 */ u8 field_0x80;
};

class dDlst_2DTri_c {
public:
    /* 80051AF0 */ virtual void draw();

    /* 0x04 */ s16 field_0x4;
    /* 0x06 */ s16 field_0x6;
    /* 0x08 */ GXColor field_0x8;
    /* 0x0C */ s16 field_0xc;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ f32 field_0x14;
};

class dDlst_2DT_c : public dDlst_base_c {
public:
    dDlst_2DT_c() {}
    /* 80051F98 */ virtual void draw();

    /* 0x04 */ u8* field_0x4;
    /* 0x08 */ u32 field_0x8;
    /* 0x0C */ u8 field_0xc;
    /* 0x0D */ u8 field_0xd;
    /* 0x0E */ u16 field_0xe;
    /* 0x10 */ u16 field_0x10;
    /* 0x12 */ s16 field_0x12;
    /* 0x14 */ s16 field_0x14;
    /* 0x16 */ s16 field_0x16;
    /* 0x18 */ s16 field_0x18;
    /* 0x1C */ f32 field_0x1c;
    /* 0x20 */ f32 field_0x20;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ f32 field_0x28;
};

class dDlst_2DPoint_c {
public:
    /* 80051E5C */ virtual void draw();

    /* 0x04 */ s16 field_0x4;
    /* 0x06 */ s16 field_0x6;
    /* 0x08 */ GXColor field_0x8;
    /* 0x0C */ u8 field_0xc;
};

class dDlst_2DMt_tex_c {
public:
    u8 check() { return field_0x0; }
    int getCI() { return mCI; }
    GXTexObj* getTexObj() { return &mTexObj; }
    GXTlutObj* getTlutObj() { return &mTlutObj; }
    GXColor* getColor() { return &mColor; }
    f32 getS() { return mS; }
    f32 getT() { return mT; }
    f32 getSw() { return mSw; }
    f32 getTw() { return mTw; }

    /* 0x00 */ u8 field_0x0;
    /* 0x01 */ u8 mCI;
    /* 0x04 */ GXTexObj mTexObj;
    /* 0x24 */ GXTlutObj mTlutObj;
    /* 0x30 */ GXColor mColor;
    /* 0x34 */ f32 mS;
    /* 0x38 */ f32 mT;
    /* 0x3C */ f32 mSw;
    /* 0x40 */ f32 mTw;
};

class dDlst_2DMt_c {
public:
    /* 8005364C */ virtual void draw();

    /* 0x04 */ u8 field_0x4;
    /* 0x08 */ dDlst_2DMt_tex_c* field_0x8;
    /* 0x0C */ s16 field_0xc;
    /* 0x0E */ s16 field_0xe;
    /* 0x10 */ s16 field_0x10;
    /* 0x12 */ s16 field_0x12;
};

class dDlst_2DM_c {
public:
    /* 80052C58 */ virtual void draw();

    /* 0x04 */ s16 field_0x4;
    /* 0x06 */ s16 field_0x6;
    /* 0x08 */ s16 field_0x8;
    /* 0x0A */ s16 field_0xa;
    /* 0x0C */ u8 field_0xc;
    /* 0x0D */ GXColor field_0xd;
    /* 0x11 */ GXColor field_0x11;
    /* 0x18 */ void* field_0x18;
    /* 0x1C */ u8 field_0x1c;
    /* 0x1E */ u16 field_0x1e;
    /* 0x20 */ u16 field_0x20;
    /* 0x22 */ s16 field_0x22;
    /* 0x24 */ s16 field_0x24;
    /* 0x28 */ void* field_0x28;
    /* 0x2C */ u8 field_0x2c;
    /* 0x2E */ u16 field_0x2e;
    /* 0x30 */ u16 field_0x30;
    /* 0x32 */ s16 field_0x32;
    /* 0x34 */ s16 field_0x34;
};

class ShdwDrawPoly_c : public cBgS_ShdwDraw {
public:
    /* 80054A6C */ virtual ~ShdwDrawPoly_c() {}

    void setCenter(cXyz* center) { mCenter = center; }
    cXyz* getCenter() { return mCenter; }
    void setLightVec(cXyz* lightVec) { mLightVec = lightVec; }
    cXyz* getLightVec() { return mLightVec; }
    void setPoly(dDlst_shadowPoly_c* poly) { mPoly = poly; }
    dDlst_shadowPoly_c* getPoly() { return mPoly; }

    /* 0x34 */ cXyz* mCenter;
    /* 0x38 */ cXyz* mLightVec;
    /* 0x3c */ dDlst_shadowPoly_c* mPoly;
};

/* 80051AC0-80051ADC 04C400 001C+00 0/0 3/3 0/0 .text setViewPort__14dDlst_window_cFffffff */
void dDlst_window_c::setViewPort(f32 xOrig, f32 yOrig, f32 width, f32 height, f32 nearZ, f32 farZ) {
    mViewport.x_orig = xOrig;
    mViewport.y_orig = yOrig;
    mViewport.width = width;
    mViewport.height = height;
    mViewport.near_z = nearZ;
    mViewport.far_z = farZ;
}

/* 80051ADC-80051AF0 04C41C 0014+00 0/0 4/4 0/0 .text            setScissor__14dDlst_window_cFffff
 */
void dDlst_window_c::setScissor(f32 xOrig, f32 yOrig, f32 width, f32 height) {
    mViewport.scissor.x_orig = xOrig;
    mViewport.scissor.y_orig = yOrig;
    mViewport.scissor.width = width;
    mViewport.scissor.height = height;
}

/* 80051AF0-80051CF0 04C430 0200+00 1/0 0/0 0/0 .text            draw__13dDlst_2DTri_cFv */
void dDlst_2DTri_c::draw() {
    f32 f4;
    f32 f5;
    f32 f2 = cM_scos(field_0xc);
    f32 f3 = cM_ssin(field_0xc);
    s16 x[3];
    s16 y[3];
