//
// Generated By: dol2asm
// Translation Unit: d/com/d_com_inf_game
//

#include "d/com/d_com_inf_game.h"
#include "JSystem/JKernel/JKRAramArchive.h"
#include "JSystem/JKernel/JKRExpHeap.h"
#include "d/a/d_a_alink.h"
#include "d/d_item.h"
#include "d/d_procname.h"
#include "d/d_simple_model.h"
#include "d/d_timer.h"
#include "d/map/d_map_path_dmap.h"
#include "d/menu/d_menu_fmap.h"
#include "dol2asm.h"
#include "dolphin/os.h"
#include "f_op/f_op_scene_mng.h"
#include "m_Do/m_Do_Reset.h"
#include "m_Do/m_Do_audio.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_graphic.h"
#include "stdio.h"

//
// Forward References:
//

extern "C" void ct__14dComIfG_play_cFv();
extern "C" void init__14dComIfG_play_cFv();
extern "C" void dComIfGp_checkItemGet__FUci();
extern "C" void itemInit__14dComIfG_play_cFv();
extern "C" void setItemBombNumCount__14dComIfG_play_cFUcs();
extern "C" void getItemBombNumCount__14dComIfG_play_cFUc();
extern "C" void clearItemBombNumCount__14dComIfG_play_cFUc();
extern "C" void setNowVibration__14dComIfG_play_cFUc();
extern "C" void getNowVibration__14dComIfG_play_cFv();
extern "C" void setStartStage__14dComIfG_play_cFP19dStage_startStage_c();
extern "C" void dComIfG_get_timelayer__FPi();
extern "C" void getLayerNo_common_common__14dComIfG_play_cFPCcii();
extern "C" void getLayerNo_common__14dComIfG_play_cFPCcii();
extern "C" void getLayerNo__14dComIfG_play_cFi();
extern "C" void createParticle__14dComIfG_play_cFv();

        itemNum = dComIfGs_getBottleMax();
    }

    return itemNum;
}

/* 8002E714-8002E83C 029054 0128+00 0/0 2/2 0/0 .text            dComIfGp_setSelectItemNum__Fis */
void dComIfGp_setSelectItemNum(int i_selItemIdx, s16 i_num) {
    u8 selectItem = dComIfGp_getSelectItem(i_selItemIdx);

    if (selectItem == NORMAL_BOMB || selectItem == WATER_BOMB || selectItem == POKE_BOMB ||
        selectItem == BOMB_ARROW)
    {
        u8 mix_slotNo = dComIfGs_getSelectMixItemNoArrowIndex(i_selItemIdx) - SLOT_15;

        if (i_num > dComIfGs_getBombMax(selectItem)) {
            i_num = dComIfGs_getBombMax(selectItem);
        }
        dComIfGs_setBombNum(mix_slotNo, i_num);
    } else if (selectItem == PACHINKO) {
        dComIfGs_setPachinkoNum(i_num);
    } else if (selectItem == BEE_CHILD) {
        u8 bottle_slot_no = dComIfGs_getSelectItemIndex(i_selItemIdx) - SLOT_11;

        if (i_num > dComIfGs_getBottleMax()) {
            i_num = dComIfGs_getBottleMax();
        }
        dComIfGs_setBottleNum(bottle_slot_no, i_num);
    }
}

/* 8002E83C-8002E910 02917C 00D4+00 0/0 5/5 0/0 .text            dComIfGp_addSelectItemNum__Fis */
void dComIfGp_addSelectItemNum(int i_selItemIdx, s16 i_num) {
    u8 selectItem = dComIfGp_getSelectItem(i_selItemIdx);

    if (selectItem == NORMAL_BOMB || selectItem == WATER_BOMB || selectItem == POKE_BOMB ||
        selectItem == BOMB_ARROW)
    {
        u8 slot_no = dComIfGs_getSelectMixItemNoArrowIndex(i_selItemIdx) - SLOT_15;
        dComIfGp_setItemBombNumCount(slot_no, i_num);
    } else if (selectItem == PACHINKO) {
        dComIfGp_setItemPachinkoNumCount(i_num);
    } else if (selectItem == BEE_CHILD) {
        dComIfGs_addBottleNum(dComIfGs_getSelectItemIndex(i_selItemIdx) - SLOT_11, i_num);
    }
}

/* 8002E910-8002E974 029250 0064+00 0/0 5/5 137/137 .text
 * dComIfGd_setShadow__FUlScP8J3DModelP4cXyzffffR13cBgS_PolyInfoP12dKy_tevstr_csfP9_GXTexObj */
int dComIfGd_setShadow(u32 param_0, s8 param_1, J3DModel* param_2, cXyz* param_3, f32 param_4,
                       f32 param_5, f32 param_6, f32 param_7, cBgS_PolyInfo& param_8,
                       dKy_tevstr_c* param_9, s16 param_10, f32 param_11, _GXTexObj* param_12) {
    if (param_7 <= -1000000000.0f) {
        return 0;
    } else {
        return dComIfGd_setRealShadow(param_0, param_1, param_2, param_3, param_4,
                                      param_6 - param_7, param_9);
    }
}

/* 8002E974-8002E9D4 0292B4 0060+00 0/0 1/1 0/0 .text            dComIfGs_gameStart__Fv */
void dComIfGs_gameStart() {
    dComIfGp_offEnableNextStage();

    s8 roomNo = g_dComIfG_gameInfo.info.getPlayer().getPlayerReturnPlace().getRoomNo();
    s16 point = g_dComIfG_gameInfo.info.getPlayer().getPlayerReturnPlace().getPlayerStatus();
    char* name = g_dComIfG_gameInfo.info.getPlayer().getPlayerReturnPlace().getName();
    dComIfGp_setNextStage(name, point, roomNo, -1, 0.0f, 0, 1, 0, 0, 0, 0);
}

u32 dComIfG_getTrigA(u32 i_padNo) {
    return mDoCPd_c::getTrigA(i_padNo);
}

struct field_data_header {
    /* 0x00 */ u32 field_0x0;
    /* 0x04 */ u32 field_0x4;
    /* 0x08 */ u32 field_0x8;
    /* 0x0C */ u32 field_0xc;
    /* 0x10 */ u32 field_0x10;
    /* 0x14 */ u32 field_0x14;
};

struct field_data {
    /* 0x00 */ char stage_name[8];
    /* 0x08 */ u8 room_no;
    /* 0x09 */ u8 region_no;
    /* 0x0A */ u8 field_0xa[0x14 - 0xA];
};

/* 8002E9F0-8002EC54 029330 0264+00 0/0 1/1 0/0 .text            dComIfGp_calcNowRegion__Fv */
void dComIfGp_calcNowRegion() {
    u8 buffer[0x800] ALIGN_DECL(32);

    dComIfGp_getFieldMapArchive2()->readResource(buffer, 0x800, "dat/field.dat");
    u8* entry_num_p = &buffer[((field_data_header*)buffer)->field_0x4];
    u8* entries_p = entry_num_p + 4;

    for (int i = 0; i < 64; i++) {
        dStage_roomControl_c::setRegionNo(i, 0xFF);
    }

    dComIfGs_offPlayerFieldLastStayFieldDataExistFlag();

    if (!dComIfGs_isTmpBit(dSv_event_tmp_flag_c::NO_TELOP)) {
        if (strcmp(dComIfGp_getStartStageName(), "F_SP104") != 0 ||
            dComIfG_play_c::getLayerNo(0) != 12)
        {
            if (strcmp(dComIfGp_getStartStageName(), "F_SP115") == 0 &&
                dComIfGp_getStartStageRoomNo() == 1)
            {
                cXyz pos(dComIfGs_getPlayerFieldLastStayPos());
                pos.x = -90300.0f;
