/**
 * @file d_a_e_sh.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_sh.h"
#include "d/d_cc_d.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"

class daE_SH_HIO_c : public JORReflexible {
public:
    daE_SH_HIO_c();
    virtual ~daE_SH_HIO_c() {}
#if DEBUG
    void genMessage(JORMContext*);
#endif

    /* 0x04 */ s8 mChild;
    /* 0x08 */ f32 mBaseSize;
    /* 0x0C */ f32 mWalkSpeed;
    /* 0x10 */ f32 mRunSpeed;
    /* 0x14 */ f32 mCheck1;
    /* 0x18 */ f32 mCheck2;
    /* 0x1C */ f32 mCheck3;
    /* 0x20 */ f32 mCheck4;
    /* 0x24 */ f32 mCheck5;
    /* 0x28 */ u8 mIgnoreTime;
};

daE_SH_HIO_c::daE_SH_HIO_c() {
    mChild = -1;
    mBaseSize = 1.15f;
    mWalkSpeed = 5.0f;
    mRunSpeed = 20.0f;
    mCheck1 = 600.0f;
    mCheck2 = 700.0f;
    mCheck3 = 800.0f;
    mCheck4 = 900.0f;
    mCheck5 = 500.0f;
    mIgnoreTime = 0;
}

#if DEBUG
void daE_SH_HIO_c::genMessage(JORMContext* ctx) {
    // "Stalhound"
    ctx->genLabel("  スタルハウンド", 0x80000001, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    ctx->genSlider("基本サイズ", &mBaseSize, 0.0f, 3.0f, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    ctx->genSlider("歩き速度", &mWalkSpeed, 0.0f, 60.0f, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    ctx->genSlider("走り速度", &mRunSpeed, 0.0f, 60.0f, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    ctx->genSlider("チェック１", &mCheck1, 0.0f, 2000.0f, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    ctx->genSlider("チェック２", &mCheck2, 0.0f, 2000.0f, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    ctx->genSlider("チェック３", &mCheck3, 0.0f, 2000.0f, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
