/**
 * @file d_a_e_mm.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_mm.h"
#include "d/d_s_play.h"

#include "f_op/f_op_actor_enemy.h"

enum daE_MM_ACTION {
    ACTION_NORMAL,
    ACTION_DASH,
    ACTION_DEFENCE,
    ACTION_MAGNE_WAIT,
    ACTION_TURN,

    ACTION_DAMAGE = 10,
};

class daE_MM_HIO_c : public JORReflexible {
public:
    daE_MM_HIO_c();
    virtual ~daE_MM_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 id;
    /* 0x08 */ f32 base_size;
    /* 0x0C */ f32 move_speed;
    /* 0x10 */ f32 charge_speed;
    /* 0x14 */ f32 pl_search_range;
    /* 0x18 */ s16 reflect_chance_time;
    /* 0x1C */ f32 donketsu_base_size;
    /* 0x20 */ f32 donketsu_move_speed;
    /* 0x24 */ f32 donketsu_charge_speed;
    /* 0x28 */ f32 donketsu_pl_search_range;
    /* 0x2C */ f32 donketsu_reflect_speed;
    /* 0x30 */ s16 donketsu_reflect_chance_time;
    /* 0x32 */ s16 donketsu_angle;
};

daE_MM_HIO_c::daE_MM_HIO_c() {
    id = -1;
    base_size = 1.4f;
    move_speed = 2.0f;
    charge_speed = 15.0f;
    pl_search_range = 1000.0f;
    reflect_chance_time = 50;
    donketsu_base_size = 2.5f;
    donketsu_move_speed = 2.0f;
    donketsu_charge_speed = 8.0f;
    donketsu_pl_search_range = 1000.0f;
    donketsu_reflect_speed = 10.0f;
    donketsu_reflect_chance_time = 75;
    donketsu_angle = 300;
}

static void anm_init(e_mm_class* i_this, int i_anm, f32 i_morf, u8 i_mode, f32 i_speed) {
    i_this->modelMorf->setAnm((J3DAnmTransform*)dComIfG_getObjectRes("E_MM", i_anm), i_mode, i_morf, i_speed, 0.0f, -1.0f);
    i_this->anm = i_anm;
}

static int daE_MM_Draw(e_mm_class* i_this) {
    fopAc_ac_c* actor = &i_this->enemy;
    J3DModel* model = i_this->modelMorf->getModel();

    g_env_light.settingTevStruct(0, &actor->current.pos, &actor->tevStr);
    g_env_light.setLightTevColorType_MAJI(model, &actor->tevStr);
