/**
 * @file d_a_e_pm.cpp
 * Enemy - Skull Kid
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_pm.h"
#include "JSystem/J3DGraphBase/J3DMaterial.h"
#include "SSystem/SComponent/c_math.h"
#include "Z2AudioLib/Z2Instances.h"
#include "c/c_damagereaction.h"
#include "d/d_camera.h"
#include "d/d_com_inf_game.h"
#include "d/d_path.h"
#include "d/actor/d_a_alink.h"
#include "d/actor/d_a_e_fs.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_obj_smw_stone.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"

class daE_PM_HIO_c {
public:
    daE_PM_HIO_c();
    virtual ~daE_PM_HIO_c() {}

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 mLampParticleScale;
    /* 0x0C */ f32 mGlowEffectScale;
    /* 0x10 */ f32 mEscapeRange;
    /* 0x14 */ s16 mGlowColor1R;
    /* 0x16 */ s16 mGlowColor1G;
    /* 0x18 */ s16 mGlowColor1B;
    /* 0x1A */ s16 mGlowColor2R;
    /* 0x1C */ s16 mGlowColor2G;
    /* 0x1E */ s16 mGlowColor2B;
    /* 0x20 */ s16 mGlowColor1A;
    /* 0x22 */ s16 mBossEscapeTimer;
    /* 0x24 */ s16 field_0x24;
    /* 0x26 */ s16 mAdditionalPuppetNum;
    /* 0x28 */ f32 mCreateTimer;
    /* 0x2C */ f32 field_0x2c;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ f32 field_0x34;
    /* 0x38 */ f32 mBossLightR;
    /* 0x3C */ f32 mBossLightG;
    /* 0x40 */ f32 mBossLightB;
    /* 0x44 */ f32 field_0x44;
    /* 0x48 */ f32 field_0x48;
};

STATIC_ASSERT(sizeof(daE_PM_HIO_c) == 0x4C);

enum Action {
    /* 0x0 */ ACT_START,
    /* 0x1 */ ACT_WAIT,
    /* 0x2 */ ACT_ESCAPE,
    /* 0x3 */ ACT_CREATE,
    /* 0x4 */ ACT_DAMAGE,
    /* 0x5 */ ACT_DEATH,
    /* 0x6 */ ACT_DEMO,
};

enum Animation {
    /* 0x06 */ ANM_APPEAR01 = 6,
    /* 0x07 */ ANM_APPEAR02,
    /* 0x08 */ ANM_DAMAGE,
    /* 0x09 */ ANM_DIEA,
    /* 0x0A */ ANM_DIEB,
    /* 0x0B */ ANM_END,
    /* 0x0C */ ANM_FOGBLOW,
    /* 0x0D */ ANM_FOGBLOW_EN,
    /* 0x0E */ ANM_FOGBLOW_LP,
    /* 0x0F */ ANM_FOGBLOW_ST,
    /* 0x10 */ ANM_GLAD,
    /* 0x11 */ ANM_HIDE,
    /* 0x12 */ ANM_KYORO2,
    /* 0x13 */ ANM_MOVE,
    /* 0x14 */ ANM_OP,
    /* 0x15 */ ANM_RUN,
    /* 0x16 */ ANM_WAIT01,
    /* 0x17 */ ANM_WAIT02,
    /* 0x18 */ ANM_WALK,
};

enum Joint {
    /* 0x00 */ JNT_CENTER,
    /* 0x01 */ JNT_BACKBONE,
    /* 0x02 */ JNT_CLOAK1,
    /* 0x03 */ JNT_CLOAK2,
    /* 0x04 */ JNT_HEAD,
    /* 0x05 */ JNT_HAT1,
