/**
 * @file d_a_b_yo.cpp
 * @brief Actor - Blizzeta (Boss)
 * 
 */

#include "d/dolzel_rel.h"

#include "d/actor/d_a_b_yo.h"
#include "SSystem/SComponent/c_math.h"
#include "JSystem/J3DGraphBase/J3DMaterial.h"
#include "m_Do/m_Do_graphic.h"
#include "f_op/f_op_msg.h"
#include "f_op/f_op_msg_mng.h"
#include "c/c_damagereaction.h"
#include "d/actor/d_a_b_yo_ice.h"
#include "d/actor/d_a_e_fz.h"
#include "d/actor/d_a_mirror.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_obj_ystone.h"
#include "d/d_bg_w.h"
#include "d/d_com_inf_game.h"
#include "d/d_s_play.h"

class daB_YO_HIO_c {
public:
    /* 8062F46C */ daB_YO_HIO_c();
    /* 806395E4 */ virtual ~daB_YO_HIO_c() {}

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 mScale[8];
    /* 0x28 */ f32 mFreezardNum;
    /* 0x2C */ f32 mMaxFallSpeed;
    /* 0x30 */ f32 mReboundSpeedRatio;
    /* 0x34 */ f32 mChaseSpeed;
    /* 0x38 */ f32 mReboundSpeedMax;
    /* 0x3C */ bool field_0x3c;
    /* 0x40 */ f32 mGatherTimer;
    /* 0x44 */ f32 mAttackTimer;
    /* 0x48 */ f32 mFreezardRadius;
    /* 0x4C */ f32 field_0x4c;
    /* 0x50 */ f32 field_0x50;
    /* 0x54 */ bool field_0x54;
    /* 0x58 */ f32 field_0x58;
};

STATIC_ASSERT(sizeof(daB_YO_HIO_c) == 0x5C);

enum B_YO_RES_FILE_ID {
    /* BCK */
    /* 0x07 */ BCK_YKW_B_ANGRY = 7,
    /* 0x08 */ BCK_YKW_B_ANGRY_WAIT,
    /* 0x09 */ BCK_YKW_B_DOWN,
    /* 0x0A */ BCK_YKW_B_DOWNA,
    /* 0x0B */ BCK_YKW_B_DOWNB,
    /* 0x0C */ BCK_YKW_B_DOWNC,
    /* 0x0D */ BCK_YKW_B_FLOAT,
    /* 0x0E */ BCK_YKW_B_FLOATB,
    /* 0x0F */ BCK_YKW_B_SCREAM,
    /* 0x10 */ BCK_YKW_B_SCREAM_WAIT,
    /* 0x11 */ BCK_YKW_B_TALKA,
    /* 0x12 */ BCK_YKW_B_TALKB,
    /* 0x13 */ BCK_YKW_B_TO_TALKB,
    /* 0x14 */ BCK_YKW_B_WAITA,
    /* 0x15 */ BCK_YKW_B_WAITB,
    /* 0x16 */ BCK_YKW_B_WAITC,
    /* 0x17 */ BCK_YKW_B_WAITC2,
    /* 0x18 */ BCK_YKW_B_WAITD,
    /* 0x19 */ BCK_YKW_B_WALK,

    /* BMDE */
    /* 0x1C */ BMDE_YKW_B = 0x1C,
    /* 0x1D */ BMDE_YO01,
    /* 0x1E */ BMDE_YO02,
    /* 0x1F */ BMDE_YO_CORE,
    /* 0x20 */ BMDE_YO_HIBI,
    /* 0x21 */ BMDE_YO_ICE,

    /* BRK */
    /* 0x24 */ BRK_YKW_B = 0x24,
