/**
 * @file d_a_e_dn.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_dn.h"
#include "d/d_cc_d.h"
#include "d/d_bomb.h"
#include "f_op/f_op_kankyo_mng.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_horse.h"
#include "f_op/f_op_actor_enemy.h"
#include "Z2AudioLib/Z2Instances.h"

class daE_DN_HIO_c : public JORReflexible {
public:
    daE_DN_HIO_c();
    virtual ~daE_DN_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 no;
    /* 0x08 */ f32 model_size;          // 基本サイズ
    /* 0x0C */ f32 movement_speed;      // 移動速度
    /* 0x10 */ f32 dash_speed;          // 突進速度
    /* 0x14 */ f32 battle_init_range;   // 戦闘開始範囲
    /* 0x18 */ f32 attack_init_range;   // 攻撃開始範囲
    /* 0x1C */ s16 defense_pause_time;          // 防御静止間
    /* 0x1E */ s16 soul_disappear_time_weak;          // 魂抜間 弱
    /* 0x20 */ s16 soul_disappear_time_strong;          // 魂抜間 強
    /* 0x22 */ u8 field_0x22;
    /* 0x23 */ u8 invulnerable;         // 不死身
    /* 0x24 */ u8 no_learn;           // 学習なし
};

enum Joint {
    /* 0x00 */ JNT_WORLD_ROOT,
    /* 0x01 */ JNT_BACKBONE01,
    /* 0x02 */ JNT_BACKBONE02,
    /* 0x03 */ JNT_NECK01,
    /* 0x04 */ JNT_NECK02,
    /* 0x05 */ JNT_FIN,
    /* 0x06 */ JNT_HEAD,
    /* 0x07 */ JNT_JAW1,
    /* 0x08 */ JNT_JAW2,
    /* 0x09 */ JNT_TONGUE,
    /* 0x0A */ JNT_SHOULDERL,
    /* 0x0B */ JNT_ARML1,
    /* 0x0C */ JNT_ARML2,
    /* 0x0D */ JNT_HANDL,
    /* 0x0E */ JNT_FINGERL1,
    /* 0x0F */ JNT_FINGERL2,
    /* 0x10 */ JNT_SHOULDERR,
    /* 0x11 */ JNT_ARMR1,
    /* 0x12 */ JNT_ARMR2,
    /* 0x13 */ JNT_HANDR1,
    /* 0x14 */ JNT_FINGERR1,
    /* 0x15 */ JNT_FINGERR2,
    /* 0x16 */ JNT_WAIST,
    /* 0x17 */ JNT_LEGL1,
    /* 0x18 */ JNT_LEGL2,
    /* 0x19 */ JNT_LEGL3,
    /* 0x1A */ JNT_FOOTL,
    /* 0x1B */ JNT_LEGR1,
    /* 0x1C */ JNT_LEGR2,
    /* 0x1D */ JNT_LEGR3,
    /* 0x1E */ JNT_FOOTR,
    /* 0x1F */ JNT_TAIL01,
    /* 0x20 */ JNT_TAIL02,
    /* 0x21 */ JNT_TAIL03,
