/**
 * @file d_a_myna.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_myna.h"
#include "d/actor/d_a_player.h"
#include "d/d_kankyo.h"
#include "d/d_msg_object.h"
#include "d/actor/d_a_obj_ss_item.h"
#include "d/actor/d_a_tag_myna_light.h"
#include "Z2AudioLib/Z2Instances.h"
#include "d/d_s_play.h"

static daMyna_c::ProcFunc init_proc[] = {
    &daMyna_c::attack_wait_init,
    &daMyna_c::attack_before_talk_init,
    &daMyna_c::attack_fly_init,
    &daMyna_c::attack_init,
    &daMyna_c::attack_after_talk_init,
    &daMyna_c::greet_wait_init,
    &daMyna_c::greet_talk_init,
    &daMyna_c::shopping_wait_init,
    &daMyna_c::shopping_talk_init,
    &daMyna_c::thanks_talk_init,
    &daMyna_c::byebye_talk_init,
    &daMyna_c::turn_on_start_init,
    &daMyna_c::turn_on_init,
    &daMyna_c::turn_on_end1_init,
    &daMyna_c::turn_on_end2_init,
    &daMyna_c::turn_on_end3_init,
    &daMyna_c::wolf_talk_init,
    &daMyna_c::attack_wait2_init,
    &daMyna_c::attack_before_talk2_init,
    &daMyna_c::attack_fly2_init,
    &daMyna_c::attack2_init,
    &daMyna_c::attack2_talk_init,
};

static daMyna_c::ProcFunc move_proc[] = {
    &daMyna_c::attack_wait_move,
    &daMyna_c::attack_before_talk_move,
    &daMyna_c::attack_fly_move,
    &daMyna_c::attack_move,
    &daMyna_c::attack_after_talk_move,
    &daMyna_c::greet_wait_move,
    &daMyna_c::greet_talk_move,
    &daMyna_c::shopping_wait_move,
    &daMyna_c::shopping_talk_move,
    &daMyna_c::thanks_talk_move,
    &daMyna_c::byebye_talk_move,
    &daMyna_c::turn_on_start_move,
    &daMyna_c::turn_on_move,
    &daMyna_c::turn_on_end1_move,
    &daMyna_c::turn_on_end2_move,
    &daMyna_c::turn_on_end3_move,
    &daMyna_c::wolf_talk_move,
    &daMyna_c::attack_wait2_move,
    &daMyna_c::attack_before_talk2_move,
    &daMyna_c::attack_fly2_move,
    &daMyna_c::attack2_move,
    &daMyna_c::attack2_talk_move,
};

static char* l_bckFileNameTBL[] = {
    "MYNA_hovering.bck", "MYNA_wait_a.bck",    "MYNA_pick_a.bck",    "MYNA_pick_b.bck",
    "MYNA_jump.bck",     "MYNA_sidestepL.bck", "MYNA_sidestepR.bck", "MYNA_lightup.bck",
    "MYNA_attack.bck",   "MYNA_talk_a.bck",    "MYNA_talk_b.bck",    "MYNA_wait_b.bck",
    "MYNA_wait_c.bck",   "MYNA_talk_c.bck",    "MYNA_wait_d.bck",
};

static char* l_btpFileNameTBL[] = {"MYNA.btp"};

static void createHeapCallBack(fopAc_ac_c* i_this) {
    daMyna_c* a_this = static_cast<daMyna_c*>(i_this);
    a_this->createHeap();
}

static int jntNodeCallBack(J3DJoint* i_jnt, int param_1) {
    if (param_1 == 0) {
        J3DModel* model_p = j3dSys.getModel();
        daMyna_c* myna_p = (daMyna_c*) model_p->getUserArea();
        if (myna_p != NULL) {
            myna_p->jntNodeCB(i_jnt, model_p);
        }
    }
    return 1;
}

class daMyna_HIO_c : public mDoHIO_entry_c {
public:
    virtual ~daMyna_HIO_c() {}

    daMyna_HIO_c() {
        static struct {
            /* 0x04 */ f32 scale;
            /* 0x08 */ f32 jump_anime;
            /* 0x0C */ f32 jump_speed;
            /* 0x10 */ f32 side_walking_speed;
            /* 0x14 */ f32 link_attack_height;
            /* 0x18 */ f32 link_approach_dist;
            /* 0x1C */ f32 streetlight_approach_dist;
            /* 0x20 */ f32 return_approach_dist;
            /* 0x24 */ s16 annihilation_return_wait;
            /* 0x26 */ s16 turn_angle_add_val;
            /* 0x28 */ s16 max_vibration_angle;
            /* 0x2A */ s16 min_vibration_angle;
            /* 0x2C */ s16 up_and_down_movement;
            /* 0x2E */ s16 heaving_speed;
            /* 0x30 */ s16 damage_timer;
        } aParam = {
            1.0f,
            1.0f,
            0.08f,
            0.4f,
            30.0f,
            45.0f,
            42.0f,
            2.0f,
            75,
            4,
            0x7fff,
            1500,
            5,
            0x2000,
            30,
        };
        memcpy(&scale, &aParam, sizeof(aParam));
    }

#if DEBUG
    void genMessage(JORMContext* ctext) {
        // scale:
        ctext->genSlider("スケール", &scale, 0.0f, 2.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        ctext->genLabel("**********", 0, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // turn angle add value
        ctext->genSlider("振向角加算値", &turn_angle_add_val, -0x8000, 0x7fff, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // max vibration angle
        ctext->genSlider("振向角最大", &max_vibration_angle, -0x8000, 0x7fff, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // min vibration angle
        ctext->genSlider("振向角最小", &min_vibration_angle, -0x8000, 0x7fff, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        ctext->genLabel("**********", 0, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // jump anime
        ctext->genSlider("Jumpアニメ", &jump_anime, 0.0f, 5.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // jump speed
        ctext->genSlider("Jumpスピード", &jump_speed, 0.0f, 2.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // side walking speed
        ctext->genSlider("側歩スピード", &side_walking_speed, 0.0f, 5.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        ctext->genLabel("**********", 0, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // approach dist to streetlights?
        ctext->genSlider("外灯接近距離 ", &streetlight_approach_dist, 0.0f, 100.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // return approach dist
        ctext->genSlider("戻り接近距離", &return_approach_dist, 0.0f, 100.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // annihilation return wait
        ctext->genSlider("全滅戻りウエイト", &annihilation_return_wait, 0, 1000, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        ctext->genLabel("**********", 0, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // link attack height
        ctext->genSlider("リンク攻撃高さ", &link_attack_height, -100.0f, 100.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // link approach dist
        ctext->genSlider("リンク接近距離", &link_approach_dist, 0.0f, 100.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // up and down movement
        ctext->genSlider("上下揺れ具合", &up_and_down_movement, 0, 100, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // heaving speed
        ctext->genSlider("上下揺れ速度", &heaving_speed, 0, 0x7fff, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
        // damage timer
        ctext->genSlider("ダメージタイマー", &damage_timer, 10, 500, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 24);
    }
#endif

    /* 0x04 */ f32 scale;
    /* 0x08 */ f32 jump_anime;
    /* 0x0C */ f32 jump_speed;
    /* 0x10 */ f32 side_walking_speed;
    /* 0x14 */ f32 link_attack_height;
    /* 0x18 */ f32 link_approach_dist;
    /* 0x1C */ f32 streetlight_approach_dist;
    /* 0x20 */ f32 return_approach_dist;
    /* 0x24 */ s16 annihilation_return_wait;
    /* 0x26 */ s16 turn_angle_add_val;
    /* 0x28 */ s16 max_vibration_angle;
    /* 0x2A */ s16 min_vibration_angle;
    /* 0x2C */ s16 up_and_down_movement;
    /* 0x2E */ s16 heaving_speed;
    /* 0x30 */ s16 damage_timer;
};

STATIC_ASSERT(sizeof(daMyna_HIO_c) == 0x34);

static daMyna_HIO_c l_HOSTIO;

static fopAc_ac_c* daMyna_targetActor[10];

static fopAc_ac_c* daMyna_subActor[10];

static daTag_MynaLight_c* daMyna_LightActor;

static int daMyna_actor_count;

static void* daMyna_searchSSItem(void* param_0, void* param_1) {
    if (fopAcM_IsActor(param_0) && (fopAcM_GetName(param_0) == PROC_OBJ_SSITEM ||
                                    fopAcM_GetName(param_0) == PROC_OBJ_SSDRINK ||
                                    fopAcM_GetName(param_0) == PROC_TAG_SSDRINK))
    {
        if ((fopAcM_GetParam(param_1) & 0xF0000000) == (fopAcM_GetParam(param_0) & 0xF0000000) &&
            daMyna_actor_count < 10)
        {
            fopAc_ac_c* pfVar4 = static_cast<fopAc_ac_c*>(param_0);
            if (fopAcM_GetName(param_0) == PROC_OBJ_SSITEM) {
                pfVar4 = static_cast<daObj_SSItem_c*>(param_0)->getExchangeItemPtr();
            }
