/**
 * @file d_a_e_zm.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_zm.h"
#include "f_op/f_op_actor_enemy.h"

enum E_zm_RES_File_ID {
    /* BCK */
    /* 0x4 */ BCK_ZM_BIRI2 = 0x4,
    /* 0x5 */ BCK_ZM_DOWN,
    /* 0x6 */ BCK_ZM_MOUTHOPEN,

    /* BMDR */
    /* 0x9 */ BMDR_ZM = 0x9,
};

enum Joint {
    /* 0x0 */ JNT_CENTER,
    /* 0x1 */ JNT_TONGUE1,
    /* 0x2 */ JNT_TONGUE2,
    /* 0x3 */ JNT_TONGUE3,
    /* 0x4 */ JNT_TONGUE4,
    /* 0x5 */ JNT_TONGUE5,
};

enum Action {
    /* 0x0 */ ACTION_SEARCH_POINT,
    /* 0x1 */ ACTION_WAIT,
    /* 0x2 */ ACTION_MOVE,
    /* 0x3 */ ACTION_ATTACK,
    /* 0x4 */ ACTION_DAMAGE,
    /* 0x5 */ ACTION_DEAD,
    /* 0x6 */ ACTION_BULLET,
};

enum Mode {
    /* 0x0 */ MODE_0,
    /* 0x1 */ MODE_1,
    /* 0x2 */ MODE_2,
    /* 0x3 */ MODE_3,
    /* 0xA */ MODE_10 = 0xA,
    /* 0xB */ MODE_11,
    /* 0xC */ MODE_12,
};

class daE_ZM_HIO_c : public JORReflexible {
public:
    daE_ZM_HIO_c();
    virtual ~daE_ZM_HIO_c() {}

    void genMessage(JORMContext*);

    /* ザントの首 Zant's Head */
    /* 0x04 */ s8 id;
    /* 0x08 */ f32 model_size;                          // モデルサイズ - Model Size
    /* 0x0C */ f32 occurance_range;                     // 出現範囲 - Occurance Range
    /* 0x10 */ f32 bullet_speed;                        // 弾速度 - Bullet Speed
    /* 0x14 */ s16 wait_time_after_attack;              // 攻撃後の待ち時間 - Wait Time After Attack
    /* 0x16 */ s16 wait_time_before_attack;             // 攻撃前の待ち時間 - Wait Time Before Attack
    /* 0x18 */ s16 wait_time_to_appear_after_attack;    // 攻撃終了後次回出現までの待ち時間 - Wait Time To Appear After Attack
    /* 0x1A */ s16 stun_time;                           // 麻痺時間 - Stun Time
};

static u8 l_initHIO;

static daE_ZM_HIO_c l_HIO;

namespace {
    /* 80832DFC-80832E40 000038 0044+00 1/1 0/0 0/0 .data            cc_zm_src__22@unnamed@d_a_e_zm_cpp@ */
    static dCcD_SrcCyl cc_zm_src = {
        {
            {0, {{AT_TYPE_0, 0, 0}, {0xD8FBFDFF, 0x43}, 0x45}},
            {dCcD_SE_13, 0, 0, 0, 0},
            {dCcD_SE_NONE, 0, 0, 0, 0x2504},
            {0},
        },
        {
            {0.0f, 0.0f, 0.0f}, 50.0f, 300.0f,
        },
    };

    /* 80832E40-80832E80 00007C 0040+00 1/1 0/0 0/0 .data            cc_zm_at_src__22@unnamed@d_a_e_zm_cpp@ */
    static dCcD_SrcSph cc_zm_at_src = {
        {
            {0, {{AT_TYPE_CSTATUE_SWING, 2, 0xD}, {0xD8FBFDFF, 0x43}, 0}},
            {dCcD_SE_13, 0, 0, 0, 0},
            {dCcD_SE_NONE, 0, 0, 0, 2},
            {0}
        },
        {
            {{0.0f, 0.0f, 0.0f}, 40.0f},
        },
    };
} // namespace

