//
// Generated By: dol2asm
// Translation Unit: d_a_tag_TWgate
//

#include "d/actor/d_a_tag_TWgate.h"
#include "d/actor/d_a_player.h"
#include "d/d_com_inf_game.h"
#include "d/d_msg_object.h"
#include "dol2asm.h"
#include "f_op/f_op_actor_mng.h"

//
// Types:
//

struct daTagTWGate_zevParam {
    /* 0x00 */ char* mArcName;
    /* 0x04 */ char* mEventName;
    /* 0x08 */ char* mTalkEventName;
    /* 0x0C */ char* mInEventName;
    /* 0x10 */ int mLv;
    /* 0x14 */ char* mStage;
    /* 0x18 */ s16 mPoint;
    /* 0x1A */ s8 mRoomNo;
    /* 0x1B */ s8 mLayer;
};

//
// Forward References:
//

extern "C" void initWait__13daTagTWGate_cFv();
extern "C" void executeWait__13daTagTWGate_cFv();
extern "C" void initDemoFilone1__13daTagTWGate_cFv();
extern "C" void executeDemoFilone1__13daTagTWGate_cFv();
extern "C" void initDemoFilone2__13daTagTWGate_cFv();
extern "C" void executeDemoFilone2__13daTagTWGate_cFv();
extern "C" void initDemoFilone3__13daTagTWGate_cFv();
extern "C" void executeDemoFilone3__13daTagTWGate_cFv();
extern "C" void initDemoOrdin1__13daTagTWGate_cFv();
extern "C" void executeDemoOrdin1__13daTagTWGate_cFv();
extern "C" void initDemoOrdin2__13daTagTWGate_cFv();
extern "C" void executeDemoOrdin2__13daTagTWGate_cFv();
extern "C" void initDemoOrdin3__13daTagTWGate_cFv();
extern "C" void executeDemoOrdin3__13daTagTWGate_cFv();
extern "C" void initDemoRanail1__13daTagTWGate_cFv();
extern "C" void executeDemoRanail1__13daTagTWGate_cFv();
extern "C" void initDemoRanail2__13daTagTWGate_cFv();
