/**
 * @file d_a_obj_bemos.cpp
 *
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "SSystem/SComponent/c_lib.h"
#include "d/actor/d_a_obj_bemos.h"
#include "res/Object/Obj_bm.h"
#include "d/d_camera.h"
#include "d/d_cc_d.h"
#include "d/d_com_inf_game.h"
#if DEBUG
#include "d/d_debug_viewer.h"
#endif
#include "d/d_s_play.h"
#include "Z2AudioLib/Z2Instances.h"

enum Action_e {
    /* 0x0 */ ACTION_SW_WAIT_e,
    /* 0x1 */ ACTION_WARNING_e,
    /* 0x2 */ ACTION_FIND_PLAYER_e,
    /* 0x3 */ ACTION_ATTACK_e,
    /* 0x4 */ ACTION_DEAD_e,
};

enum Mode_e {
    /* 0x0 */ MODE_WAIT_e,
    /* 0x1 */ MODE_WALK_e,
    /* 0x2 */ MODE_AFL_e,
    /* 0x3 */ MODE_DEAD_e,
};

#if DEBUG
#pragma nosyminline on
#endif

static Vec const l_eye_offset = {0.0f, 330.0f, 75.0f};

static Vec const l_high_beam_offset = {0.0f, 255.0f, 65.0f};

static Vec const l_mid_beam_offset = {0.0f, 205.0f, 65.0f};

static Vec const l_low_beam_offset = {0.0f, 160.0f, 65.0f};

static Vec const l_craw_offset[4] = {
    {-95.0f, 0.0f, 0.0f},
    {95.0f, 0.0f, 0.0f},
    {0.0f, 0.0f, -95.0f},
    {0.0f, 0.0f, 95.0f},
};

s16 const daObjBm_c::M_dir_base[4] = {
    0x0000,
    0x4000,
    -0x8000,
    -0x4000,
};

static const char* l_arcName = "Obj_bm";

static const char* l_eye_matName = "bmEye";

static char* l_head_joint = "head";

static char* l_bigGear_joint = "cogRed";

static char* l_smallGear0_joint = "cogBlue";

static char* l_smallGear1_joint = "cogGreen";

static char* l_smallGear2_joint = "cogYellow";

static char* l_joint_table[5] = {
    l_head_joint, l_bigGear_joint, l_smallGear0_joint, l_smallGear1_joint, l_smallGear2_joint,
};

static cull_box l_cull_box = {
    {-1200.0f, -100.0f, -1200.0f},
    {1200.0f, 400.0f, 1200.0f},
};

static dCcD_SrcSph l_sph_src = {
    {
        {0x0, {{0x0, 0x0, 0x0}, {0x402020, 0x11}, 0x58}},  // mObj
        {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x0},                // mGObjAt
        {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x0},                // mGObjTg
        {0x0},                                             // mGObjCo
    },                                                     // mObjInf
    {
        {{0.0f, 0.0f, 0.0f}, 50.0f}  // mSph
    }  // mSphAttr
};

static dCcD_SrcCps l_cps_src = {
    {
        {0x0, {{0x100, 0x1, 0x1d}, {0x0, 0x0}, 0x0}},  // mObj
        {dCcD_SE_SWORD, 0x0, 0x0, 0x1, 0x0},           // mGObjAt
        {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x4},            // mGObjTg
        {0x0},                                         // mGObjCo
    },                                                 // mObjInf
    {
        {{0.0f, 0.0f, 0.0f}, {0.0f, 0.0f, 0.0f}, 20.0f},  // mCps
    }  // mCpsAttr
};

static dCcD_SrcCyl l_cyl_src = {
    {
        {0x0, {{0x0, 0x0, 0x1f}, {0x0, 0x0}, 0x79}},  // mObj
        {dCcD_SE_NONE, 0x1, 0x0, 0x0, 0x0},           // mGObjAt
        {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x6},           // mGObjTg
        {0x0},                                        // mGObjCo
    },                                                // mObjInf
    {
        {
            {0.0f, 0.0f, 0.0f},  // mCenter
            15.0f,               // mRadius
            60.0f                // mHeight
        }  // mCyl
    }
};


#if DEBUG
class daObjBm_HIO_c : public mDoHIO_entry_c {
public:
    daObjBm_HIO_c();

    void genMessage(JORMContext*);

    /* 0x08 */ cXyz beam_scale;
    /* 0x14 */ f32 beam_lower_dist;
    /* 0x18 */ f32 beam_middle_dist;
    /* 0x1C */ f32 field_0x1C;
    /* 0x20 */ f32 search_dist;
    /* 0x24 */ f32 target_offset_dist;
    /* 0x28 */ s16 search_angle;
    /* 0x2A */ s16 patrol_rot_spd;
    /* 0x2C */ s16 attack_rot_spd;
    /* 0x2E */ s16 after_switch_activate_no_search_time;
    /* 0x30 */ s16 detection_angle;
    /* 0x32 */ s16 search_spd_on_detect;
    /* 0x34 */ f32 body_scale;
    /* 0x38 */ f32 sound_pos_move_spd;
    /* 0x3C */ u8 no_search_attack_time;
    /* 0x3D */ u8 debug_draw;
    /* 0x3E */ u8 check_draw;
};

daObjBm_HIO_c l_HIO;

daObjBm_HIO_c::daObjBm_HIO_c() {
    beam_scale.set(0.5f, 0.5f, 1.0f);
    search_dist = 1000.0f;
    search_angle = 30000;
    patrol_rot_spd = 500;
    attack_rot_spd = 450;
    beam_lower_dist = 300.0f;
    beam_middle_dist = 600.0f;
    field_0x1C = 1000.0f;
    target_offset_dist = 0.0f;
    after_switch_activate_no_search_time = 20;
    detection_angle = 25000;
    sound_pos_move_spd = 60.0f;
    no_search_attack_time = 0;
    search_spd_on_detect = 1000;
    body_scale = 1.0f;
    debug_draw = 0;
    check_draw = 0;
}

void daObjBm_HIO_c::genMessage(JORMContext* ctx) {
    ctx->genLabel("ビーモス", 0, 0, NULL, -1, -1, 512, 24);
    ctx->genCheckBox("デバッグ描画", &debug_draw, 1, 0, NULL, -1, -1, 512, 24);
    ctx->genSlider("サーチ距離", &search_dist, 100.0f, 5000.0f, 0, NULL, -1, -1, 512, 24);
    ctx->genSlider("サーチ角度", &search_angle, 0.0f, 32767.0f, 0, NULL, -1, -1, 512, 24);
