/**
* @file d_a_b_tn.cpp
 *
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_b_tn.h"
#include <cmath.h>
#include "Z2AudioLib/Z2Instances.h"
#include "d/actor/d_a_boomerang.h"
#include "d/actor/d_a_nbomb.h"

#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"

enum B_TN_RES_FILE_ID {
    /* BCK */
    /* 0x04 */ BCK_TN2B_DIE = 4,
    /* 0x05 */ BCK_TNA_ATACK_A,
    /* 0x06 */ BCK_TNA_ATACK_B,
    /* 0x07 */ BCK_TNA_ATACK_OP,
    /* 0x08 */ BCK_TNA_ATACK_SHIELD,
    /* 0x09 */ BCK_TNA_DAMAGE_L,
    /* 0x0A */ BCK_TNA_DAMAGE_LAST,
    /* 0x0B */ BCK_TNA_DAMAGE_R,
    /* 0x0C */ BCK_TNA_GUARD,
    /* 0x0D */ BCK_TNA_GUARD_DAMAGE,
    /* 0x0E */ BCK_TNA_TURN_OP,
    /* 0x0F */ BCK_TNA_WAIT,
    /* 0x10 */ BCK_TNA_WAIT_B_1,
    /* 0x11 */ BCK_TNA_WAIT_B_2,
    /* 0x12 */ BCK_TNA_WAIT_OP,
    /* 0x13 */ BCK_TNA_WALK,
    /* 0x14 */ BCK_TNB_ATACK_A,
    /* 0x15 */ BCK_TNB_ATACK_B,
    /* 0x16 */ BCK_TNB_ATACK_SHIELD,
    /* 0x17 */ BCK_TNB_DAMAGE_L,
    /* 0x18 */ BCK_TNB_DAMAGE_R,
    /* 0x19 */ BCK_TNB_DIE,
    /* 0x1A */ BCK_TNB_DOWN,
    /* 0x1B */ BCK_TNB_DOWN_SIPPU,
    /* 0x1C */ BCK_TNB_GUARD_A,
    /* 0x1D */ BCK_TNB_GUARD_B,
    /* 0x1E */ BCK_TNB_JUMP_B_1,
    /* 0x1F */ BCK_TNB_JUMP_B_2,
    /* 0x20 */ BCK_TNB_JUMP_F_1,
    /* 0x21 */ BCK_TNB_JUMP_F_2,
    /* 0x22 */ BCK_TNB_JUMP_L_1,
    /* 0x23 */ BCK_TNB_JUMP_L_2,
    /* 0x24 */ BCK_TNB_JUMP_R_1,
    /* 0x25 */ BCK_TNB_JUMP_R_2,
    /* 0x26 */ BCK_TNB_PULL,

    /* executeChangeDemo */
    /* 0x01 */ CHANGE_DEMO_PHASE_JUMP_B_1 = 0x1,
    /* 0x02 */ CHANGE_DEMO_PHASE_JUMP_B_2,
    /* 0x03 */ CHANGE_DEMO_PHASE_THROW_INIT,
    /* 0x04 */ CHANGE_DEMO_PHASE_THROW_EXECUTE,
    /* 0x0A */ CHANGE_DEMO_PHASE_WAIT = 0xA,
    /* 0x0B */ CHANGE_DEMO_PHASE_11,
    /* 0x0C */ CHANGE_DEMO_PHASE_12,
    /* 0x0D */ CHANGE_DEMO_PHASE_PULL_INIT,
    /* 0x0F */ CHANGE_DEMO_PHASE_PULL_EXECUTE = 0xF,
    /* 0x10 */ CHANGE_DEMO_PHASE_END,
    /* 0x64 */ CHANGE_DEMO_PHASE_100 = 0x64,
    /* 0x65 */ CHANGE_DEMO_PHASE_101,

    /* executeZakoChangeDemo */
    /* 0x1 */ ZAKO_CHANGE_DEMO_PHASE_JUMP_INIT = 0x1,
    /* 0x2 */ ZAKO_CHANGE_DEMO_PHASE_JUMP_END,
    /* 0x3 */ ZAKO_CHANGE_DEMO_PHASE_THROW_INIT,
    /* 0x4 */ ZAKO_CHANGE_DEMO_PHASE_THROW_END,
    /* 0x5 */ ZAKO_CHANGE_DEMO_PHASE_END,

    /* executeChaseL */
    /* 0x01 */ CHASE_L_PHASE_INIT = 0x1,
    /* 0x02 */ CHASE_L_PHASE_WAIT,
    /* 0x03 */ CHASE_L_PHASE_WALK,
    /* 0x04 */ CHASE_L_PHASE_WAIT_B_1,
    /* 0x05 */ CHASE_L_PHASE_WAIT_B_2,
    /* 0x06 */ CHASE_L_PHASE_JUMP_BACK,
    /* 0x07 */ CHASE_L_PHASE_JUMP_BACK_LAND,
    /* 0x08 */ CHASE_L_PHASE_JUMP_FRONT,
    /* 0x09 */ CHASE_L_PHASE_JUMP_FRONT_LAND,
    /* 0x0A */ CHASE_L_PHASE_10,
    /* 0x0B */ CHASE_L_PHASE_11,
    /* 0x0C */ CHASE_L_PHASE_JUMP_RIGHT_LAND,
    /* 0x0D */ CHASE_L_PHASE_13,
    /* 0x0E */ CHASE_L_PHASE_14,
    /* 0x0F */ CHASE_L_PHASE_JUMP_LEFT_LAND,
    /* 0x10 */ CHASE_L_PHASE_WALK_TO_JUMP,
    /* 0x11 */ CHASE_L_PHASE_JUMP_FRONT_FAST,

    /* executeAttackL */
    /* 0x01 */ ATTACK_L_PHASE_ATACK_A_EXECUTE = 0x1,
    /* 0x02 */ ATTACK_L_PHASE_ATACK_B_EXECUTE,
    /* 0x03 */ ATTACK_L_PHASE_ATACK_A_INIT,
    /* 0x04 */ ATTACK_L_PHASE_ATACK_B_INIT,
    /* 0x0A */ ATTACK_L_PHASE_WAIT_TO_ATACK_FAST = 0xA,
    /* 0x0B */ ATTACK_L_PHASE_11,
    /* 0x14 */ ATTACK_L_PHASE_WAIT_TO_ATACK = 0x14,
    /* 0x65 */ ATTACK_L_PHASE_ATACK_A_END = 0x65,
    /* 0x66 */ ATTACK_L_PHASE_ATACK_B_END,

    /* executeAttackShieldL */
    /* 0x1 */ ATTACK_SHIELD_L_PHASE_ATACK_SHIELD_EXECUTE = 0x1,
    /* 0xA */ ATTACK_SHIELD_L_PHASE_10 = 0xA,

    /* executeGuardL */
    /* 0x1 */ GUARD_L_PHASE_1 = 0x1,
    /* 0x2 */ GUARD_L_PHASE_CHASEL_MODE_INIT,
    /* 0x3 */ GUARD_L_PHASE_ATTACK_MODE_INIT,
    /* 0xA */ GUARD_L_PHASE_10 = 0xA,
    /* 0xB */ GUARD_L_PHASE_11,

    /* executeDamage */
    /* 0x0 */ DAMAGE_PHASE_LEFT_INIT = 0x0,
    /* 0x1 */ DAMAGE_PHASE_RIGHT_INIT,
    /* 0x2 */ DAMAGE_PHASE_LEFT_END,
    /* 0x3 */ DAMAGE_PHASE_RIGHT_END,

    /* executeYoroke */
    /* 0x1 */ YOROKE_PHASE_1 = 0x1,
    /* 0xA */ YOROKE_PHASE_EXECUTE = 0xA,

    /* executeEnding */
    /* 0x01 */ ENDING_PHASE_DIE_EXECUTE = 0x1,
    /* 0x02 */ ENDING_PHASE_2,
    /* 0x03 */ ENDING_PHASE_3,
    /* 0x04 */ ENDING_PHASE_4,
    /* 0x05 */ ENDING_PHASE_END,
    /* 0x64 */ ENDING_PHASE_SET_POS_ANGLE = 0x64,

    /* executeZakoEnding */
    /* 0x1 */ ZAKO_ENDING_PHASE_DIE_EXECUTE = 0x1,
    /* 0x2 */ ZAKO_ENDING_PHASE_2,
    /* 0x3 */ ZAKO_ENDING_PHASE_END,
};

class daB_TN_HIO_c {
public:
    /* 8061EBEC */ daB_TN_HIO_c();
    /* 8062D98C */ virtual ~daB_TN_HIO_c() {};

    /* 0x04 */ s8 mUnk1;
    /* 0x08 */ f32 mScale;
    /* 0x0C */ f32 mKColorA;
    /* 0x10 */ f32 mTimer3Wolf;
    /* 0x14 */ f32 mTimer3HumanType0;
    /* 0x18 */ f32 mTimer3HumanType1;
    /* 0x1C */ f32 mTimer3NormalType0;
    /* 0x20 */ f32 mTimer3NormalType1;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ f32 mTimer1Action1;
    /* 0x2C */ f32 mTimer1Action2;
};

STATIC_ASSERT(sizeof(daB_TN_HIO_c) == 0x30);

/* 8062E93C-8062E97C 000038 0040+00 0/1 0/0 0/0 .data            cc_tt_src__22@unnamed@d_a_b_tn_cpp@ */
namespace {
static dCcD_SrcSph cc_tt_src = {
    {
        {0, {{AT_TYPE_CSTATUE_SWING, 0, 0}, {0xD8000012, 0x43}, 0x75}},
        {dCcD_SE_METAL, 0, 0, 0, {0}},
        {dCcD_SE_NONE, 0, 0, 0, {6}},
        {0},
    },
    {{
        {0.0f, 0.0f, 0.0f},
        40.0f,
    }},
};

/* 8062E97C-8062E9BC 000078 0040+00 0/1 0/0 0/0 .data cc_tt_src2__22@unnamed@d_a_b_tn_cpp@ */
static dCcD_SrcSph cc_tt_src2 = {
    {
        {0, {{AT_TYPE_CSTATUE_SWING, 0, 0}, {0x00FBFDED, 0x43}, 0x0}},
        {dCcD_SE_METAL, 0, 0, 0, {0}},
        {dCcD_SE_NONE, 0, 0, 0, {7}},
        {0},
    },
    {{
        {0.0f, 0.0f, 0.0f},
        40.0f,
    }},
};

/* 8062E9BC-8062E9FC 0000B8 0040+00 0/1 0/0 0/0 .data cc_bomb_src__22@unnamed@d_a_b_tn_cpp@ */
static dCcD_SrcSph cc_bomb_src = {
    {
