/**
 * @file d_a_e_dt.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_dt.h"
#include "JSystem/J3DGraphBase/J3DMaterial.h"
#include "SSystem/SComponent/c_math.h"
#include "Z2AudioLib/Z2Instances.h"
#include "c/c_damagereaction.h"
#include "d/actor/d_a_e_ot.h"
#include "d/actor/d_a_obj_amiShutter.h"
#include "d/actor/d_a_player.h"
#include "d/d_camera.h"
#include "d/d_com_inf_game.h"
#include "d/d_bomb.h"
#include "f_op/f_op_actor_mng.h"
#include "f_op/f_op_camera_mng.h"
#include "m_Do/m_Do_graphic.h"
#include "m_Do/m_Do_lib.h"

class daE_DT_HIO_c {
public:
    daE_DT_HIO_c();
    virtual ~daE_DT_HIO_c() {}

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 mScale;
    /* 0x0C */ f32 mWalkSpeed;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ f32 field_0x14;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 mStunTimer;
    /* 0x20 */ f32 mPressTimer;
    /* 0x24 */ f32 mMaxFallSpeed;
    /* 0x28 */ f32 field_0x28;
    /* 0x2C */ f32 field_0x2c;
};

enum Action {
    /* 0x0 */ ACT_WAIT,
    /* 0x1 */ ACT_CRY,
    /* 0x2 */ ACT_SHAKE,
    /* 0x3 */ ACT_WALK,
    /* 0x4 */ ACT_JUMP,
    /* 0x5 */ ACT_DOWN,
    /* 0x6 */ ACT_SEARCH,
    /* 0x7 */ ACT_DAMAGE,
    /* 0x8 */ ACT_BOMB_DAMAGE,
    /* 0x9 */ ACT_DEATH,
    /* 0xA */ ACT_OPENING,
};

enum Animation {
    /* 0x04 */ ANM_CROAK = 4,
    /* 0x05 */ ANM_CROAK_DAMAGE,
    /* 0x06 */ ANM_DEAD,
    /* 0x07 */ ANM_DOWN_DAMAGE,
    /* 0x08 */ ANM_DOWN_DAMAGE_2,
    /* 0x09 */ ANM_DOWN_RETURN,
    /* 0x0A */ ANM_DOWN_RETURN_2,
    /* 0x0B */ ANM_DOWN_WAIT,
    /* 0x0C */ ANM_JUMP_END,
    /* 0x0D */ ANM_JUMP_START,
    /* 0x0E */ ANM_JUMP_TOP,
    /* 0x0F */ ANM_KYORO_2,
    /* 0x10 */ ANM_OP_DEMO,
    /* 0x11 */ ANM_OP_DEMO_FALL,
    /* 0x12 */ ANM_OP_DEMO_SWING,
    /* 0x13 */ ANM_OP_DEMO_WAIT,
    /* 0x14 */ ANM_SMALL_DAMAGE,
    /* 0x15 */ ANM_STEP,
    /* 0x16 */ ANM_SWING,
    /* 0x17 */ ANM_WAIT_01,
    /* 0x18 */ ANM_WALK_01,
