/**
 * @file d_a_e_oc.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_oc.h"
#include "d/d_camera.h"
#include "Z2AudioLib/Z2Instances.h"
#include "d/d_com_inf_game.h"
#include "SSystem/SComponent/c_math.h"
#include "d/actor/d_a_obj_rotBridge.h"
#include "d/d_cc_uty.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"


enum OC_ACTIONS {
    E_OC_ACTION_WAIT,
    E_OC_ACTION_WALK,
    E_OC_ACTION_TALK,
    E_OC_ACTION_FIND,
    E_OC_ACTION_ATTACK,
    E_OC_ACTION_DAMAGE,
    E_OC_ACTION_BIG_DAMAGE,
    E_OC_ACTION_WATCH,
    E_OC_ACTION_SOUND_WATCH,
    E_OC_ACTION_DEATH,
    E_OC_ACTION_WATER_DEATH,
    E_OC_ACTION_DEMO_MASTER,
    E_OC_ACTION_DEMO_CHILD,
    E_OC_ACTION_FALL_DEAD,
    E_OC_ACTION_FALL,
    E_OC_ACTION_FIND_STAY,
    E_OC_ACTION_MOVE_OUT,
};

class daE_OC_HIO_c : public JORReflexible {
public:
    /* 8072C5CC */ daE_OC_HIO_c();
    /* 80735630 */ virtual ~daE_OC_HIO_c() {}

    /* 0x04 */ s8 field_0x04;
    /* 0x05 */ u8 radius_representation;
    /* 0x08 */ f32 plyr_srch_max_radius_S;
    /* 0x0c */ f32 plyr_srch_max_radius_M;
    /* 0x10 */ f32 plyr_srch_min_radius;
    /* 0x14 */ f32 battle_participation_radius;
    /* 0x18 */ f32 teammate_attention_radius;
    /* 0x1c */ f32 basic_size;
    /* 0x20 */ f32 standby_distance;
    /* 0x24 */ f32 demo_waiting_time;

#if DEBUG
    void genMessage(JORMContext*);
#endif
};

/* 80735B54-80735B7C 00002C 0028+00 0/1 0/0 0/0 .rodata          oc_attackb_trans__6E_OC_n */
f32 const E_OC_n::oc_attackb_trans[10] = {
    0.0f, 0.0f, 0.0f, 0.0f, 15.3f, 
    38.4f, 63.3f, 86.2f, 103.3f, 112.0f
};

/* 80735B7C-80735BA4 000054 0028+00 0/1 0/0 0/0 .rodata          oc_attackc_trans__6E_OC_n */
f32 const E_OC_n::oc_attackc_trans[10] = {
    0.0f, 31.3f, 72.7f, 91.5f, 91.5f,
    91.5f, 91.5f, 91.5f, 91.5f, 91.5f
};

/* 80735D64-80735DA4 000038 0040+00 1/1 0/0 0/0 .data            cc_sph_src__6E_OC_n */
dCcD_SrcSph E_OC_n::cc_sph_src = {
    {
        {0x0, {{0x0, 0x0, 0x0}, {0xD8FBFDFF, 0x3}, 0x75}}, // mObj
        {0x9, 0x0, 0x0, 0x0, 0x0}, // mGObjAt
        {0x0, 0x0, 0x0, 0x0, 0x2}, // mGObjTg
        {0x0}, // mGObjCo
    }, // mObjInf
    {
        {{0.0f, 0.0f, 0.0f}, 40.0f} // mSph
    } // mSphAttr
};

