#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_tbox.h"
#include "d/d_tresure.h"
#include "d/d_item_data.h"
#include "d/actor/d_a_midna.h"
#include "d/d_path.h"
#include "d/d_bg_w.h"
#include "f_op/f_op_camera_mng.h"
#include "SSystem/SComponent/c_math.h"
#include "Z2AudioLib/Z2Instances.h"
#include <math.h>

static const f32 l_cull_size_box[6] = { -150.0f, -10.0f, -150.0f, 150.0f, 300.0f, 100.0f };

static const cM3dGCylS l_cyl_info[3] = {
    { 0.0f, 0.0f, -40.0f, 40.0f, 60.0f },
    { 0.0f, 0.0f, -60.0f, 50.0f, 70.0f },
    { 0.0f, 0.0f, -60.0f, 70.0f, 80.0f },
};

static char* l_staff_name = "TREASURE";

static dCcD_SrcCyl l_cyl_src = {
    {
        {0x0, {{0x0, 0x0, 0x1e}, {0x0, 0x0}, 0x79}}, // mObj
        {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x0}, // mGObjAt
        {dCcD_SE_METAL, 0x2, 0x0, 0x0, 0x3}, // mGObjTg
        {0x0}, // mGObjCo
    }, // mObjInf
    {
        {
            {0.0f, 0.0f, 0.0f}, // mCenter
            0.0f, // mRadius
            0.0f // mHeight
        } // mCyl
    }
};

static daTbox_ModelInfo l_modelInfo[3] = {
    { "Dalways", 12, 7, 25, 26, 14, 19 },
    { "Dalways", 13, 8, 27, 28, 14, 19 },
    { "BoxC", 14, 8, 20, 21, 11, 17 },
};

static cXyz l_light_offset(0.0f, 35.0f, 0.0f);

class daTbox_HIO_c : public mDoHIO_entry_c {
public:
    daTbox_HIO_c();
    virtual ~daTbox_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ u8 mItemNo;
    /* 0x05 */ u8 mUseDebugItemNo;
    /* 0x06 */ u8 mClearSwitch;
    /* 0x07 */ u8 mDemoType;
    /* 0x08 */ u8 mDebugLightColorEnabled;
    /* 0x09 */ u8 mTimerDisplay;
    /* 0x0A */ u8 mCheckDisplay;
    /* 0x0B */ u8 mSaveOff;
    /* 0x0C */ f32 mGravity;
    /* 0x10 */ cXyz mLightOffset;
    /* 0x1C */ s16 mLightColorR;
    /* 0x1E */ s16 mLightColorG;
    /* 0x20 */ s16 mLightColorB;
    /* 0x24 */ f32 mLightPower;
    /* 0x28 */ f32 mFluctuationRate;
    /* 0x2C */ f32 mEnvColorInfluence;
    /* 0x30 */ s16 mFluctuationSpeed;
    /* 0x32 */ u8 mForPlacementCheck;
};

STATIC_ASSERT(sizeof(daTbox_HIO_c) == 0x34);

daTbox_HIO_c::daTbox_HIO_c() {
    mItemNo = 1;
    mUseDebugItemNo = 0;
    mGravity = -2.0f;
    mDemoType = 0;
    mTimerDisplay = 0;
    mCheckDisplay = 0;
    mClearSwitch = 0;
    mSaveOff = 0;
    mDebugLightColorEnabled = 0;
    mLightColorR = 0;
    mLightColorG = 0;
    mLightColorB = 0;
    mLightOffset = l_light_offset;
    mLightPower = 70.0f;
    mFluctuationRate = 0.3f;
    mFluctuationSpeed = 7500;
    mEnvColorInfluence = 0.55f;
    mForPlacementCheck = 0;
}

daTbox_ModelInfo* daTbox_c::getModelInfo() {
    return &l_modelInfo[getShapeType()];
}

static const u32 l_open_se_id[3] = { Z2SE_OBJ_TBOX_OPEN_A, Z2SE_OBJ_TBOX_OPEN_B, Z2SE_OBJ_TBOX_OPEN_C };

cPhs__Step daTbox_c::commonShapeSet() {
    daTbox_ModelInfo* model_info = getModelInfo();

    J3DModelData* modelData = (J3DModelData*)dComIfG_getObjectRes(model_info->mArcName, model_info->mModelResNo);
