/**
 * @file d_a_e_gm.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_gm.h"
#include "f_op/f_op_actor_enemy.h"
#include "d/actor/d_a_cstatue.h"
#include "d/actor/d_a_b_gm.h"
#include "f_op/f_op_camera_mng.h"
#include "d/d_msg_object.h"
#include "Z2AudioLib/Z2Instances.h"

enum E_gm_RES_File_ID {
    /* BCK */
    /* 0x5 */ BCK_GB_APPEAR = 0x5,
    /* 0x6 */ BCK_GB_DAMAGE,
    /* 0x7 */ BCK_GB_DEAD,
    /* 0x8 */ BCK_GB_MOVE,
    /* 0x9 */ BCK_GB_WAIT,

    /* BMDE */
    /* 0xC */ BMDE_GOMA_EGG = 0xC,

    /* BMDV */
    /* 0xF */ BMDV_GB = 0xF,
};

enum E_mg_RES_File_ID {
    /* BCK */
    /* 0x4 */ BCK_MD_DAMAGE = 0x4,
    /* 0x5 */ BCK_MD_DEATH,
    /* 0x6 */ BCK_MD_DEATH_PRESS,
    /* 0x7 */ BCK_MD_JUMP,
    /* 0x8 */ BCK_MD_PIKU,
    /* 0x9 */ BCK_MD_UP,
    /* 0xA */ BCK_MD_WALK,

    /* BMDV */
    /* 0xD */ BMDV_MD = 0xD,
};

enum Joint {
    /* 0x00 */ JNT_WORLD_ROOT,
    /* 0x01 */ JNT_BELLY,
    /* 0x02 */ JNT_HEAD,
    /* 0x03 */ JNT_AGOL,
    /* 0x04 */ JNT_AGOR,
    /* 0x05 */ JNT_LEGL1A,
    /* 0x06 */ JNT_LEGL1B,
    /* 0x07 */ JNT_LEGL1C,
    /* 0x08 */ JNT_LEGL2A,
    /* 0x09 */ JNT_LEGL2B,
    /* 0x0A */ JNT_LEGL2C,
    /* 0x0B */ JNT_LEGR1A,
    /* 0x0C */ JNT_LEGR1B,
    /* 0x0D */ JNT_LEGR1C,
    /* 0x0E */ JNT_LEGR2A,
    /* 0x0F */ JNT_LEGR2B,
    /* 0x10 */ JNT_LEGR2C,
};

enum Type {
    /* 0x0 */ TYPE_0,
    /* 0x1 */ TYPE_1,
    /* 0x2 */ TYPE_NORMAL,
    /* 0x3 */ TYPE_GOMA,
};

class daE_GM_HIO_c {
public:
    daE_GM_HIO_c();
    virtual ~daE_GM_HIO_c() {}

    /* 子ゴーマ - Baby Ghoma */
    /* 0x04 */ s8 id;
    /* 0x08 */ f32 model_size;
    /* 0x0C */ f32 basic_speed;
    /* 0x10 */ f32 max_acceleration;

    /* ダンジョン用子ゴーマ - Dungeon Baby Ghoma */
    /* 0x14 */ f32 escape_speed;
    /* 0x18 */ f32 player_run_pursuit_speed;
    /* 0x1C */ f32 player_walk_pursuit_speed;
    /* 0x20 */ f32 player_search_y_limit;

    /* 0x24 */ s16 min_acceleration_cycle;
};

namespace {
    /* 806D7B34-806D7B38 000038 0004+00 2/3 0/0 0/0 .data l_hitActorID__22@unnamed@d_a_e_gm_cpp@ */
    static fpc_ProcID l_hitActorID = fpcM_ERROR_PROCESS_ID_e;

    /* 806D7B38-806D7B3C 00003C 0004+00 2/4 0/0 0/0 .data l_coreActorID__22@unnamed@d_a_e_gm_cpp@ */
    static fpc_ProcID l_coreActorID = fpcM_ERROR_PROCESS_ID_e;

    /* 806D7B3C-806D7B7C 000040 0040+00 0/1 0/0 0/0 .data cc_sph_src__22@unnamed@d_a_e_gm_cpp@ */
    static dCcD_SrcSph cc_sph_src = {
        {
            {0x0, {{AT_TYPE_CSTATUE_SWING, 0x1, 0xD}, {0xDAFBFDFF, 0x3}, 0x75}},
            {dCcD_SE_HARD_BODY, 0, 0, 0, 0},
            {dCcD_SE_NONE, 0, 0, 0, 2},
            {0x0},
        },
        {
            {{0.0f, 0.0f, 0.0f}, 30.0f},
        }
    };
} // namespace

daE_GM_HIO_c::daE_GM_HIO_c() {
    id = -1;
    model_size = 1.3f;
    basic_speed = 8.0f;
    max_acceleration = 10.0f;
    min_acceleration_cycle = 0x380;
    escape_speed = 20.0f;
