/**
 * @file d_a_npc_ks.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_npc_ks.h"
#include "d/actor/d_a_obj_kago.h"
#include "d/d_camera.h"
#include "d/d_com_inf_game.h"
#include "d/d_bomb.h"
#include "d/actor/d_a_boomerang.h"
#include "d/actor/d_a_obj_pillar.h"
#include "c/c_damagereaction.h"
#include "d/actor/d_a_e_fs.h"
#include "d/actor/d_a_obj_brg.h"
#include "d/actor/d_a_midna.h"
#include "d/d_meter2_info.h"
#include "d/actor/d_a_e_oc.h"
#include "Z2AudioLib/Z2Instances.h"
#include "d/d_s_play.h"
#include "f_op/f_op_camera_mng.h"

class daNpc_Ks_HIO_c : public JORReflexible {
public:
    daNpc_Ks_HIO_c();
    virtual ~daNpc_Ks_HIO_c() {};

    void genMessage(JORMContext*);

    /* 0x04 */ s8 no;
    /* 0x08 */ f32 basic_size;
    /* 0x0C */ f32 pull_distance;
    /* 0x10 */ f32 holding_speed_l;
    /* 0x14 */ f32 holding_speed_h;
    /* 0x18 */ f32 demo_speed;
    /* 0x1C */ f32 demo_speed_2;
    /* 0x20 */ f32 guided_movement_speed;
    /* 0x24 */ f32 field_0x24;  // unused
    /* 0x28 */ u8 field_0x28;   // unused
    /* 0x2C */ f32 lantern_swing_interval;
    /* 0x30 */ f32 link_approach_distance;
    /* 0x34 */ f32 lantern_size;
};

struct path {
    int field_0x0;
    f32 field_0x4;
    f32 field_0x8;
    f32 field_0xc;
    u32 field_0x10;
    u32 field_0x14;
    u32 field_0x18;
    u32 field_0x1c;
    u32 field_0x20;
    u32 field_0x24;
    u32 field_0x28;
    u32 field_0x2c;
    u32 field_0x30;
};

daNpc_Ks_HIO_c::daNpc_Ks_HIO_c() {
    no = -1;
    basic_size = 0.8f;
    pull_distance = 200.0f;
    holding_speed_l = 10.0f;
    holding_speed_h = 25.0f;
    demo_speed = 20.0f;
    demo_speed_2 = 25.0f;
    guided_movement_speed = 10.0f;
    link_approach_distance = 300.0f;
    lantern_size = 1.8f;
    field_0x24 = 600.0f;    // unused
    field_0x28 = 1;         // unused
    lantern_swing_interval = 10.0f;
}

#if DEBUG
void daNpc_Ks_HIO_c::genMessage(JORMContext* ctext) {
    // little monkey
    ctext->genLabel("　小猿　", 0x80000001, 0, NULL, -1, -1, 0x200, 0x18);
    ctext->genLabel("       　", 0x80000001, 0, NULL, -1, -1, 0x200, 0x18);
