/**
 * @file d_a_e_rd.cpp
 * 
*/

#include "d/dolzel_rel.h"

#include "d/actor/d_a_e_rd.h"
#include "d/d_cc_d.h"
#include "d/d_com_inf_game.h"
#include "d/d_camera.h"
#include "m_Do/m_Do_graphic.h"
#include "d/d_bomb.h"
#include "d/actor/d_a_e_wb.h"
#include "d/d_msg_object.h"
#include "c/c_damagereaction.h"
#include "d/d_attention.h"
#include "d/actor/d_a_obj_h_saku.h"
#include "f_op/f_op_kankyo_mng.h"
#include "d/actor/d_a_e_rdb.h"
#include "d/actor/d_a_e_dn.h"
#include "d/actor/d_a_e_arrow.h"
#include "d/actor/d_a_npc_tk.h"
#include "Z2AudioLib/Z2Instances.h"
#include "f_op/f_op_actor_enemy.h"

class daE_RD_HIO_c : public JORReflexible {
public:
    /* 80504A6C */ daE_RD_HIO_c();
    /* 8051801C */ virtual ~daE_RD_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x00 */ s8 field_0x4;

    /* ライダー (Rider) */
    /* 0x08 */ f32 model_size;              // 基本サイズ          (Basic size)
    /* 0x0C */ f32 field_0xc;               // リーダーサイズ比     (Leader size ratio)
    /* 0x10 */ f32 movement_speed;          // 移動速度            (Movement speed)

    /*   こん棒兵の場合   (In the case of the club soldier) */
    /* 0x14 */ f32 dash_speed;              // 突進速度            (Rush speed)
    /* 0x18 */ f32 battle_init_range;       // 戦闘開始範囲         (Battle starting range)
    /* 0x1C */ f32 attack_init_range;       // 攻撃開始範囲         (Attack starting range)
    /* 0x20 */ f32 swing_speed;             // 振り速さ            (Swing speed)

    /*   矢兵の場合   (In the case of arrow soldiers) */
    /* 0x24 */ s16 field_0x24;              // 号令→構えの間        (Command → Preparation)
    /* 0x26 */ u8 padding[2];
    /* 0x28 */ f32 attack_range;            // 攻撃範囲            (Attack range)
    /* 0x2C */ f32 mounted_launch_distance; // 騎乗発射距離         (Mounted launch distance)
    /* 0x30 */ f32 wolf_falling_power_y;    // 狼倒れ力Y           (Wolf falling power Y)
    /* 0x34 */ f32 wolf_falling_power_z;    // 狼倒れ力Z           (Wolf falling power Z)

    /* 0x38 */ u8 field_0x38;
    /* 0x39 */ u8 invulnerable;             // 不死身              (Invulnerability)
    /* 0x3A */ u8 eye_polygon;              // 目ポリゴン          (Eye polygon)
    /* 0x3B */ u8 one_hit_kill;             // 一撃必殺            (One hit kill)
    /* 0x3C */ f32 field_0x3c;              // 一騎（ダ）サイズ     (One-man army (Da) size)
    /* 0x40 */ f32 jump_g;                  // 飛びＧ              (Jump G)
    /* 0x44 */ f32 jump_z;                  // 飛びＺ              (Jump Z)
    /* 0x48 */ f32 field_0x48;              // 飛びＺ（騎乗停止）   (Jump Z (Stop riding))
    /* 0x4C */ f32 jump_y;                  // 飛びＹ              (Jump Y)
};

enum E_RD_RES_FILE_ID {
    /* BCK */
    /* 0x04 */ BCK_RD_ARMAMENT = 4,
    /* 0x05 */ BCK_RD_ATTACK01,
    /* 0x06 */ BCK_RD_AVOID,
    /* 0x07 */ BCK_RD_BOW_READY,
    /* 0x08 */ BCK_RD_BOW_RREADY,
    /* 0x09 */ BCK_RD_BOW_RSHOOT,
    /* 0x0A */ BCK_RD_BOW_SHOOT,
    /* 0x0B */ BCK_RD_DAMAGE_L,
    /* 0x0C */ BCK_RD_DAMAGE_R,
    /* 0x0D */ BCK_RD_DAMAGE_S,
    /* 0x0E */ BCK_RD_DAMAGE_W,
    /* 0x0F */ BCK_RD_DEAD_ARROW,
    /* 0x10 */ BCK_RD_DIEA,
    /* 0x11 */ BCK_RD_DIEA_UP,
    /* 0x12 */ BCK_RD_DIEB,
    /* 0x13 */ BCK_RD_DIEB_UP,
    /* 0x14 */ BCK_RD_DROWNEDA,
    /* 0x15 */ BCK_RD_DROWNEDB,
    /* 0x16 */ BCK_RD_FURA2,            // (Fura = Onomatopoeia for dizziness)
    /* 0x17 */ BCK_RD_GOSIGN,
    /* 0x18 */ BCK_RD_JUMP_A,
    /* 0x19 */ BCK_RD_JUMP_B,
    /* 0x1A */ BCK_RD_JUMP_C,
    /* 0x1B */ BCK_RD_KAMAE,            // (Kamae = Stance)
    /* 0x1C */ BCK_RD_KICK,
