/**
 * @file d_a_b_gg.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_b_gg.h"
#include "d/d_com_inf_game.h"
#include "c/c_damagereaction.h"
#include "m_Do/m_Do_graphic.h"
#include "Z2AudioLib/Z2Instances.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"

class daB_GG_HIO_c : public JORReflexible {
public:
    daB_GG_HIO_c();
    virtual ~daB_GG_HIO_c() {}
    void genMessage(JORMContext*) {}

    /* 0x04 */ s8 id;
    /* 0x08 */ f32 base_size;
    /* 0x0C */ s16 takeoff_time;
    /* 0x0E */ s16 fly_attack_wait_time;
    /* 0x10 */ f32 fly_attack_speed;
    /* 0x14 */ s16 takeoff2_time;
    /* 0x16 */ s16 max_hp;
    /* 0x18 */ f32 field_0x18;
};

enum daE_GG_TYPE {
    TYPE_L7_MBOSS = 0,
    TYPE_L7_W = 1,
    TYPE_L7_M = 2,
    TYPE_HYRULE_CASTLE = 3,
    TYPE_CAVE = 4,

    TYPE_DEFAULT = 0xFF,
};

enum daE_GG_ACTION {
    ACTION_FLY,
    ACTION_GROUND,
    ACTION_F_A,
    ACTION_DEMO,
    ACTION_STOP,
};

enum {
    SUBACT_WAIT   = 0,
    SUBACT_MOVE   = 1,
    SUBACT_ATTACK = 2,
    SUBACT_DAMAGE = 3,
    SUBACT_DEATH  = 4,

    // DEMO
    SUBACT_DEMO_ST = 0,
    SUBACT_DEMO_MD = 1,
    SUBACT_DEMO_GN = 2,
};

enum B_GG_RES_FILE_ID {
    /* BCK */
    /* 0x04 */ BCK_GGA_ATTACK_1 = 4,
    /* 0x05 */ BCK_GGA_ATTACK_2,
    /* 0x06 */ BCK_GGA_ATTACK_3,
    /* 0x07 */ BCK_GGA_ATTACK_4,
    /* 0x08 */ BCK_GGA_FS_HIT,
    /* 0x09 */ BCK_GGA_FS_OFF,
    /* 0x0A */ BCK_GGA_GUARD,
    /* 0x0B */ BCK_GGA_PREPARATION,
    /* 0x0C */ BCK_GGA_PULL,
    /* 0x0D */ BCK_GGA_SHOUT,
    /* 0x0E */ BCK_GGA_WAIT,
    /* 0x0F */ BCK_GGB_ATTACK_A,
    /* 0x10 */ BCK_GGB_ATTACK_B,
