/**
 * @file d_a_kago.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_kago.h"
#include "d/d_camera.h"
#include "d/d_com_inf_game.h"
#include "d/d_msg_object.h"

#include <cmath>
#include <cstring>

#include "d/actor/d_a_balloon_2D.h"
#include "d/actor/d_a_e_ym.h"
#include "d/actor/d_a_midna.h"
#include "d/actor/d_a_obj_balloon.h"
#include "d/actor/d_a_obj_riverrock.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_tag_waterfall.h"
#include "f_op/f_op_camera_mng.h"
#include "f_op/f_op_overlap_mng.h"

#include "res/Object/E_yc.h"
#include "res/Object/E_kc.h"

#define TYPE_TWILIGHT 0
#define TYPE_NORMAL   1

#define SCENE_TYPE_LAKE_HYLIA  0
#define SCENE_TYPE_RIVER       1
#define SCENE_TYPE_BOARD_HOUSE 2
#define SCENE_TYPE_DEFAULT     3
namespace {
static dCcD_SrcSph cc_sph_src = {
    {
        {0x0, {{0x8, 0x0, 0x12}, {0x0, 0x0}, 0x0}}, // mObj
        {dCcD_SE_METAL, 0x0, 0x0, 0x0, 0x0}, // mGObjAt
        {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x0}, // mGObjTg
        {0x0}, // mGObjCo
    }, // mObjInf
    {
            {{0.0f, 0.0f, 0.0f}, 80.0f} // mSph
    } // mSphAttr
};
};  // namespace

class daKago_HIO_c : public JORReflexible {
public:
    daKago_HIO_c();
    virtual ~daKago_HIO_c() {}

    void genMessage(JORMContext* ctx);

    /* 0x04 */ s8 mChild;
    /* 0x08 */ f32 mRevoconUpDown;
    /* 0x0C */ f32 mRevoconUpDownMax;
    /* 0x10 */ f32 mRevoconLeftRight;
    /* 0x14 */ f32 mRevoconLeftRightMax;
    /* 0x18 */ f32 mBasicSize;
    /* 0x1C */ f32 mFlightSpeed;
    /* 0x20 */ f32 mFlightGroundAltitude;
    /* 0x24 */ f32 mFlightCeilingAltitude;
    /* 0x28 */ f32 mShadowDensity;
    /* 0x2C */ f32 mDescentRateIncrement;
    /* 0x30 */ f32 mAscentRateDecel;
    /* 0x34 */ f32 mDashTime;
    /* 0x38 */ f32 mDashTimeMultiplier;
    /* 0x3C */ f32 mWallHitInvulnTime;
    /* 0x40 */ f32 mDashCooldownTime;
    /* 0x44 */ f32 mZOffset;
    /* 0x48 */ f32 mZOffsetHori;
    /* 0x4C */ u8 mAngleTrackingMode;
    /* 0x50 */ f32 mYOffsetFromWaterSurface;
    /* 0x54 */ f32 mWaterSplashTime;
    /* 0x58 */ f32 mSplashGenTimeDuringDash;
};

daKago_HIO_c::daKago_HIO_c() {
    mChild = -1;
    mRevoconUpDown = 1024.0f;
    mRevoconUpDownMax = 512.0f;
    mRevoconLeftRight = 256.0f;
    mRevoconLeftRightMax = 256.0f;
    mBasicSize = 1.0f;
    mFlightSpeed = 50.0f;
    mDashTime = 70.0f;
    mDashTimeMultiplier = 1.0f;
    mWallHitInvulnTime = 90.0f;
    mDescentRateIncrement = 5.0f;
    mAscentRateDecel = 5.0f;
    mFlightGroundAltitude = 300.0f;
    mFlightCeilingAltitude = 300.0f;
    mShadowDensity = 3.0f;
    mDashCooldownTime = 85.0f;
    mZOffset = 700.0f;
    mZOffsetHori = 200.0f;
    mAngleTrackingMode = 1;
    mYOffsetFromWaterSurface = 0.0f;
    mWaterSplashTime = 5.0f;
    mSplashGenTimeDuringDash = 10.0f;
}

#if DEBUG
void daKago_HIO_c::genMessage(JORMContext* ctx) {
    // friendly Kargarok (literally, "Kargarok (good guy)")
    ctx->genLabel("カーゴロック（いい奴）", 0x80000001);
    ctx->genLabel(" ", 0x80000001);
    ctx->genLabel(" ", 0x80000001);
