/**
 * @file d_a_e_rdy.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_rdy.h"
#include "Z2AudioLib/Z2Instances.h"
#include "d/actor/d_a_e_arrow.h"
#include "d/actor/d_a_e_yc.h"
#include "d/actor/d_a_horse.h"
#include "d/actor/d_a_kago.h"
#include "d/d_bomb.h"
#include "d/d_cc_d.h"
#include "d/d_msg_object.h"
#include "d/d_camera.h"
#include "f_op/f_op_camera_mng.h"
#include "f_op/f_op_kankyo_mng.h"
#include "f_op/f_op_actor_enemy.h"
#include "m_Do/m_Do_graphic.h"

class daE_RDY_HIO_c : public JORReflexible {
public:
    daE_RDY_HIO_c();
    virtual ~daE_RDY_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 mScale;
    /* 0x0C */ f32 field_0xc;
    /* 0x10 */ f32 mWalkSpeed;
    /* 0x14 */ f32 mRunSpeed;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 field_0x1c;
    /* 0x20 */ f32 mAttackAnmSpeed;
    /* 0x24 */ s16 field_0x24;
    /* 0x28 */ f32 field_0x28;
    /* 0x2C */ f32 field_0x2c;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ f32 field_0x34;
    /* 0x38 */ u8 field_0x38;
    /* 0x39 */ u8 field_0x39;
    /* 0x3A */ u8 mDrawEyeModel;
    /* 0x3B */ u8 field_0x3b;
    /* 0x3C */ f32 field_0x3c;
    /* 0x40 */ f32 field_0x40;
    /* 0x44 */ f32 field_0x44;
    /* 0x48 */ f32 field_0x48;
    /* 0x4C */ f32 field_0x4c;
};

STATIC_ASSERT(sizeof(daE_RDY_HIO_c) == 0x50);

enum Action {
    /* 0x00 */ ACT_NORMAL,
    /* 0x03 */ ACT_FIGHT_RUN = 3,
    /* 0x04 */ ACT_FIGHT,
    /* 0x05 */ ACT_BOW_RUN,
    /* 0x06 */ ACT_BOW,
    /* 0x07 */ ACT_BOW2,
    /* 0x09 */ ACT_BOW_IKKI2 = 9,
    /* 0x0A */ ACT_AVOID,
    /* 0x13 */ ACT_BOMB_ACTION = 0x13,
    /* 0x14 */ ACT_S_DAMAGE,
    /* 0x15 */ ACT_DAMAGE,
    /* 0x16 */ ACT_DROP,
    /* 0x17 */ ACT_A_DAMAGE,
    /* 0x18 */ ACT_STAND,
    /* 0x19 */ ACT_COMMANDER,
    /* 0x1A */ ACT_BOW3,
    /* 0x1B */ ACT_EXCITE,
    /* 0x1D */ ACT_WATER = 0x1D,
    /* 0x1E */ ACT_TKUSA,
    /* 0x20 */ ACT_YC_RIDE = 0x20,
    /* 0x33 */ ACT_JYUNKAI = 0x33,
};

enum Animation {
    /* 0x04 */ ANM_ARMAMENT = 4,
    /* 0x05 */ ANM_ATTACK01,
    /* 0x06 */ ANM_AVOID,
    /* 0x07 */ ANM_BLOW,
    /* 0x08 */ ANM_BOW_READY,
    /* 0x09 */ ANM_BOW_RREADY,
    /* 0x0A */ ANM_BOW_RSHOOT,
    /* 0x0B */ ANM_BOW_SHOOT,
    /* 0x0C */ ANM_DAMAGE_L,
