/**
 * @file d_a_e_vt.cpp
 * Variant Enemy (Death Sword)
 */

#include "d/dolzel_rel.h"

#include "d/actor/d_a_e_vt.h"
#include "JSystem/J3DGraphBase/J3DMaterial.h"
#include "SSystem/SComponent/c_math.h"
#include "c/c_damagereaction.h"
#include "cmath.h"
#include "d/actor/d_a_player.h"
#include "d/d_com_inf_game.h"
#include "d/d_s_play.h"
#include "d/d_camera.h"
#include "f_op/f_op_actor_enemy.h"

#define WL_CUT_TYPE_SMALL 1
#define WL_CUT_TYPE_JUMP 2
#define WL_CUT_TYPE_LARGE 3

class daE_VA_HIO_c {
public:
    /* 807C25EC */ daE_VA_HIO_c();
    /* 807CE2AC */ virtual ~daE_VA_HIO_c() {}

    /* 0x04 */ s8 field_0x04;
    /* 0x08 */ f32 mModelSize;
    /* 0x0C */ f32 mAttackRange;
    /* 0x10 */ f32 mBiteCount;
    /* 0x14 */ f32 mCircleAttackRadius;
    /* 0x18 */ f32 mFadeAwayTime;
    /* 0x1C */ f32 mDownTime;
    /* 0x20 */ f32 mDownHP;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ f32 field_0x28;
    /* 0x2C */ f32 field_0x2c;
    /* 0x30 */ f32 mKRegLightR;
    /* 0x34 */ f32 mKRegLightG;
    /* 0x38 */ f32 mKRegLightB;
    /* 0x3C */ f32 mKRegLightA;
};

enum daE_VA_JOINT {
    JNT_ROOT,
    JNT_BACKBONE_01,
    JNT_BACKBONE_02,
    JNT_ARM_L01,
    JNT_ARM_L02,
    JNT_ARM_L03,
    JNT_ARM_L04,
    JNT_ARM_L05,
    JNT_FINGER_LB,
    JNT_FINGER_LC,
    JNT_FINGER_LA,
    JNT_LEFT_COTH_01,
    JNT_LEFT_COTH_02,
    JNT_LEFT_COTH_03,
    JNT_LEFT_COTH_04,
    JNT_ARM_R01,
    JNT_ARM_R02,
    JNT_ARM_R03,
    JNT_ARM_R04,
    JNT_ARM_R05,
    JNT_FINGER_RB,
    JNT_FINGER_RC,
    JNT_KEN_1,
    JNT_KEN_2,
    JNT_FINGER_RA,
    JNT_BUST,
    JNT_NECK_CLOTH,
    JNT_NECK_01,
    JNT_HEAD_CLOTH_01,
    JNT_HEAD_CLOTH_02,
    JNT_HEAD_CLOTH_03,
    JNT_HEAD_CLOTH_04,
    JNT_HEAD_CLOTH_05,
    JNT_NECK_02,
    JNT_HEAD,
    JNT_JOE,
    JNT_WAIST,
    JNT_BACK_CLOTH_01,
    JNT_BACK_CLOTH_02,
    JNT_BACK_CLOTH_03,
    JNT_FRONT_CLOTH_01,
    JNT_FRONT_CLOTH_02,
    JNT_FRONT_CLOTH_03,
    JNT_LEG_L01,
    JNT_LEG_L02,
    JNT_LEG_L03,
    JNT_LEG_R01,
    JNT_LEG_R02,
    JNT_LEG_R03,
