/**
 * @file d_a_e_gob.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_gob.h"
#include "d/d_com_inf_game.h"
#include "d/d_com_inf_actor.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_obj_msima.h"
#include "d/actor/d_a_obj_myogan.h"
#include "d/d_s_play.h"
#include "f_op/f_op_camera_mng.h"
#include "m_Do/m_Do_graphic.h"
#include "c/c_damagereaction.h"
#include "Z2AudioLib/Z2Instances.h"

class daE_GOB_HIO_c : public JORReflexible {
public:
    daE_GOB_HIO_c();

    void genMessage(JORMContext*);
    virtual ~daE_GOB_HIO_c() {}

    /* 0x04 */ s8 id;
    /* 0x08 */ f32 size;
    /* 0x0C */ f32 normal_walk_speed;
    /* 0x10 */ f32 battle_walk_speed;
    /* 0x14 */ f32 roll_speed;
    /* 0x18 */ s16 rotation_speed;
    /* 0x1A */ s16 swing_time_a;
    /* 0x1C */ s16 swing_time_b;
};

enum E_gob_RES_file_ID {
    /* BCK */
    /* 0x04 */ BCK_MG_ATTACK_A_A = 0x4,
    /* 0x05 */ BCK_MG_ATTACK_A_B,
    /* 0x06 */ BCK_MG_ATTACK_A_C,
    /* 0x07 */ BCK_MG_ATTACK_B_A,
    /* 0x08 */ BCK_MG_ATTACK_B_B,
    /* 0x09 */ BCK_MG_ATTACK_B_C,
    /* 0x0A */ BCK_MG_BALL,
    /* 0x0B */ BCK_MG_CUR,
    /* 0x0C */ BCK_MG_DAMAGE_L,
    /* 0x0D */ BCK_MG_DAMAGE_R,
    /* 0x0E */ BCK_MG_DEFENSE_A,
    /* 0x0F */ BCK_MG_DEFENSE_B,
    /* 0x10 */ BCK_MG_DEFENSE_C,
    /* 0x11 */ BCK_MG_DE_GETUP,
    /* 0x12 */ BCK_MG_DE_GETUPWAIT,
    /* 0x13 */ BCK_MG_DE_JUMP_A,
    /* 0x14 */ BCK_MG_DE_JUMP_B,
    /* 0x15 */ BCK_MG_DE_LANDING,
    /* 0x16 */ BCK_MG_DE_SITWAIT,
    /* 0x17 */ BCK_MG_DE_STANDUP_ED,
    /* 0x18 */ BCK_MG_DE_STANDUP_ST,
    /* 0x19 */ BCK_MG_DE_TALK_ST,
    /* 0x1A */ BCK_MG_EXCITE,
    /* 0x1B */ BCK_MG_FIRE,
    /* 0x1C */ BCK_MG_HOLD,
    /* 0x1D */ BCK_MG_LANDING,
    /* 0x1E */ BCK_MG_N_STEP,
    /* 0x1F */ BCK_MG_N_TALK,
