/**
 * @file d_a_b_mgn.cpp
 *
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_b_mgn.h"
#include "d/actor/d_a_obj_bhashi.h"
#include "d/d_camera.h"
#include "f_op/f_op_camera_mng.h"
#include "f_op/f_op_msg_mng.h"
#include "m_Do/m_Do_graphic.h"
#include "f_op/f_op_actor_enemy.h"

enum B_MGN_RES_FILE_ID {
    /* BCK */
    /* 0x06 */ BCK_MGN_APPROACH = 6,
    /* 0x07 */ BCK_MGN_BACKJUMP,
    /* 0x08 */ BCK_MGN_BLOW,
    /* 0x09 */ BCK_MGN_DASH,
    /* 0x0A */ BCK_MGN_DASH_JUMP,
    /* 0x0B */ BCK_MGN_DOWNL,
    /* 0x0C */ BCK_MGN_DOWNL_DAMAGE,
    /* 0x0D */ BCK_MGN_DOWNL_LOOP,
    /* 0x0E */ BCK_MGN_DOWNL_UP,
    /* 0x0F */ BCK_MGN_DOWNL_UPA,
    /* 0x10 */ BCK_MGN_DOWNL_UPB,
    /* 0x11 */ BCK_MGN_DOWNL_WAIT,
    /* 0x12 */ BCK_MGN_DOWNR,
    /* 0x13 */ BCK_MGN_DOWNR_DAMAGE,
    /* 0x14 */ BCK_MGN_DOWNR_LOOP,
    /* 0x15 */ BCK_MGN_DOWNR_UPA,
    /* 0x16 */ BCK_MGN_DOWNR_UPB,
    /* 0x17 */ BCK_MGN_DOWNR_WAIT,
    /* 0x18 */ BCK_MGN_DROP,
    /* 0x19 */ BCK_MGN_DROP_POSE,
    /* 0x1A */ BCK_MGN_END_DEMO,
    /* 0x1B */ BCK_MGN_MDCATCHED,
    /* 0x1C */ BCK_MGN_MDCATCHST,
    /* 0x1D */ BCK_MGN_MDTHROWLED,
    /* 0x1E */ BCK_MGN_MDTHROWLST,
    /* 0x1F */ BCK_MGN_MDTHROWRED,
    /* 0x20 */ BCK_MGN_MDTHROWRST,
    /* 0x21 */ BCK_MGN_OP,
    /* 0x22 */ BCK_MGN_SIDESLIPL,
    /* 0x23 */ BCK_MGN_SIDESLIPR,
    /* 0x24 */ BCK_MGN_STEP,
    /* 0x25 */ BCK_MGN_WAIT,
    /* 0x26 */ BCK_MGN_WAIT2,
    /* 0x27 */ BCK_WL_MGNCATCHED,
    /* 0x28 */ BCK_WL_MGNCATCHST,
    /* 0x29 */ BCK_WL_MGNTHROWLED,
    /* 0x2A */ BCK_WL_MGNTHROWLST,
    /* 0x2B */ BCK_WL_MGNTHROWRED,
    /* 0x2C */ BCK_WL_MGNTHROWRST,

    /* BMDR */
    /* 0x2F */ BMDR_MGN = 0x2F,
    /* 0X30 */ BMDR_MGN_TAIEKI,

    /* BRK */
    /* 0x33 */ BRK_MGN_CORE = 0x33,
    /* 0x34 */ BRK_MGN_CORE_BEAT,
    /* 0x35 */ BRK_MGN_END_DEMO,
    /* 0x36 */ BRK_MGN_OP_DEMO,

    /* BTK */
    /* 0x39 */ BTK_MGN_DASH_JUMP = 0x39,
    /* 0x3A */ BTK_MGN_DROP,
    /* 0x3B */ BTK_MGN_END_DEMO,
    /* 0x3C */ BTK_MGN_ENTER,
    /* 0x3D */ BTK_MGN_EXIT,
};

enum B_MGNE_RES_FILE_ID {
    /* BCK */
    /* 0x06 */ BCK_EF_GDGATE_START = 6,

    /* BMDR */
    /* 0x09 */ BMDR_EF_GDGATE = 9,

    /* BRK */
    /* 0x0C */ BRK_EF_GDGATE_APPEAR = 12,
    /* 0x0D */ BRK_EF_GDGATE_START,

    /* BTK */
    /* 0x10 */ BTK_EF_GDGATE = 16,
};

enum Joint {
    /* 0x00 */ JNT_WORLD_ROOT,
    /* 0x01 */ JNT_BACKBONE1,
    /* 0x02 */ JNT_BACKBONE2,
    /* 0x03 */ JNT_HAIRA1,
    /* 0x04 */ JNT_HAIRA2,
    /* 0x05 */ JNT_HAIRBL1,
    /* 0x06 */ JNT_HAIRBL2,
    /* 0x07 */ JNT_HAIRBR1,
    /* 0x08 */ JNT_HAIRBR2,
    /* 0x09 */ JNT_HAIRCL1,
    /* 0x0A */ JNT_HAIRCL2,
    /* 0x0B */ JNT_HAIRCR1,
    /* 0x0C */ JNT_HAIRCR2,
    /* 0x0D */ JNT_HAIRDL1,
    /* 0x0E */ JNT_HAIRDL2,
    /* 0x0F */ JNT_HAIRDL3,
    /* 0x10 */ JNT_HAIRDR1,
    /* 0x11 */ JNT_HAIRDR2,
    /* 0x12 */ JNT_HAIRDR3,
    /* 0x13 */ JNT_HAIREL1,
    /* 0x14 */ JNT_HAIREL2,
    /* 0x15 */ JNT_HAIREL3,
    /* 0x16 */ JNT_HAIRER1,
    /* 0x17 */ JNT_HAIRER2,
    /* 0x18 */ JNT_HAIRER3,
    /* 0x19 */ JNT_NECK,
    /* 0x1A */ JNT_BEARD,
    /* 0x1B */ JNT_HEAD,
    /* 0x1C */ JNT_CHIN,
    /* 0x1D */ JNT_TANGE,
    /* 0x1E */ JNT_EARL,
    /* 0x1F */ JNT_EARR,
    /* 0x20 */ JNT_NOSE,
    /* 0x21 */ JNT_SHOULDEL,
    /* 0x22 */ JNT_ARML1,
    /* 0x23 */ JNT_ARML2,
    /* 0x24 */ JNT_FURL,
    /* 0x25 */ JNT_HANDL,
    /* 0x26 */ JNT_FINGAL1,
    /* 0x27 */ JNT_FINGAL2,
    /* 0x28 */ JNT_FINGBL1,
    /* 0x29 */ JNT_FINGBL2,
    /* 0x2A */ JNT_FINGCL1,
    /* 0x2B */ JNT_FINGCL2,
    /* 0x2C */ JNT_FINGDL1,
    /* 0x2D */ JNT_FINGDL2,
    /* 0x2E */ JNT_FINGEL1,
    /* 0x2F */ JNT_FINGEL2,
    /* 0x30 */ JNT_SHOULDER,
    /* 0x31 */ JNT_ARMR1,
    /* 0x32 */ JNT_ARMR2,
    /* 0x33 */ JNT_FURR,
    /* 0x34 */ JNT_HANDR,
    /* 0x35 */ JNT_FINGAR1,
    /* 0x36 */ JNT_FINGAR2,
    /* 0x37 */ JNT_FINGBR1,
    /* 0x38 */ JNT_FINGBR2,
    /* 0x39 */ JNT_FINGCR1,
    /* 0x3A */ JNT_FINGCR2,
    /* 0x3B */ JNT_FINGDR1,
    /* 0x3C */ JNT_FINGDR2,
    /* 0x3D */ JNT_FINGER1,
    /* 0x3E */ JNT_FINGER2,
    /* 0x3F */ JNT_WAIST,
    /* 0x40 */ JNT_LEGL1,
    /* 0x41 */ JNT_LEGL2,
    /* 0x42 */ JNT_LEGL3,
    /* 0x43 */ JNT_FOOTL,
    /* 0x44 */ JNT_LEGR1,
    /* 0x45 */ JNT_LEGR2,
    /* 0x46 */ JNT_LEGR3,
    /* 0x47 */ JNT_FOOTR,
    /* 0x48 */ JNT_TAIL1,
    /* 0x49 */ JNT_TAIL2,
    /* 0x4A */ JNT_TAIL3,
    /* 0x4B */ JNT_TAIL4,
};

class daB_MGN_HIO_c : public JORReflexible {
public:
    daB_MGN_HIO_c();
    virtual ~daB_MGN_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 no;
    /* 0x08 */ f32 base_size;
    /* 0x0C */ f32 dash_speed;
    /* 0x10 */ f32 turn_speed;
    /* 0x14 */ f32 dash_anim;
    /* 0x18 */ f32 jewel_R;
    /* 0x1C */ f32 jewel_G;
    /* 0x20 */ f32 jewel_B;
};

daB_MGN_HIO_c::daB_MGN_HIO_c() {
    no = -1;
    base_size = 1.2f;
    dash_speed = 50.0f;
    turn_speed = 70.0f;
    dash_anim = 1.0f;
    jewel_R = 100.0f;
    jewel_G = 100.0f;
    jewel_B = 100.0f;
}

#if DEBUG
void daB_MGN_HIO_c::genMessage(JORMContext* ctx) {
    ctx->genLabel("  豚ガノン", 0x80000001, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("基本サイズ", &base_size, 0.0f, 5.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("ダッシュ速度", &dash_speed, 0.0f, 100.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("旋回速度", &turn_speed, 0.0f, 100.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("ダッシュアニメ", &dash_anim, 0.0f, 10.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("宝石R", &jewel_R, 0.0f, 100.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("宝石G", &jewel_G, 0.0f, 100.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
