/**
 * @file d_a_npc_ks.cpp
 * 
*/

#include "d/dolzel_rel.h"

#include "d/actor/d_a_npc_ks.h"
#include "d/actor/d_a_obj_kago.h"
#include "d/d_cc_d.h"
#include "d/d_camera.h"
#include "d/d_com_inf_game.h"
#include "d/d_bomb.h"
#include "d/actor/d_a_obj_so.h"
#include "d/actor/d_a_boomerang.h"
#include "d/d_stage.h"
#include "d/actor/d_a_obj_sw.h"
#include "d/actor/d_a_obj_pillar.h"
#include "m_Do/m_Do_controller_pad.h"
#include "c/c_damagereaction.h"
#include "d/actor/d_a_e_fs.h"
#include "d/actor/d_a_obj_brg.h"
#include "d/actor/d_a_midna.h"
#include "JSystem/JUtility/JUTReport.h"
#include "d/d_meter2_info.h"
#include "cmath.h"
#include "d/actor/d_a_e_oc.h"
#include "d/d_stage.h"
#include "Z2AudioLib/Z2Instances.h"
#include "d/d_s_play.h"

class daNpc_Ks_HIO_c : public JORReflexible {
public:
    /* 80A48F8C */ daNpc_Ks_HIO_c();
    /* 80A5DA90 */ virtual ~daNpc_Ks_HIO_c() {};

    void genMessage(JORMContext*);

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 field_0x8;
    /* 0x0C */ f32 field_0xc;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ f32 field_0x14;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 field_0x1c;
    /* 0x20 */ f32 field_0x20;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ u8 field_0x28;
    /* 0x2C */ f32 field_0x2c;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ f32 field_0x34;
};

/* 80A5E478-80A5E498 000020 0020+00 13/13 0/0 0/0 .data            saru_p */
static npc_ks_class* saru_p[8] = {
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
};

struct path {
    int field_0x0;
    f32 field_0x4;
    f32 field_0x8;
    f32 field_0xc;
    u32 field_0x10;
    u32 field_0x14;
    u32 field_0x18;
    u32 field_0x1c;
    u32 field_0x20;
    u32 field_0x24;
    u32 field_0x28;
    u32 field_0x2c;
    u32 field_0x30;
};

/* 80A48F8C-80A49000 0000EC 0074+00 1/1 0/0 0/0 .text            __ct__14daNpc_Ks_HIO_cFv */
daNpc_Ks_HIO_c::daNpc_Ks_HIO_c() {
    field_0x4 = -1;
    field_0x8 = 0.8f;
    field_0xc = 200.0f;
    field_0x10 = 10.0f;
    field_0x14 = 25.0f;
    field_0x18 = 20.0f;
    field_0x1c = 25.0f;
    field_0x20 = 10.0f;
    field_0x30 = 300.0f;
    field_0x34 = 1.8f;
    field_0x24 = 600.0f;
    field_0x28 = 1;
    field_0x2c = 10.0f;
}

