/**
 * @file d_a_obj_swchain.cpp
 *
*/

#include "d/dolzel_rel.h"  // IWYU pragma: keep

#if DEBUG
#include "d/d_debug_viewer.h"
#endif
#include "d/actor/d_a_obj_swchain.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"

#if DEBUG
class daObjSwChain_HIO_c : public mDoHIO_entry_c {
public:
    /* 811C8DE0 */ daObjSwChain_HIO_c();
    /* 811C8EE0 */ void genMessage(JORMContext*);

    /* 0x06 */ u8 field_0x06;
    /* 0x08 */ f32 mGravity;
    /* 0x0C */ f32 field_0xc;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ f32 field_0x14;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 mTension;
    /* 0x20 */ f32 mTensionBootsEquipped;
    /* 0x24 */ f32 mTensionWolf;
    /* 0x28 */ f32 mSwitchOnTension;
    /* 0x2C */ f32 field_0x2c;
    /* 0x30 */ f32 mReturnSpeed;
    /* 0x34 */ f32 mReturnSpeedHigh;
    /* 0x38 */ f32 mReturnSpeedLow;
    /* 0x3C */ s16 mReactionAngle;
    /* 0x3E */ s16 field_0x3e;
    /* 0x40 */ u8 mSwitchOnTime;
    /* 0x41 */ u8 field_0x41;
    /* 0x42 */ u8 field_0x42;
    /* 0x43 */ u8 mProcessStop;
    /* 0x44 */ u8 field_0x44;
    /* 0x45 */ u8 mReactionAngleDisplay;
};

daObjSwChain_HIO_c::daObjSwChain_HIO_c() {
    mGravity = -6.0f;
    field_0xc = 35.0f;
    field_0x10 = 35.0f;
    field_0x14 = 8.0f;
    field_0x18 = 0.0f;
    mTension = 15.0f;
    mTensionWolf = 13.0f;
    mTensionBootsEquipped = 2.1f;
    mSwitchOnTension = 10.0f;
    field_0x2c = 1.5f;
    mSwitchOnTime = 0;
    mReturnSpeedHigh = 30.0f;
    mReturnSpeedLow = 15.0;
    mReturnSpeed = 2.0;
    mReactionAngle = 0xe74;
    mReactionAngleDisplay = 0;
    field_0x3e = 0;
    field_0x41 = 0;
    field_0x42 = 0;
    mProcessStop = 0;
    field_0x44 = 0;
}

void daObjSwChain_HIO_c::genMessage(JORMContext* ctx) {
    // Chain Switch
    ctx->genLabel("チェーンスイッチ", 0, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    // Gravity
    ctx->genSlider("重力", &mGravity, -100.0f, -1.0f, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    // Tension
    ctx->genSlider("張力", &mTension, 0.0f, 20.0f, 0, NULL, 0xffff, 0xffff, 0x200, 0x18);
    // Tension (Boots Equipped)
