/**
 * @file d_a_obj_bemos.cpp
 *
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "SSystem/SComponent/c_lib.h"
#include "d/actor/d_a_obj_bemos.h"
#include "d/d_camera.h"
#include "d/d_cc_d.h"
#include "d/d_com_inf_game.h"
#if DEBUG
#include "d/d_debug_viewer.h"
#endif
#include "d/d_s_play.h"
#include "Z2AudioLib/Z2Instances.h"

static Vec const l_eye_offset = {0.0f, 330.0f, 75.0f};

static Vec const l_high_beam_offset = {0.0f, 255.0f, 65.0f};

static Vec const l_mid_beam_offset = {0.0f, 205.0f, 65.0f};

static Vec const l_low_beam_offset = {0.0f, 160.0f, 65.0f};

static Vec const l_craw_offset[4] = {
    {-95.0f, 0.0f, 0.0f},
    {95.0f, 0.0f, 0.0f},
    {0.0f, 0.0f, -95.0f},
    {0.0f, 0.0f, 95.0f},
};

s16 const daObjBm_c::M_dir_base[4] = {
    0x0000,
    0x4000,
    0x8000,
    0xC000,
};

#if DEBUG
class daObjBm_HIO_c : public mDoHIO_entry_c {
public:
    daObjBm_HIO_c();

    void genMessage(JORMContext*);

    /* 0x08 */ cXyz mBeamScale;
    /* 0x14 */ f32 mBeamLowerDistance;
    /* 0x18 */ f32 mBeamMiddleDistance;
    /* 0x1C */ f32 field_0x1C;
    /* 0x20 */ f32 mSearchDistance;
    /* 0x24 */ f32 mTargetOffsetDistance;
    /* 0x28 */ s16 mSearchAngle;
    /* 0x2A */ s16 mPatrolRotationSpeed;
    /* 0x0C */ s16 mAttackRotationSpeed;
    /* 0x2E */ s16 mNoSearchTimeAfterSwitchActivation;
    /* 0x30 */ s16 mDetectionAngle;
    /* 0x32 */ s16 mSearchSpeedOnDetection;
    /* 0x34 */ f32 mBodyScale;
    /* 0x38 */ f32 mSoundPositionMoveSpeed;
    /* 0x3C */ u8 mNoSearchAttackTime;
    /* 0x3D */ u8 mDebugDraw;
    /* 0x3E */ u8 mCheckDraw;
};

daObjBm_HIO_c l_HIO;

daObjBm_HIO_c::daObjBm_HIO_c() {
    mBeamScale.set(0.5f, 0.5f, 1.0f);
    mSearchDistance = 1000.0f;
    mSearchAngle = 30000;
    mPatrolRotationSpeed = 500;
    mAttackRotationSpeed = 450;
    mBeamLowerDistance = 300.0f;
    mBeamMiddleDistance = 600.0f;
    field_0x1C = 1000.0f;
    mTargetOffsetDistance = 0.0f;
    mNoSearchTimeAfterSwitchActivation = 20;
    mDetectionAngle = 25000;
    mSoundPositionMoveSpeed = 60.0f;
    mNoSearchAttackTime = 0;
    mSearchSpeedOnDetection = 1000;
    mBodyScale = 1.0f;
    mDebugDraw = 0;
    mCheckDraw = 0;
}

void daObjBm_HIO_c::genMessage(JORMContext* ctx) {
    ctx->genLabel("ビーモス", 0, 0, NULL, -1, -1, 512, 24);
    ctx->genCheckBox("デバッグ描画", &mDebugDraw, 1, 0, NULL, -1, -1, 512, 24);
    ctx->genSlider("サーチ距離", &mSearchDistance, 100.0f, 5000.0f, 0, NULL, -1, -1, 512, 24);
    ctx->genSlider("サーチ角度", &mSearchAngle, 0.0f, 32767.0f, 0, NULL, -1, -1, 512, 24);
