/**
* @file d_a_b_tn.cpp
 *
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_b_tn.h"
#include <cmath.h>
#include "Z2AudioLib/Z2Instances.h"
#include "d/actor/d_a_boomerang.h"
#include "d/actor/d_a_nbomb.h"

#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"

class daB_TN_HIO_c {
public:
    daB_TN_HIO_c();
    virtual ~daB_TN_HIO_c() {};

    /* 0x04 */ s8 mUnk1;
    /* 0x08 */ f32 mScale;
    /* 0x0C */ f32 mKColorA;
    /* 0x10 */ f32 mTimer3Wolf;
    /* 0x14 */ f32 mTimer3HumanType0;
    /* 0x18 */ f32 mTimer3HumanType1;
    /* 0x1C */ f32 mTimer3NormalType0;
    /* 0x20 */ f32 mTimer3NormalType1;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ f32 mTimer1Action1;
    /* 0x2C */ f32 mTimer1Action2;
};

STATIC_ASSERT(sizeof(daB_TN_HIO_c) == 0x30);

enum B_TN_RES_FILE_ID {
    /* BCK */
    /* 0x04 */ BCK_TN2B_DIE = 4,
    /* 0x05 */ BCK_TNA_ATACK_A,
    /* 0x06 */ BCK_TNA_ATACK_B,
    /* 0x07 */ BCK_TNA_ATACK_OP,
    /* 0x08 */ BCK_TNA_ATACK_SHIELD,
    /* 0x09 */ BCK_TNA_DAMAGE_L,
    /* 0x0A */ BCK_TNA_DAMAGE_LAST,
    /* 0x0B */ BCK_TNA_DAMAGE_R,
    /* 0x0C */ BCK_TNA_GUARD,
    /* 0x0D */ BCK_TNA_GUARD_DAMAGE,
    /* 0x0E */ BCK_TNA_TURN_OP,
    /* 0x0F */ BCK_TNA_WAIT,
    /* 0x10 */ BCK_TNA_WAIT_B_1,
    /* 0x11 */ BCK_TNA_WAIT_B_2,
    /* 0x12 */ BCK_TNA_WAIT_OP,
    /* 0x13 */ BCK_TNA_WALK,
    /* 0x14 */ BCK_TNB_ATACK_A,
    /* 0x15 */ BCK_TNB_ATACK_B,
    /* 0x16 */ BCK_TNB_ATACK_SHIELD,
    /* 0x17 */ BCK_TNB_DAMAGE_L,
    /* 0x18 */ BCK_TNB_DAMAGE_R,
    /* 0x19 */ BCK_TNB_DIE,
    /* 0x1A */ BCK_TNB_DOWN,
    /* 0x1B */ BCK_TNB_DOWN_SIPPU,
    /* 0x1C */ BCK_TNB_GUARD_A,
    /* 0x1D */ BCK_TNB_GUARD_B,
