/**
 * @file d_a_e_st.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_st.h"
#include "d/d_cc_d.h"
#include "dol2asm.h"
#include "f_op/f_op_actor_enemy.h"
#include "Z2AudioLib/Z2Instances.h"

class daE_ST_HIO_c : public JORReflexible {
public:
    /* 8079DDEC */ daE_ST_HIO_c();
    /* 807A61FC */ virtual ~daE_ST_HIO_c() {}

    void genMessage(JORMContext*);

    /* スタルチュラ - Skulltula */

    /* 0x04 */ s8 id;
    /* 0x08 */ f32 basic_size;          // 基本サイズ - Basic Size
    /* 0x0C */ f32 pl_recognize_dist;   // PL認識距離 - PL Recognition Distance
    /* 0x10 */ f32 combat_start_dist;   // 戦闘開始距離 - Combat Start Distance
    /* 0x14 */ s16 time_before_attack;  // 攻撃前間 - Time Before Attack
    /* 0x16 */ s16 down_time;           // ダウン時間 - Down Time
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 field_0x1c;
    /* 0x20 */ f32 field_0x20;
};

//
// Forward References:
//

extern "C" void __ct__12daE_ST_HIO_cFv();
extern "C" static void anm_init__FP10e_st_classifUcf();
extern "C" static void nodeCallBack__FP8J3DJointi();
extern "C" static void daE_ST_Draw__FP10e_st_class();
extern "C" static void other_bg_check__FP10e_st_classP10fopAc_ac_c();
extern "C" static void pl_check__FP10e_st_classf();
extern "C" static void damage_check__FP10e_st_class();
extern "C" static void move_bg_check__FP10e_st_class();
extern "C" static void bg_angle_set__FP10e_st_classs();
extern "C" static void bg_pos_get__FP10e_st_class();
extern "C" static void next_angle_get__FP10e_st_class();
extern "C" static void move_calc__FP10e_st_class();
extern "C" static void e_st_wait__FP10e_st_class();
extern "C" static void pl_angle_get__FP10e_st_class();
extern "C" static void e_st_move__FP10e_st_class();
extern "C" static void e_st_pl_search__FP10e_st_class();
extern "C" static void e_st_shoot__FP10e_st_class();
