/**
 * @file d_a_b_mgn.cpp
 *
 */

#include "d/dolzel_rel.h"

#include "d/actor/d_a_b_mgn.h"
#include "d/actor/d_a_obj_bhashi.h"
#include "d/d_camera.h"
#include "f_op/f_op_msg_mng.h"
#include "m_Do/m_Do_graphic.h"
#include "f_op/f_op_actor_enemy.h"

class daB_MGN_HIO_c : public JORReflexible {
public:
    /* 8060572C */ daB_MGN_HIO_c();
    /* 8060F8D0 */ virtual ~daB_MGN_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 no;
    /* 0x08 */ f32 base_size;
    /* 0x0C */ f32 dash_speed;
    /* 0x10 */ f32 turn_speed;
    /* 0x14 */ f32 dash_anim;
    /* 0x18 */ f32 jewel_R;
    /* 0x1C */ f32 jewel_G;
    /* 0x20 */ f32 jewel_B;
};

enum B_MGN_RES_FILE_ID {
    /* BCK */
    /* 0x06 */ BCK_MGN_APPROACH = 6,
    /* 0x07 */ BCK_MGN_BACKJUMP,
    /* 0x08 */ BCK_MGN_BLOW,
    /* 0x09 */ BCK_MGN_DASH,
    /* 0x0A */ BCK_MGN_DASH_JUMP,
    /* 0x0B */ BCK_MGN_DOWNL,
    /* 0x0C */ BCK_MGN_DOWNL_DAMAGE,
    /* 0x0D */ BCK_MGN_DOWNL_LOOP,
    /* 0x0E */ BCK_MGN_DOWNL_UP,
    /* 0x0F */ BCK_MGN_DOWNL_UPA,
    /* 0x10 */ BCK_MGN_DOWNL_UPB,
    /* 0x11 */ BCK_MGN_DOWNL_WAIT,
    /* 0x12 */ BCK_MGN_DOWNR,
    /* 0x13 */ BCK_MGN_DOWNR_DAMAGE,
    /* 0x14 */ BCK_MGN_DOWNR_LOOP,
    /* 0x15 */ BCK_MGN_DOWNR_UPA,
    /* 0x16 */ BCK_MGN_DOWNR_UPB,
    /* 0x17 */ BCK_MGN_DOWNR_WAIT,
    /* 0x18 */ BCK_MGN_DROP,
    /* 0x19 */ BCK_MGN_DROP_POSE,
    /* 0x1A */ BCK_MGN_END_DEMO,
    /* 0x1B */ BCK_MGN_MDCATCHED,
    /* 0x1C */ BCK_MGN_MDCATCHST,
    /* 0x1D */ BCK_MGN_MDTHROWLED,
    /* 0x1E */ BCK_MGN_MDTHROWLST,
    /* 0x1F */ BCK_MGN_MDTHROWRED,
    /* 0x20 */ BCK_MGN_MDTHROWRST,
