/**
 * @file d_a_e_ww.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_ww.h"
#include "f_op/f_op_camera_mng.h"
#include "d/d_debug_viewer.h"
#include "d/d_cc_uty.h"
#include "f_op/f_op_actor_enemy.h"
#include "Z2AudioLib/Z2Instances.h"

enum E_ww_RES_File_ID {
    /* BCK */
    /* 0x04 */ BCK_WW_APPEAR = 0x4,
    /* 0x05 */ BCK_WW_BACKSTEP,
    /* 0x06 */ BCK_WW_DAMAGE,
    /* 0x07 */ BCK_WW_DEAD,
    /* 0x08 */ BCK_WW_JUMPATTACKA,
    /* 0x09 */ BCK_WW_JUMPATTACKB,
    /* 0x0A */ BCK_WW_JUMPATTACKC,
    /* 0x0B */ BCK_WW_RUN,
    /* 0x0C */ BCK_WW_SIDESTEPL,
    /* 0x0D */ BCK_WW_SIDESTEPR,
    /* 0x0E */ BCK_WW_TURN,
    /* 0x0F */ BCK_WW_WAIT,
    /* 0x10 */ BCK_WW_WALK,

    /* BMDR */
    /* 0x13 */ BMDR_WW = 0x13,
};

enum Joint {
    /* 0x00 */ JNT_WORLD_ROOT,
    /* 0x01 */ JNT_BODY01,
    /* 0x02 */ JNT_BODY02,
    /* 0x03 */ JNT_NECK,
    /* 0x04 */ JNT_HEAD,
    /* 0x05 */ JNT_AGO,
    /* 0x06 */ JNT_EARL,
    /* 0x07 */ JNT_EARR,
    /* 0x08 */ JNT_SHOULDERL,
    /* 0x09 */ JNT_ARML01,
    /* 0x0A */ JNT_ARML02,
    /* 0x0B */ JNT_HANDL01,
    /* 0x0C */ JNT_HANDL02,
    /* 0x0D */ JNT_SHOULDERR,
    /* 0x0E */ JNT_ARMR01,
    /* 0x0F */ JNT_ARMR02,
    /* 0x10 */ JNT_HANDR01,
    /* 0x11 */ JNT_HANDR02,
    /* 0x12 */ JNT_WAIST,
    /* 0x13 */ JNT_LEGL01,
    /* 0x14 */ JNT_LEGL02,
    /* 0x15 */ JNT_LEGL03,
    /* 0x16 */ JNT_FOOTL,
    /* 0x17 */ JNT_LEGR01,
    /* 0x18 */ JNT_LEGR02,
    /* 0x19 */ JNT_LEGR03,
    /* 0x1A */ JNT_FOOTR,
    /* 0x1B */ JNT_TAIL01,
    /* 0x1C */ JNT_TAIL02,
};

enum Action {
    /* 0x0 */ ACTION_MASTER,
    /* 0x1 */ ACTION_WAIT,
    /* 0x2 */ ACTION_ATTACK,
    /* 0x3 */ ACTION_CHASE,
    /* 0x4 */ ACTION_DAMAGE,
    /* 0x5 */ ACTION_MOVE_OUT,
    /* 0x6 */ ACTION_WALK,
};

enum Action_Mode {
    /* 0x00 */ ACTION_MODE_0,
    /* 0x01 */ ACTION_MODE_1,
    /* 0x02 */ ACTION_MODE_2,
    /* 0x03 */ ACTION_MODE_3,
    /* 0x05 */ ACTION_MODE_5 = 0x5,
    /* 0x06 */ ACTION_MODE_6,
    /* 0x0A */ ACTION_MODE_10 = 0xA,
    /* 0x0B */ ACTION_MODE_11,
    /* 0x0C */ ACTION_MODE_12,
    /* 0x0D */ ACTION_MODE_13,
    /* 0x0E */ ACTION_MODE_14,
    /* 0x0F */ ACTION_MODE_15,
    /* 0x10 */ ACTION_MODE_16,
    /* 0x14 */ ACTION_MODE_20 = 0x14,
    /* 0x15 */ ACTION_MODE_21,
    /* 0x16 */ ACTION_MODE_22,
    /* 0x19 */ ACTION_MODE_25 = 0x19,
    /* 0x1A */ ACTION_MODE_26,
    /* 0x1B */ ACTION_MODE_27,
    /* 0x1C */ ACTION_MODE_28,
    /* 0xC8 */ ACTION_MODE_200 = 0xC8,
};

class daE_WW_HIO_c : public JORReflexible {
public:
    daE_WW_HIO_c();
    virtual ~daE_WW_HIO_c() {}

    void genMessage(JORMContext*);

    /* ホワイトウルフォス - White Werewolf */
    /* 0x04 */ s8 field_0x04;
    /* 0x08 */ f32 model_size;              // モデルサイズ - Model Size      
    /* 0x0C */ f32 attack_interval;         // 攻撃間隔 - Attack Interval
    /* 0x10 */ f32 run_anm;                 // 走りアニメーション - Run Animation
    /* 0x14 */ f32 walk_anm;                // 歩きアニメーション - Walk Animation
    /* 0x18 */ f32 run_speed;               // 走る速度 - Run Speed
    /* 0x1C */ f32 wolf_escape_speed;       // 狼から逃亡速度 - Wolf Escape Speed
    /* 0x20 */ f32 link_escape_speed;       // リンクから逃亡速度 - Link Escape Speed
    /* 0x24 */ u8 move_range_debug_display; // 移動範囲デバック表示 - Move Range Debug Display
};

namespace {
    /* 807EF904-807EF944 000038 0040+00 1/1 0/0 0/0 .data            cc_ww_src__22@unnamed@d_a_e_ww_cpp@ */
    dCcD_SrcSph cc_ww_src = {
        {
            {0x0, {{0x400, 0x1, 0xC}, {0x0, 0x0}, 0x75}}, // mObj
            {dCcD_SE_METAL, 0x0, 0x0, 0x0, 0x0}, // mGObjAt
            {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x2}, // mGObjTg
            {0x0}, // mGObjCo
        }, // mObjInf
        {
            {{0.0f, 0.0f, 0.0f}, 40.0f} // mSph
        } // mSphAttr
    };
    
    /* 807EF944-807EF984 000078 0040+00 1/1 0/0 0/0 .data cc_ww_tg_src__22@unnamed@d_a_e_ww_cpp@ */
    dCcD_SrcSph cc_ww_tg_src = {
        {
            {0x0, {{0x0, 0x1, 0x0}, {0xD8FBFDFF, 0x43}, 0x0}}, // mObj
            {dCcD_SE_METAL, 0x0, 0x0, 0x0, 0x0}, // mGObjAt
            {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x2}, // mGObjTg
            {0x0}, // mGObjCo
        }, // mObjInf
        {
