/**
 * @file d_a_e_gb.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_gb.h"
#include "res/Object/E_gb.h"
#include "d/d_cc_d.h"
#include "d/d_camera.h"
#include "d/d_bomb.h"
#include "d/actor/d_a_obj_smallkey.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"

enum Head_Action {
    /* 0x0 */ HEAD_ACTION_WAIT,
    /* 0x1 */ HEAD_ACTION_ATTACK_1,
    /* 0x2 */ HEAD_ACTION_ATTACK_2,
    /* 0x3 */ HEAD_ACTION_DAMAGE,
    /* 0x5 */ HEAD_ACTION_END = 0x5,
    /* 0xA */ HEAD_ACTION_START = 0xA,
};

enum Flower_Action {
    /* 0x0 */ FLOWER_ACTION_WAIT,
    /* 0x2 */ FLOWER_ACTION_EATBOMB = 0x2,
    /* 0x3 */ FLOWER_ACTION_CHANCE,
    /* 0xA */ FLOWER_ACTION_END = 0xA,
};

class daE_GB_HIO_c : public JORReflexible{
public:
    virtual ~daE_GB_HIO_c() {}
    daE_GB_HIO_c();

    void genMessage(JORMContext*);

    /* 0x04 */ s8 no;
    /* 0x08 */ f32 face_size;
    /* 0x0C */ f32 flower_size;
    /* 0x10 */ f32 stem_size;
    /* 0x14 */ s16 attack_frequency;
    /* 0x18 */ f32 attack_spd;
    /* 0x1C */ s16 attack_range;
    /* 0x1E */ s16 post_attack_pause_timer;
};

daE_GB_HIO_c::daE_GB_HIO_c() {
    no = -1;
    face_size = 1.0f;
    flower_size = 1.0f;
    stem_size = 1.0f;
    attack_frequency = 15;
    attack_spd = 65.0f;
    attack_range = 12;
    post_attack_pause_timer = 10;
}

#if DEBUG
void daE_GB_HIO_c::genMessage(JORMContext* ctx) {
    ctx->genLabel("  デカババ　　", 0x80000001, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genLabel("　　　大幅なサイズ変更は姿勢生成に影響があるので注意　　　", 0x80000001, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("顔サイズ", &face_size, 0.0f, 5.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("花サイズ", &flower_size, 0.0f, 5.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("茎サイズ", &stem_size, 0.0f, 5.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("攻撃頻度", &attack_frequency, 0, 30000, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("攻撃速度", &attack_spd, 0.0f, 200.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
