/**
 * @file d_a_e_gi.cpp
 * 
*/

#include "d/dolzel_rel.h"

#include "d/actor/d_a_e_gi.h"
#include "d/d_com_inf_game.h"
#include "f_op/f_op_actor_enemy.h"

class daE_GI_HIO_c : public JORReflexible {
public:
    /* 806CD48C */ daE_GI_HIO_c();
    /* 806D098C */ virtual ~daE_GI_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 id;
    /* 0x08 */ f32 model_size;
    /* 0x0C */ f32 move_speed;
    /* 0x10 */ f32 player_detect_range;
    /* 0x14 */ f32 player_attack_range;
    /* 0x18 */ f32 attack_angle;
    /* 0x1C */ f32 link_stun_time;
    /* 0x20 */ f32 wolf_stun_time;
    /* 0x24 */ f32 scream_prevention_time;
    /* 0x28 */ f32 lever_spin_time;
};

enum daE_GI_ACTION_e {
    ACTION_SLEEP_e,
    ACTION_WAIT_e,
    ACTION_CHASE_e,
    ACTION_ATTACK_e,
    ACTION_DAMAGE_e,
    ATTACK_BITE_DAMAGE_e,
};

namespace {
/* 806D0FBC-806D0FFC 000038 0040+00 1/1 0/0 0/0 .data            cc_gi_src__22@unnamed@d_a_e_gi_cpp@
 */
static dCcD_SrcSph cc_gi_src = {
    {
        {0x0, {{0x0, 0x1, 0x0}, {0xD8FBFDFF, 0x43}, 0x75}}, // mObj
        {dCcD_SE_METAL, 0x0, 0x0, 0x0, 0x0}, // mGObjAt
        {dCcD_SE_NONE, 0x0, 0x0, 0x0, 0x2}, // mGObjTg
        {0x0}, // mGObjCo
    }, // mObjInf
    {
        {{0.0f, 0.0f, 0.0f}, 40.0f} // mSph
    } // mSphAttr
};

/* 806D0FFC-806D103C 000078 0040+00 1/1 0/0 0/0 .data cc_gi_att_src__22@unnamed@d_a_e_gi_cpp@ */
static dCcD_SrcSph cc_gi_att_src = {
    {
        {0x0, {{0x100000, 0x3, 0xD}, {0xD8FBFDFF, 0x0}, 0x75}}, // mObj
        {dCcD_SE_METAL, 0x0, 0x1, 0x0, 0x0}, // mGObjAt
        {dCcD_SE_NONE, 0x2, 0x0, 0x0, 0x3}, // mGObjTg
        {0x0}, // mGObjCo
