/**
 * @file d_a_e_po.cpp
 *
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_po.h"
#include "d/actor/d_a_obj_poFire.h"
#include "d/d_cc_d.h"
#include "d/d_cc_uty.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"
#include "Z2AudioLib/Z2Instances.h"


static s16 mAttackNo = 3;

static f32 mHaba = 400.0f;

static s16 mRollHp = 90;

class daE_PO_HIO_c {
public:
    daE_PO_HIO_c();
    virtual ~daE_PO_HIO_c() {}

    /* 0x04 */ s8 field_0x04[4];
    /* 0x08 */ f32 mBaseSize;
    /* 0x0c */ f32 mSearchDist;
    /* 0x10 */ f32 mAttackDist;
    /* 0x14 */ f32 mMovementSpeed;
    /* 0x18 */ f32 mType0AtRange;
    /* 0x1c */ s16 mKanteraColor1R;
    /* 0x1e */ s16 mKanteraColor1G;
    /* 0x20 */ s16 mKanteraColor1B;
    /* 0x22 */ s16 mKanteraColor2R;
    /* 0x24 */ s16 mKanteraColor2G;
    /* 0x26 */ s16 mKanteraColor2B;
    /* 0x28 */ s16 mKanteraColor1A;
    /* 0x2a */ s16 mReviveTime1;
    /* 0x2c */ s16 mReviveTime2;
    /* 0x2e */ s16 mReviveTime3;
    /* 0x30 */ s16 mReviveTime4;
    /* 0x32 */ s16 mFallChanceTime;
    /* 0x34 */ s16 mAttackChanceTime;
    /* 0x36 */ s16 field_0x36;
    /* 0x38 */ f32 mModelSize;
};

daE_PO_HIO_c::daE_PO_HIO_c() {
    field_0x04[0] = -1;
    mBaseSize = 1.2f;
    mSearchDist = 1000.0f;
    mAttackDist = 300.0f;
    mMovementSpeed = 15.0f;
    mType0AtRange = 700.0f;
    mKanteraColor1R = 72;
    mKanteraColor1G = 133;
    mKanteraColor1B = 255;
    mKanteraColor1A = 255;
    mKanteraColor2R = 0;
    mKanteraColor2G = 0;
    mKanteraColor2B = 255;
    mReviveTime1 = 150;
    mReviveTime2 = 75;
    mReviveTime3 = 75;
    mReviveTime4 = 150;
    mFallChanceTime = 50;
    mAttackChanceTime = 50;
    mModelSize = 1.0f;
}

static u8 hio_set;
static daE_PO_HIO_c l_HIO;

static s16 mRollCount;
static s16 mRollPlus;

static s16 mRollDemoFlag;
static s16 mHollDemoFlag;

static int mArg0Check(e_po_class* i_this, s16 param_1) {
    if (param_1 != 0xFF) {
        return (param_1 == i_this->mArg0 ? 1 : 0);
    }
    if (i_this->mArg0 >= 3 && i_this->mArg0 <= 6) {
        return 2;
    }
    if (i_this->mArg0 >= 7 && i_this->mArg0 <= 10) {
