/**
 * @file d_a_e_dd.cpp
 * 
*/

#include "d/dolzel_rel.h"

#include "d/actor/d_a_e_dd.h"
#include "d/d_cc_d.h"
#include "d/d_com_inf_game.h"
#include "d/d_bomb.h"
#include "f_op/f_op_actor_enemy.h"

class daE_DD_HIO_c : public JORReflexible {
public:
    /* 806A226C */ daE_DD_HIO_c();
    /* 806A6D08 */ virtual ~daE_DD_HIO_c() {}

    void genMessage(JORMContext*);

    /* ドドンゴ - Dodongo */
    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 basic_size;      // 基本サイズ - Basic Size
    /* 0x0C */ f32 walk_speed;      // 歩速度 - Walk Speed
    /* 0x10 */ f32 run_speed;       // 走速度 - Run Speed
    /* 0x14 */ f32 search_area;     // サーチエリア - Search Area
    /* 0x18 */ f32 flame_distance;  // 炎距離 - Flame Distance
    /* 0x1C */ f32 horned_head;     // 首曲角 - Horned Head
    /* 0x20 */ s16 flame_time;      // 炎時間 - Flame Time
    /* 0x24 */ f32 flame_mot_speed; // 炎モーション速 - Flame Motion Speed
};

enum E_dd_RES_File_ID {
    /* BCK */
    /* 0x05 */ BCK_DD_DAMAGE_L = 0x5,
    /* 0x06 */ BCK_DD_DAMAGE_R,
    /* 0x07 */ BCK_DD_DIE,
    /* 0x08 */ BCK_DD_DIE_ARROW,
    /* 0x09 */ BCK_DD_DIE_BOMB,
    /* 0x0A */ BCK_DD_DIE_FALL_A_1,
    /* 0x0B */ BCK_DD_DIE_FALL_A_2,
    /* 0x0C */ BCK_DD_DIE_FALL_B,
    /* 0x0D */ BCK_DD_DIE_FALL_C,
    /* 0x0E */ BCK_DD_FIRE_A,
    /* 0x0F */ BCK_DD_FIRE_B,
    /* 0x10 */ BCK_DD_FIRE_C,
    /* 0x11 */ BCK_DD_GUARD,
    /* 0x12 */ BCK_DD_RUN,
    /* 0x13 */ BCK_DD_TURN_L,
    /* 0x14 */ BCK_DD_TURN_R,
    /* 0x15 */ BCK_DD_WAIT,
    /* 0x16 */ BCK_DD_WALK,

    /* BMDR */
    /* 0x19 */ BMDR_DD = 0x19,

    /* BRK */
    /* 0x1C */ BRK_DD = 0x1C,
    /* 0x1D */ BRK_DD_DEAD,
    /* 0x1E */ BRK_DD_FIRE_A,
    /* 0x1F */ BRK_DD_FIRE_B,
    /* 0x20 */ BRK_DD_FIRE_C,
};

enum Joint {
    /* 0x00 */ JNT_WORLD_ROOT,
    /* 0x01 */ JNT_BACKBONE_1,
    /* 0x02 */ JNT_BACKBONE_2,
