/**
 * @file d_a_e_st.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_st.h"
#include "f_op/f_op_kankyo_mng.h"
#include "f_op/f_op_actor_enemy.h"
#include "Z2AudioLib/Z2Instances.h"

enum E_st_RES_File_ID {
    /* BCK */
    /* 0x04 */ BCK_ST_ATTACK = 0x4,
    /* 0x05 */ BCK_ST_ATTACK02,
    /* 0x06 */ BCK_ST_ATTACKA,
    /* 0x07 */ BCK_ST_ATTACKB,
    /* 0x08 */ BCK_ST_ATTACKC,
    /* 0x09 */ BCK_ST_DAMAGE,
    /* 0x0A */ BCK_ST_DAWNA,
    /* 0x0B */ BCK_ST_DAWNB,
    /* 0x0C */ BCK_ST_DAWNC,
    /* 0x0D */ BCK_ST_DEAD,
    /* 0x0E */ BCK_ST_DEADWAIT,
    /* 0x0F */ BCK_ST_DEATH,
    /* 0x10 */ BCK_ST_DEATHA,
    /* 0x11 */ BCK_ST_DEFENSE,
    /* 0x12 */ BCK_ST_HANG,
    /* 0x13 */ BCK_ST_HANG02,
    /* 0x14 */ BCK_ST_HANG_DOWN,
    /* 0x15 */ BCK_ST_HANG_SHOCK,
    /* 0x16 */ BCK_ST_HANG_UP,
    /* 0x17 */ BCK_ST_HANGATTACK,
    /* 0x18 */ BCK_ST_HANGDAMAGE,
    /* 0x19 */ BCK_ST_HITL,
    /* 0x1A */ BCK_ST_HITR,
    /* 0x1B */ BCK_ST_HUG,
    /* 0x1C */ BCK_ST_HUG_ATTACK,
    /* 0x1D */ BCK_ST_JUMP,
    /* 0x1E */ BCK_ST_LANDING,
    /* 0x1F */ BCK_ST_MOVE,
    /* 0x20 */ BCK_ST_STAND,
    /* 0x21 */ BCK_ST_TURN,
    /* 0x22 */ BCK_ST_WAIT,
    /* 0x23 */ BCK_ST_WAIT02,
    /* 0x24 */ BCK_ST_WATERDEAD,
    /* 0x25 */ BCK_ST_WINDDAMAGE,

    /* BMDR */
    /* 0x28 */ BMDR_ST = 0x28,
    /* 0x29 */ BMDR_ST2,
};

enum Joint {
    /* 0x00 */ JNT_WORLD_ROOT,
    /* 0x01 */ JNT_HEAD,
    /* 0x02 */ JNT_LLEGA_1,
    /* 0x03 */ JNT_LLEGA_2,

    /* 0x0B */ ACTION_HANG_SHOOT,
    /* 0x0C */ ACTION_HANG_DROP,
    /* 0x0D */ ACTION_HANG_2,
    /* 0x0E */ ACTION_HANG_2_SHOOT,
    /* 0x0F */ ACTION_JUMP_ATTACK,
    /* 0x13 */ ACTION_S_DAMAGE = 0x13,
    /* 0x14 */ ACTION_DAMAGE,
    /* 0x15 */ ACTION_WATER,
    /* 0x32 */ ACTION_G_NORMAL = 0x32,
    /* 0x33 */ ACTION_G_FIGHT,
    /* 0x34 */ ACTION_G_DEF,
    /* 0x35 */ ACTION_G_DAMAGE,
    /* 0x36 */ ACTION_G_S_DAMAGE,
    /* 0x37 */ ACTION_G_WIND,
    /* 0x38 */ ACTION_G_CHANCE,
    /* 0x39 */ ACTION_G_END,
    /* 0x64 */ ACTION_UNK_100 = 0x64,
};

enum Action_Phase {
    /* 0x0 */ PHASE_INIT,

    /* e_st_wait */
    /* 0x1 */ WAIT_PHASE_WAIT = 0x1,
    /* 0x2 */ WAIT_PHASE_TURN,

    /* e_st_move */
    /* 0x1 */ MOVE_PHASE_MOVE = 0x1,

    /* e_st_pl_search */
    /* 0x1 */ PL_SEARCH_MOVE_INIT = 0x1,
    /* 0x2 */ PL_SEARCH_MOVE,
    /* 0x3 */ PL_SEARCH_ATTACK02,
    /* 0x5 */ PL_SEARCH_WAIT02 = 0x5,

    /* e_st_shoot */
    /* 0x1 */ SHOOT_PHASE_ATTACK = 0x1,
    /* 0x2 */ SHOOT_PHASE_WAIT02,

    /* e_st_jump_attack */
    /* 0x1 */ JUMP_ATTACK_PHASE_JUMP = 0x1,
    /* 0x2 */ JUMP_ATTACK_PHASE_HUG,
    /* 0x3 */ JUMP_ATTACK_PHASE_3,
    /* 0x4 */ JUMP_ATTACK_PHASE_HUG_ATTACK,
    /* 0x5 */ JUMP_ATTACK_PHASE_JUMPBACK,
    /* 0x6 */ JUMP_ATTACK_PHASE_LANDING,

    /* e_st_hang */
    /* 0x1 */ HANG_PHASE_HANG = 0x1,

    /* e_st_hang_shoot */
    /* 0x1 */ HANG_SHOOT_PHASE_HANG = 0x1,
    /* 0x2 */ HANG_SHOOT_PHASE_HANGATTACK,

    /* e_st_hang_drop */
    /* 0x1 */ HANG_DROP_PHASE_WAIT = 0x1,
    /* 0x2 */ HANG_DROP_PHASE_LANDING,

    /* e_st_hang_2 */
    /* 0x1 */ HANG_2_PHASE_HANG = 0x1,
    /* 0x2 */ HANG_2_PHASE_2,
    /* 0x3 */ HANG_2_PHASE_HANG02,
    /* 0x4 */ HANG_2_PHASE_SHOCK,

    /* e_st_hang_2_shoot */
    /* 0x1 */ HANG_2_SHOOT_PHASE_HANGATTACK = 0x1,

    /* e_st_s_damage */
    /* 0x1 */ S_DAMAGE_PHASE_DAMAGE = 0x1,

    /* e_st_damage */
    /* 0x1 */ DAMAGE_PHASE_HANGDAMAGE = 0x1,
    /* 0x2 */ DAMAGE_PHASE_DEADWAIT,
    /* 0x3 */ DAMAGE_PHASE_3,
    /* 0x4 */ DAMAGE_PHASE_4,
    /* 0x5 */ DAMAGE_PHASE_DEAD,

    /* e_st_water */
    /* 0x1 */ WATER_PHASE_DEAD = 0x1,

    /* e_st_g_normal */
    /* 0x1 */ G_NORMAL_PHASE_WAIT = 0x1,
    /* 0x2 */ G_NORMAL_PHASE_TURN,
    /* 0x3 */ G_NORMAL_PHASE_MOVE,

    /* e_st_g_fight */
    /* 0x1 */ G_FIGHT_PHASE_MOVE = 0x1,
    /* 0x2 */ G_FIGHT_PHASE_WAIT02,
    /* 0x3 */ G_FIGHT_PHASE_ATTACKA,
    /* 0x4 */ G_FIGHT_PHASE_ATTACKB,
    /* 0x5 */ G_FIGHT_PHASE_ATTACKC,

    /* e_st_g_def */
    /* 0x1 */ G_DEF_PHASE_DEFENSE = 0x1,

    /* e_st_g_damage */
    /* 0x1 */ G_DAMAGE_PHASE_HIT = 0x1,

    /* e_st_g_s_damage */
    /* 0x1 */ G_S_DAMAGE_PHASE_NODAMAGE = 0x1,

    /* e_st_g_wind */
    /* 0x1 */ G_WIND_PHASE_WINDDAMAGE = 0x1,

    /* e_st_g_chance */
    /* 0x1 */ G_CHANCE_PHASE_DAWNA = 0x1,
    /* 0x2 */ G_CHANCE_PHASE_DAWNB,
    /* 0x3 */ G_CHANCE_PHASE_STAND,

    /* e_st_g_end */
    /* 0x2 */ G_END_PHASE_DEATH2 = 0x2,
    /* 0xA */ G_END_PHASE_10 = 0xA,
    /* 0xB */ G_END_PHASE_DEATHA,
};

class daE_ST_HIO_c : public JORReflexible {
public:
    daE_ST_HIO_c();
    virtual ~daE_ST_HIO_c() {}

    void genMessage(JORMContext*);

    /* スタルチュラ - Skulltula */

    /* 0x04 */ s8 id;
    /* 0x08 */ f32 basic_size;          // 基本サイズ - Basic Size
    /* 0x0C */ f32 pl_recognize_dist;   // PL認識距離 - PL Recognition Distance
    /* 0x10 */ f32 combat_start_dist;   // 戦闘開始距離 - Combat Start Distance
    /* 0x14 */ s16 time_before_attack;  // 攻撃前間 - Time Before Attack
    /* 0x16 */ s16 down_time;           // ダウン時間 - Down Time
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 field_0x1c;
    /* 0x20 */ f32 field_0x20;
};

daE_ST_HIO_c::daE_ST_HIO_c() {
    id = -1;
    basic_size = 1.7f;
    pl_recognize_dist = 1200.0f;
    combat_start_dist = 200.0f;
    time_before_attack = 0;
    down_time = 80;
    field_0x18 = 1.0f;
    field_0x1c = -0.5f;
    field_0x20 = -1.0f;
}

static void anm_init(e_st_class* i_this, int i_index, f32 i_morf, u8 i_attr, f32 i_rate) {
    i_this->mpModelMorf->setAnm((J3DAnmTransform*)dComIfG_getObjectRes("E_st", i_index), i_attr, i_morf, i_rate, 0.0f, -1.0f);
    i_this->mAnm = i_index;
}

static int nodeCallBack(J3DJoint* i_joint, int param_2) {
    if (param_2 == 0) {
        int jntNo = i_joint->getJntNo();
        J3DModel* model = j3dSys.getModel();
        e_st_class* i_this = (e_st_class*)model->getUserArea();

        if (i_this != NULL) {
            MTXCopy(model->getAnmMtx(jntNo), *calc_mtx);

            if (jntNo >= JNT_LLEGA_1 && jntNo <= JNT_LLEGA_3) {
