/**
 * @file d_a_b_gm.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_b_gm.h"
#include "d/actor/d_a_e_gm.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_obj_ystone.h"
#include "d/d_s_play.h"
#include "d/d_com_inf_game.h"
#include "c/c_damagereaction.h"
#include "SSystem/SComponent/c_math.h"
#include "f_op/f_op_camera_mng.h"
#include "f_op/f_op_msg_mng.h"
#include "Z2AudioLib/Z2Instances.h"

enum B_gm_RES_File_ID {
    /* BCK */
    /* 0x06 */ BCK_EYE_TEST = 0x6,
    /* 0x07 */ BCK_GM_BEAM,
    /* 0x08 */ BCK_GOMA_ATTACK01,
    /* 0x09 */ BCK_GOMA_BEAM_ATTACK_A,
    /* 0x0A */ BCK_GOMA_BEAM_ATTACK_B,
    /* 0x0B */ BCK_GOMA_BEAM_ATTACK_C,
    /* 0x0C */ BCK_GOMA_DAMAGE01,
    /* 0x0D */ BCK_GOMA_DAMAGE02,
    /* 0x0E */ BCK_GOMA_DAMAGEWAIT,
    /* 0x0F */ BCK_GOMA_DASH,
    /* 0x10 */ BCK_GOMA_DEATH,
    /* 0x11 */ BCK_GOMA_FALL_LOOP,
    /* 0x12 */ BCK_GOMA_LANDING,
    /* 0x13 */ BCK_GOMA_LANDING_DAMAGE,
    /* 0x14 */ BCK_GOMA_LANDING_WAIT,
    /* 0x15 */ BCK_GOMA_LAYEGGS,
    /* 0x16 */ BCK_GOMA_MOVE,
    /* 0x17 */ BCK_GOMA_RETURN,
    /* 0x18 */ BCK_GOMA_ROOF_DAMAGE,
    /* 0x19 */ BCK_GOMA_SLOW_MOVE,
    /* 0x1A */ BCK_GOMA_STEPL,
    /* 0x1B */ BCK_GOMA_STEPR,
    /* 0x1C */ BCK_GOMA_UP,
    /* 0x1D */ BCK_GOMA_UP02,
    /* 0x1E */ BCK_GOMA_WAIT,

    /* BMDR */
    /* 0x21 */ BMDR_GM_BEAM = 0x21,
    /* 0x22 */ BMDR_S_L6SPOT,

    /* BMDV */
    /* 0x25 */ BMDV_GOMA = 0x25,

    /* BTK */
    /* 0x28 */ BTK_EYE_ZOOM = 0x28,
    /* 0x29 */ BTK_GM_BEAM,
    /* 0x2A */ BTK_S_L6SPOT,
};

enum Joint {
    /* 0x00 */ JNT_WORLD_ROOT,
    /* 0x01 */ JNT_BELLY1,
    /* 0x02 */ JNT_BELLY2,
    /* 0x03 */ JNT_BELLY3,
    /* 0x04 */ JNT_TAILL1,
    /* 0x05 */ JNT_TAILR1,
    /* 0x06 */ JNT_BODY,
    /* 0x07 */ JNT_OAGOL1,
    /* 0x08 */ JNT_OAGOL2,
    /* 0x09 */ JNT_OAGOL3,
    /* 0x0A */ JNT_OAGOR1,
    /* 0x0B */ JNT_OAGOR2,
    /* 0x0C */ JNT_OAGOR3,
    /* 0x0D */ JNT_AGOLT1,
    /* 0x0E */ JNT_AGOLT2,
    /* 0x0F */ JNT_AGOLU1,
    /* 0x10 */ JNT_AGOLU2,
    /* 0x11 */ JNT_AGORT1,
    /* 0x12 */ JNT_AGORT2,
    /* 0x13 */ JNT_AGORU1,
    /* 0x14 */ JNT_AGORU2,
    /* 0x15 */ JNT_EYE,
    /* 0x16 */ JNT_EYELIDT,
    /* 0x17 */ JNT_EYELIDU,
    /* 0x18 */ JNT_LEGL1_A,
    /* 0x19 */ JNT_LEGL1_B,
    /* 0x1A */ JNT_LEGL1_C,
    /* 0x1B */ JNT_LEGL1_D,
    /* 0x1C */ JNT_LEGL2_A,
    /* 0x1D */ JNT_LEGL2_B,
    /* 0x1E */ JNT_LEGL2_C,
    /* 0x1F */ JNT_LEGL2_D,
    /* 0x20 */ JNT_LEGL3_A,
    /* 0x21 */ JNT_LEGL3_B,
    /* 0x22 */ JNT_LEGL3_C,
    /* 0x23 */ JNT_LEGL3_D,
    /* 0x24 */ JNT_LEGL4_A,
    /* 0x25 */ JNT_LEGL4_B,
    /* 0x26 */ JNT_LEGL4_C,
    /* 0x27 */ JNT_LEGL4_D,
    /* 0x28 */ JNT_LEGR1_A,
    /* 0x29 */ JNT_LEGR1_B,
    /* 0x2A */ JNT_LEGR1_C,
    /* 0x2B */ JNT_LEGR1_D,
    /* 0x2C */ JNT_LEGR2_A,
    /* 0x2D */ JNT_LEGR2_B,
    /* 0x2E */ JNT_LEGR2_C,
    /* 0x2F */ JNT_LEGR2_D,
    /* 0x30 */ JNT_LEGR3_A,
    /* 0x31 */ JNT_LEGR3_B,
    /* 0x32 */ JNT_LEGR3_C,
    /* 0x33 */ JNT_LEGR3_D,
    /* 0x34 */ JNT_LEGR4_A,
    /* 0x35 */ JNT_LEGR4_B,
    /* 0x36 */ JNT_LEGR4_C,
    /* 0x37 */ JNT_LEGR4_D,
    /* 0x38 */ JNT_UDEL1,
    /* 0x39 */ JNT_UDEL2,
    /* 0x3A */ JNT_UDEL3,
    /* 0x3B */ JNT_UDEL4,
    /* 0x3C */ JNT_HASAMIL,
    /* 0x3D */ JNT_UDER1,
    /* 0x3E */ JNT_UDER2,
    /* 0x3F */ JNT_UDER3,
    /* 0x40 */ JNT_UDER4,
    /* 0x41 */ JNT_HASAMIR,
};

enum daB_GM_ACTION {
    /* 0x0 */ ACTION_WAIT,
    /* 0x1 */ ACTION_MOVE,
    /* 0x5 */ ACTION_BEAM = 0x5,
    /* 0x6 */ ACTION_KOGOMA,
    /* 0xA */ ACTION_DAMAGE = 0xA,
    /* 0xB */ ACTION_DROP,
};

enum Action_Phase {
    /* 0x0 */ PHASE_INIT,

    /* b_gm_move */
    /* 0x1 */ MOVE_PHASE_1,
    /* 0x2 */ MOVE_PHASE_2,
    /* 0x3 */ MOVE_PHASE_3,
    /* 0x4 */ MOVE_PHASE_DASH,
    /* 0xA */ MOVE_PHASE_10 = 0xA,

    /* b_gm_beam */
    /* 0x2 */ BEAM_PHASE_BEAM_ATTACK_B = 0x2,
    /* 0x3 */ BEAM_PHASE_BEAM_ATTACK_C,
    /* 0x4 */ BEAM_PHASE_END,

    /* b_gm_kogoma */
    /* 0x1 */ KOGOMA_PHASE_LAYEGGS = 0x1,
    /* 0x2 */ KOGOMA_PHASE_END,

    /* b_gm_damage */
    /* 0x1 */ DAMAGE_PHASE_END = 0x1,

    /* b_gm_drop */
    /* 0x01 */ DROP_PHASE_LANDING = 0x1,
    /* 0x02 */ DROP_PHASE_LANDING_RETURN,
    /* 0x03 */ DROP_PHASE_WAIT,
    /* 0x04 */ DROP_PHASE_END,
    /* 0x0A */ DROP_PHASE_LANDING_DAMAGE = 0xA,
    /* 0x0B */ DROP_PHASE_LANDING_DAMAGE_RETURN,
    /* 0x14 */ DROP_PHASE_DEATH = 0x14,
    /* 0x15 */ DROP_PHASE_CHANGE_COLOR = 0x15,
};

class daB_GM_HIO_c {
public:
    /* 805ED94C */ daB_GM_HIO_c();
    /* 805F3E64 */ virtual ~daB_GM_HIO_c() {}

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 model_size;
    /* 0x0C */ f32 check_size;
    /* 0x10 */ f32 dash_speed;
    /* 0x14 */ f32 dash_anm_speed;
    /* 0x18 */ f32 move_speed;
    /* 0x1C */ f32 move_anm_speed;
    /* 0x20 */ f32 wait_anm_speed;
    /* 0x24 */ f32 range;
    /* 0x28 */ s16 smoke_prim_R;
    /* 0x2A */ s16 smoke_prim_G;
    /* 0x2C */ s16 smoke_prim_B;
    /* 0x2E */ s16 smoke_env_R;
    /* 0x30 */ s16 smoke_env_G;
    /* 0x32 */ s16 smoke_env_B;
    /* 0x34 */ s16 smoke_alpha;
    /* 0x36 */ s16 field_0x36;
    /* 0x38 */ f32 smoke_blend;
    /* 0x3C */ f32 bend_degree_1;
    /* 0x40 */ f32 bend_degree_2;
    /* 0x44 */ f32 bend_degree_3;
    /* 0x48 */ u8 foot_pos_check;
    /* 0x49 */ u8 eye_check;
};

/* 805ED94C-805ED9FC 0000EC 00B0+00 1/1 0/0 0/0 .text            __ct__12daB_GM_HIO_cFv */
daB_GM_HIO_c::daB_GM_HIO_c() {
    field_0x4 = 0xFF;
    model_size = 1.0f;
    check_size = 1.5f;

    dash_speed = 35.0f;
    dash_anm_speed = 1.0f;
    move_speed = 15.0f;
    move_anm_speed = 1.0f;
    wait_anm_speed = 1.0f;
    range = 1300.0f;

    smoke_prim_R = 205;
    smoke_prim_G = 200;
    smoke_prim_B = 180;
    smoke_env_R = 103;
    smoke_env_G = 100;
    smoke_env_B = 90;
    smoke_alpha = 110;
    smoke_blend = 0.3;

    bend_degree_1 = 1.0f;
    bend_degree_2 = 1.0f;
    bend_degree_3 = -1.0f;

    foot_pos_check = false;
    eye_check = false;
}

/* 805ED9FC-805EDAA8 00019C 00AC+00 6/6 0/0 0/0 .text            anm_init__FP10b_gm_classifUcf */
static void anm_init(b_gm_class* i_this, int i_anmID, f32 i_morf, u8 i_attr, f32 i_speed) {
