/**
 * @file d_a_e_sw.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_sw.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"
#include "d/d_bomb.h"
#include <math.h>
#include "Z2AudioLib/Z2Instances.h"

class daE_SW_HIO_c {
public:
    /* サンドワーム (Sandworm) */
    daE_SW_HIO_c();
    virtual ~daE_SW_HIO_c() {}

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 basic_size;                  // 基本サイズ (Basic Size)
    /* 0x0C */ f32 bomb_notice_dist;            // 爆弾認識距離 (Bomb Recognition Distance)
    /* 0x10 */ f32 bomb_attack_start_range;     // 爆弾攻撃開始範囲 (Bomb Attack Start Range)
    /* 0x14 */ f32 human_attack_init_range;     // 人用攻撃開始範囲 (Human Attack Initiation Range)
    /* 0x18 */ f32 horse_attack_init_range;     // 馬用攻撃開始範囲 (Horse Attack Initiation Range)
    /* 0x1C */ f32 character_notice_dist;       // 人認識距離(ダンジョン用) (Character Recognition Distance (For Dungeon))
    /* 0x20 */ u8 movement_range_debug_display; // 移動範囲デバック表示 (Movement Range Debug Display)
};

enum E_SW_RES_File_ID {
    /* BCK */
    /* 0x04 */ BCK_SW_ATTACK = 0x4,
    /* 0x05 */ BCK_SW_ATTACK_END,
    /* 0x06 */ BCK_SW_ATTACK_MIDDLE,
    /* 0x07 */ BCK_SW_ATTACK_START,
    /* 0x08 */ BCK_SW_CHANCE,
    /* 0x09 */ BCK_SW_DAMAGE,
    /* 0x0A */ BCK_SW_DIE,
    /* 0x0B */ BCK_SW_DIVE,
    /* 0x0C */ BCK_SW_RUN,
    /* 0x0D */ BCK_SW_WAIT,

    /* BMDR */
    /* 0x10 */ BMDR_SW = 0x10,
};

enum Action {
    /* 0x0 */ ACTION_EXECUTE_WAIT,
    /* 0x1 */ ACTION_EXECUTE_CHASE_SLOW,
    /* 0x2 */ ACTION_EXECUTE_CHASE_FAST,
    /* 0x3 */ ACTION_EXECUTE_ATTACK,
    /* 0x4 */ ACTION_EXECUTE_BOMB,
    /* 0x5 */ ACTION_EXECUTE_HOOK,
    /* 0x6 */ ACTION_EXECUTE_MOVE_OUT,
    /* 0x7 */ ACTION_EXECUTE_CHANCE,
    /* 0x8 */ ACTION_EXECUTE_DIVE,
    /* 0x9 */ ACTION_EXECUTE_DAMAGE,
    /* 0xA */ ACTION_EXECUTE_DIE,
    /* 0xB */ ACTION_EXECUTE_MASTER,
    /* 0xC */ ACTION_EXECUTE_SUDDEN_ATTACK,
