/**
 * @file d_a_balloon_2D.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_balloon_2D.h"
#include "JSystem/J2DGraph/J2DGrafContext.h"
#include "JSystem/J2DGraph/J2DScreen.h"
#include "JSystem/J2DGraph/J2DTextBox.h"
#include "JSystem/JHostIO/JORServer.h"
#include "SSystem/SComponent/c_math.h"
#include "d/actor/d_a_player.h"
#include "d/d_com_inf_game.h"
#include "d/d_meter2_info.h"
#include "d/d_msg_object.h"
#include "d/d_pane_class.h"
#include "m_Do/m_Do_graphic.h"
#include "m_Do/m_Do_lib.h"

class daBalloon2D_HIO_c : public mDoHIO_entry_c {
public:
    inline daBalloon2D_HIO_c() {
        static param aParam = {
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.0f,
            1.0f,
            0.0f,
            -10.0f,
            0.8f,
            0.0f,
            -13.0f,
            1.1f,
            0.9f,
            0.7f,
            0.0f,
            18.0f,
            1.0f,
            -6.6f,
            6.6f,
            1.3f,
            -1.3f,
            9.2f,
            1.0f,
            0.0f,
            6.6f,
            1.1f,
            0.9f,
            1.0f,
            3.9f,
            -9.2f,
            0.85f,
            0.8f,
            6.6f,
            1.3f,
            0.75f,
            0.9f,
            3.9f,
            0.0f,
            0.85f,
            0.9f,
            3.9f,
            0.0f,
            0.95f,
            0.9f,
            22.0f,
            -17.0f,
            1.0f,
            20.0f,
        };
        memcpy(&m, &aParam, sizeof(aParam));
    }
    virtual ~daBalloon2D_HIO_c() {}

#if DEBUG
    void genMessage(JORMContext*);

#endif

    void resetAddScoreSetFlag();

    struct param {
        /* 0x04 */ u8 mAdjustmentToggle;
        /* 0x08 */ s32 mScore;
        /* 0x0C */ u8 mComboCount;
        /* 0x0D */ u8 mBalloonSize;
        /* 0x0E */ u8 mOverheadScoreToggle;
        /* 0x10 */ s32 mOverheadScore;
        /* 0x14 */ s32 field_0x14;
        /* 0x18 */ f32 field_0x1c;
        /* 0x1C */ f32 field_0x20;
        /* 0x20 */ f32 mScorePosX;
        /* 0x24 */ f32 mScorePosY;
        /* 0x28 */ f32 mScoreSize;
        /* 0x2C */ f32 m5DNumberPosX;
        /* 0x30 */ f32 m5DNumberPosY;
        /* 0x34 */ f32 m5DNumberSizeX;
        /* 0x38 */ f32 m5DNumberSizeY;
        /* 0x3C */ f32 m5DNumberAlpha;
        /* 0x40 */ f32 m5DNumber2PosX;
        /* 0x44 */ f32 m5DNumber2PosY;
        /* 0x48 */ f32 m5DNumber2Size;
        /* 0x4C */ f32 mUnkPosX;
        /* 0x50 */ f32 mUnkPosY;
        /* 0x54 */ f32 mUnkSize;
        /* 0x58 */ f32 mComboPosX;
        /* 0x5C */ f32 mComboPosY;
        /* 0x60 */ f32 mComboSize;
        /* 0x64 */ f32 m2DNumberPosX;
        /* 0x68 */ f32 m2DNumberPosY;
        /* 0x6C */ f32 m2DNumberSizeX;
        /* 0x70 */ f32 m2DNumberSizeY;
        /* 0x74 */ f32 field_0x78;
        /* 0x78 */ f32 m2DNumberComboPosX;
        /* 0x7C */ f32 m2DNumberComboPosY;
        /* 0x80 */ f32 m2DNumberComboSize;
        /* 0x84 */ f32 m2DNumberComboAlpha;
        /* 0x88 */ f32 mBalloonLargePosX;
        /* 0x8C */ f32 mBalloonLargePosY;
        /* 0x90 */ f32 mBalloonLargeSize;
        /* 0x94 */ f32 mBalloonLargeAlpha;
        /* 0x98 */ f32 mBalloonMedPosX;
        /* 0x9C */ f32 mBalloonMedPosY;
        /* 0xA0 */ f32 mBalloonMedSize;
        /* 0xA4 */ f32 mBalloonMedAlpha;
        /* 0xA8 */ f32 mBalloonSmallPosX;
        /* 0xAC */ f32 mBalloonSmallPosY;
        /* 0xB0 */ f32 mBalloonSmallSize;
        /* 0xB4 */ f32 mBalloonSmallAlpha;
        /* 0xB8 */ f32 m2DNumberCombo2PosX;
        /* 0xBC */ f32 m2DNumberCombo2PosY;
        /* 0xC0 */ f32 m2DNumberCombo2Size;
        /* 0xC4 */ f32 m2DNumberCombo2PosX43;
    };

    param m;
};

void daBalloon2D_c::c_list::draw() {
    dComIfGp_getCurrentGrafPort()->setup2D();
    mBalloon->drawMeter();
}

static int daBalloon2D_createHeap(fopAc_ac_c* i_this) {
    return static_cast<daBalloon2D_c*>(i_this)->createHeap();
}

static char* l_arcName = "Balloon2D";

int daBalloon2D_c::createHeap() {
    mScreen = new J2DScreen();
    if (mScreen == NULL) {
        return  0;
    }
    dRes_info_c* resInfo = dComIfG_getObjectResInfo(l_arcName);
    JUT_ASSERT(445, resInfo != NULL);
    JKRArchive* arc = resInfo->getArchive();
    mScreen->setPriority("zelda_balloon_game.blo", 0x20000, arc);
    dPaneClass_showNullPane(mScreen);
    field_0x578 = new CPaneMgr(mScreen, 'n_all', 2, NULL);
    field_0x57c = new CPaneMgr(mScreen, 'score_tn', 0, NULL);
    field_0x580 = new CPaneMgr(mScreen, 'suji_n', 2, NULL);
    field_0x584 = new CPaneMgr(mScreen, 's_set_n', 0, NULL);
