/**
 * @file d_a_e_sf.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_sf.h"
#include "d/d_cc_d.h"
#include "d/d_camera.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"
#include "Z2AudioLib/Z2Instances.h"

enum E_sf_RES_File_ID {
    /* BCK */
    /* 0x04 */ BCK_SF_ATTACK01 = 0x4,
    /* 0x05 */ BCK_SF_ATTACK02,
    /* 0x06 */ BCK_SF_DAMAGE,
    /* 0x07 */ BCK_SF_DIE,
    /* 0x08 */ BCK_SF_DRAWBACK,
    /* 0x09 */ BCK_SF_GETUP,
    /* 0x0A */ BCK_SF_GUARD,
    /* 0x0B */ BCK_SF_OPDEMO,
    /* 0x0C */ BCK_SF_WAIT01,
    /* 0x0D */ BCK_SF_WAIT02,
    /* 0x0E */ BCK_SF_WALK01,
    /* 0x0F */ BCK_SF_WALK02,
    /* 0x10 */ BCK_SF_WALK03,

    /* BMDR */
    /* 0x13 */ BMDR_SF = 0x13,
    /* 0x14 */ BMDR_SF_SHIELDA,
    /* 0x15 */ BMDR_SF_SHIELDB,
    /* 0x16 */ BMDR_SF_SWORDA,
    /* 0x17 */ BMDR_SF_SWORDB,
};

enum Joint {
    /* 0x00 */ JNT_WORLD_ROOT,
    /* 0x01 */ JNT_BACKBONE1,
    /* 0x02 */ JNT_BACKBONE2,
    /* 0x03 */ JNT_NECK,
    /* 0x04 */ JNT_HEAD,
    /* 0x05 */ JNT_CHIN,
    /* 0x06 */ JNT_SHOULDERL,
    /* 0x07 */ JNT_ARML1,
    /* 0x08 */ JNT_HANDL1,
    /* 0x09 */ JNT_HANDL2,
    /* 0x0A */ JNT_SHOULDERPADL,
    /* 0x0B */ JNT_SHOULDERR,
    /* 0x0C */ JNT_ARMR1,
    /* 0x0D */ JNT_HANDR1,
    /* 0x0E */ JNT_HANDR2,
    /* 0x0F */ JNT_SHOULDERPADR,
    /* 0x10 */ JNT_WAIST,
    /* 0x11 */ JNT_LEGL1,
    /* 0x12 */ JNT_LEGL2,
    /* 0x13 */ JNT_FOOTL1,
    /* 0x14 */ JNT_FOOTL2,
    /* 0x15 */ JNT_LEGR1,
    /* 0x16 */ JNT_LEGR2,
    /* 0x17 */ JNT_FOOTR1,
    /* 0x18 */ JNT_FOOTR2,
};

enum Action {
    /* 0x00 */ ACTION_NORMAL,
    /* 0x03 */ ACTION_FIGHT_RUN = 0x3,
    /* 0x04 */ ACTION_ATTACK_0,
    /* 0x05 */ ACTION_ATTACK,
    /* 0x07 */ ACTION_GUARD = 0x7,
    /* 0x08 */ ACTION_DRAWBACK,
    /* 0x14 */ ACTION_S_DAMAGE = 0x14,
    /* 0x1E */ ACTION_CRASH = 0x1E,
    /* 0x1F */ ACTION_GETUP,
    /* 0x20 */ ACTION_CRASHWAIT,
    /* 0x21 */ ACTION_SITWAIT,
};

enum Action_Phase {
    /* 0x0 */ PHASE_INIT,

    /* e_sf_normal */
    /* 0x1 */ NORMAL_PHASE_1 = 0x1,
    /* 0x2 */ NORMAL_PHASE_WALK,
    /* 0x3 */ NORMAL_PHASE_WAIT,

    /* e_sf_drawback */
    /* 0x1 */ DRAWBACK_PHASE_END = 0x1,

    /* e_sf_fight_run */
    /* -10 */ FIGHT_RUN_PHASE_NEG_10 = -10,
    /*  -9 */ FIGHT_RUN_PHASE_NEG_9 = -9,
    /* 0x0 */ FIGHT_RUN_PHASE_0 = 0x0,
    /* 0x1 */ FIGHT_RUN_PHASE_1,
    /* 0x2 */ FIGHT_RUN_PHASE_2,
    /* 0x3 */ FIGHT_RUN_PHASE_3,

    /* e_sf_attack_0 */
    /* 0x1 */ ATTACK_0_PHASE_END = 0x1,

    /* e_sf_attack */
    /* 0x1 */ ATTACK_PHASE_END = 0x1,

    /* e_sf_guard */
    /* 0x1 */ GUARD_PHASE_KNOCKBACK = 0x1,
    /* 0x2 */ GUARD_PHASE_RECOVER,
    /* 0x3 */ GUARD_PHASE_END,

    /* e_sf_s_damage */
    /* 0x1 */ S_DAMAGE_PHASE_END = 0x1,

    /* e_sf_crash */
    /* 0x1 */ CRASH_PHASE_WAIT = 0x1,
    /* 0x2 */ CRASH_PHASE_END,

    /* e_sf_crashwait */
    /* 0x1 */ CRASHWAIT_PHASE_END = 0x1,

    /* e_sf_sitwait */
    /* 0x1 */ SITWAIT_PHASE_1 = 0x1,
    /* 0x2 */ SITWAIT_PHASE_END,

    /* e_sf_getup */
    /* 0x1 */ GETUP_PHASE_GETUP = 0x1,
    /* 0x2 */ GETUP_PHASE_WAIT,
    /* 0x3 */ GETUP_PHASE_END,
};

class daE_SF_HIO_c {
public:
    daE_SF_HIO_c();
    virtual ~daE_SF_HIO_c() {}

    /* スタルフォス - Stalfos */
    /* 0x04 */ s8 id;
    /* 0x08 */ f32 basic_size;              // 基本サイズ - Basic Size
    /* 0x0C */ f32 move_spd;                // 移動速度 - Movement Speed
    /* 0x10 */ f32 charge_spd;              // 突進速度 - Charge Speed
    /* 0x14 */ f32 p_recognize_dist_m;      // P認識距離　M - P Recognition Distance M
    /* 0x18 */ f32 combat_start_range;      // 戦闘開始範囲 - Combat Start Range
    /* 0x1C */ f32 attack_start_range;      // 攻撃開始範囲 - Attack Start Range
    /* 0x20 */ f32 defense_recognize_range; // 防御認識範囲 - Defense Recognition Range
    /* 0x24 */ u8 invulnerable;             // 不死身 - Invulnerable
};

daE_SF_HIO_c::daE_SF_HIO_c() {
    id = -1;
    basic_size = 1.2f;
    move_spd = 5.0f;
    p_recognize_dist_m = 3000.0f;
    charge_spd = 10.0f;
    combat_start_range = 250.0f;
    attack_start_range = 300.0f;
    defense_recognize_range = 300.0f;
    invulnerable = false;
}

static void anm_init(e_sf_class* i_this, int i_index, f32 i_morf, u8 i_attr, f32 i_rate) {
    i_this->mpModelMorf->setAnm((J3DAnmTransform*)dComIfG_getObjectRes("E_sf", i_index), i_attr, i_morf, i_rate, 0.0f, -1.0f);
    i_this->mAnm = i_index;
}

static int nodeCallBack(J3DJoint* i_joint, int param_2) {
    if (param_2 == 0) {
        int jntNo = i_joint->getJntNo();
        J3DModel* model = j3dSys.getModel();
        e_sf_class* i_this = (e_sf_class*)model->getUserArea();

        if (i_this != NULL) {
            MTXCopy(model->getAnmMtx(jntNo), *calc_mtx);

            if (jntNo == JNT_HEAD) {
