/**
 * @file d_a_b_dr.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_b_dr.h"
#include "d/d_com_inf_game.h"
#include "d/actor/d_a_player.h"
#include "d/d_menu_window.h"
#include "d/d_s_play.h"
#include "d/d_debug_viewer.h"
#include "d/actor/d_a_npc4.h"
#include "d/d_camera.h"
#include "c/c_damagereaction.h"
#include "f_op/f_op_camera_mng.h"
#include "Z2AudioLib/Z2Instances.h"


class daB_DR_HIO_c : public JORReflexible {
public:
    daB_DR_HIO_c();
    virtual ~daB_DR_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 model_size;
    /* 0x0C */ f32 fall_accel;
    /* 0x10 */ f32 fall_accel_max;
    /* 0x14 */ f32 wind_large_attack_lockon_range;
    /* 0x18 */ f32 unk_0x18;
    /* 0x1C */ f32 wind_small_attack_power;
    /* 0x20 */ f32 wind_attack_power;
    /* 0x24 */ f32 glide_wind_power;
    /* 0x28 */ f32 breath_attack_threshold;
    /* 0x2C */ f32 unk_0x2c;
    /* 0x30 */ f32 breath_move_speed_max;
    /* 0x34 */ f32 breath_move_speed_min;
    /* 0x38 */ s16 tail_hit_chance_time;
    /* 0x3A */ s16 center_wind_time;
    /* 0x3C */ s16 breath_continue_time;
    /* 0x3E */ s16 breath_continue_no_armor_time;
    /* 0x40 */ s16 breath_feint1_time;
    /* 0x42 */ s16 breath_feint2_time;
    /* 0x44 */ s16 breath_feint3_time;
    /* 0x46 */ s16 no_attack_time;
    /* 0x48 */ s16 unk_0x48;
    /* 0x4A */ s16 no_attack_no_armor_time;
    /* 0x4C */ s16 unk_0x4c;
    /* 0x4E */ s16 back_hit_chance_time;
    /* 0x50 */ s16 after_breath_chance_time;
    /* 0x52 */ s16 neck_search_speed;
    /* 0x54 */ s16 neck_search2_speed;
    /* 0x56 */ s16 neck_search_speed_max;
    /* 0x58 */ s16 body_search_speed;
    /* 0x5A */ s16 body_search2_speed;
    /* 0x5C */ s16 body_search_speed_max;
    /* 0x5E */ s16 body_search_feint_speed_max;
    /* 0x60 */ s16 feint_angle;
    /* 0x62 */ s16 unk_0x62;
    /* 0x64 */ u8 display_range;
    /* 0x65 */ u8 breath_feint2_OFF;
};

#define ANM_DR_BOOT_A 0x10
#define ANM_DR_BOOT_A_DEMO 0x11
#define ANM_DR_BOOT_B 0x12
#define ANM_DR_BOOT_C 0x13
#define ANM_DR_BRAKE_TO_HOVER 0x14
#define ANM_DR_BRIDG_DESTROYA 0x15
#define ANM_DR_BRIDG_DESTROYB 0x16
#define ANM_DR_BURU 0x17
#define ANM_DR_CATCH 0x18
#define ANM_DR_CRAZY 0x19
#define ANM_DR_DAMAGE_L 0x1A
#define ANM_DR_DAMAGE_LAST 0x1B
#define ANM_DR_DAMAGE_R 0x1C
#define ANM_DR_DEATH 0x1D
#define ANM_DR_DEMO_DESTROY 0x1E
#define ANM_DR_DOWN_WAIT 0x1F
#define ANM_DR_FALL 0x20
#define ANM_DR_FALL_DEATH 0x21
#define ANM_DR_FALL_DOWN 0x22
#define ANM_DR_FALL_REVIVE 0x23
#define ANM_DR_FALL_SCREAM 0x24
#define ANM_DR_FEINT_A 0x25
#define ANM_DR_FEINT_B 0x26
#define ANM_DR_FEINT_C 0x27
#define ANM_DR_FIREA 0x28
#define ANM_DR_FIREB 0x29
#define ANM_DR_FIREC 0x2A
#define ANM_DR_FIRED 0x2B
#define ANM_DR_FIREE 0x2C
#define ANM_DR_FLAP 0x2D
#define ANM_DR_FLAP_TO_FLY 0x2E
#define ANM_DR_FLY 0x2F
#define ANM_DR_FLY_TO_GLIDE 0x30
