/**
 * @file d_a_e_fm.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_fm.h"
#include "d/d_com_inf_game.h"
#include "d/actor/d_a_player.h"
#include "d/d_s_play.h"
#include "d/actor/d_a_obj_hhashi.h"
#include "d/actor/d_a_obj_ystone.h"
#include "c/c_damagereaction.h"
#include "f_op/f_op_camera_mng.h"
#include "f_op/f_op_msg_mng.h"
#include "Z2AudioLib/Z2Instances.h"

class daE_FM_HIO_c : public JORReflexible {
public:
    daE_FM_HIO_c();

    void genMessage(JORMContext*);
    virtual ~daE_FM_HIO_c() {}

    /* 0x04 */ s8 no;
    /* 0x08 */ f32 base_size;
    /* 0x0C */ f32 field_0xc;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ f32 field_0x14;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 field_0x1c;
    /* 0x20 */ f32 field_0x20;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ f32 field_0x28;
    /* 0x2C */ f32 field_0x2c;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ s16 field_0x34;
    /* 0x36 */ s16 field_0x36;
    /* 0x38 */ s16 field_0x38;
    /* 0x3C */ f32 field_0x3c;
    /* 0x40 */ f32 field_0x40;
    /* 0x44 */ f32 field_0x44;
    /* 0x48 */ f32 chain_size;
    /* 0x4C */ f32 field_0x4c;
    /* 0x50 */ f32 field_0x50;
    /* 0x54 */ f32 field_0x54;
    /* 0x58 */ f32 field_0x58;
    /* 0x5C */ f32 field_0x5c;
    /* 0x60 */ u8 field_0x60;
    /* 0x61 */ u8 field_0x61;
    /* 0x64 */ f32 field_0x64;
    /* 0x68 */ f32 field_0x68;
    /* 0x6C */ f32 field_0x6c;
    /* 0x70 */ f32 field_0x70;
    /* 0x74 */ f32 field_0x74;
    /* 0x78 */ f32 field_0x78;
    /* 0x7C */ f32 field_0x7c;
    /* 0x80 */ f32 field_0x80;
    /* 0x84 */ f32 field_0x84;
    /* 0x88 */ f32 field_0x88;
    /* 0x8C */ f32 field_0x8c;
    /* 0x90 */ f32 field_0x90;
    /* 0x94 */ s16 field_0x94;
    /* 0x96 */ s16 field_0x96;
    /* 0x98 */ s16 field_0x98;
    /* 0x9A */ s16 field_0x9a;
    /* 0x9C */ s16 field_0x9c;
    /* 0xA0 */ f32 field_0xa0;
    /* 0xA4 */ f32 field_0xa4;
    /* 0xA8 */ f32 field_0xa8;
    /* 0xAC */ u8 field_0xac;
};

enum E_FM_RES_FILE_ID {
    /* BCK */
    /* 0x07 */ BCK_EF_FMATTACK_A = 7,
    /* 0x08 */ BCK_EF_FMATTACK_B,
    /* 0x09 */ BCK_FM_ANIMAL,
    /* 0x0A */ BCK_FM_ANIMAL02,
    /* 0x0B */ BCK_FM_ATTACK,
    /* 0x0C */ BCK_FM_ATTACK02,
    /* 0x0D */ BCK_FM_BREAKCHAINL,
    /* 0x0E */ BCK_FM_BREAKCHAINR,
    /* 0x0F */ BCK_FM_CHANCE,
    /* 0x10 */ BCK_FM_CHANCEDAMAGE,
    /* 0x11 */ BCK_FM_DAMAGEWALK,
    /* 0x12 */ BCK_FM_DAMAGE_L,
    /* 0x13 */ BCK_FM_DAMAGE_R,
    /* 0x14 */ BCK_FM_DEAD,
    /* 0x15 */ BCK_FM_DEMOEND01,
    /* 0x16 */ BCK_FM_DEMOEND02,
    /* 0x17 */ BCK_FM_DEMOEND03,
    /* 0x18 */ BCK_FM_DOWN,
    /* 0x19 */ BCK_FM_DOWN02,
    /* 0x1A */ BCK_FM_DOWNDAMAGE,
    /* 0x1B */ BCK_FM_DOWNFR,
    /* 0x1C */ BCK_FM_DOWNWAIT,
    /* 0x1D */ BCK_FM_HANGWAIT,
    /* 0x1E */ BCK_FM_KYORO2,
    /* 0x1F */ BCK_FM_OPDEMO,
    /* 0x20 */ BCK_FM_UP,
    /* 0x21 */ BCK_FM_UP02,
    /* 0x22 */ BCK_FM_WAIT01,
    /* 0x23 */ BCK_FM_WALK,
