/**
 * @file d_a_e_wb.cpp
 *
 */
 
 #include "d/dolzel_rel.h" // IWYU pragma: keep
 #include "d/actor/d_a_e_rdb.h"
 #include "d/actor/d_a_obj_crvgate.h"
 #include "d/actor/d_a_obj_crvsteel.h"
 #include "d/d_msg_object.h"
#include "d/actor/d_a_e_wb.h"
#include "Z2AudioLib/Z2Instances.h"
#include "c/c_damagereaction.h"
#include "d/actor/d_a_alink.h"
#include "d/actor/d_a_e_rd.h"
#include "d/d_com_inf_game.h"
#include "d/d_s_play.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_graphic.h"


class daE_WB_HIO_c : public JORReflexible {
public:
    daE_WB_HIO_c();
    virtual ~daE_WB_HIO_c() {};
    void genMessage(JORMContext*);

    /* イノシシ - Wild Boar */
    /* 0x00 */ // vtable
    /* 0x04 */ s8 mId;
    /* 0x08 */ f32 base_size;                           // 基本サイズ - Base Size
    /* 0x0C */ f32 leader_size_ratio;                   // リーダーサイズ比 - Leader Size Ratio
    /* 0x10 */ f32 movement_speed;                      // 移動速度 - Movement Speed
    /* 0x14 */ f32 max_speed;                           // 最速度 - Max Speed
    /* 0x18 */ f32 cavalry_battle_max_speed;            // 騎馬戦最速 - Cavalry Battle Max Speed
    /* 0x1C */ f32 normal_speed_vi;
    /* 0x20 */ f32 medium_speed_vi;
    /* 0x24 */ f32 mMaxSpeedVi;
    /* 0x28 */ f32 leader_walking_speed;                // 歩き速（リ）- Leader Walking Speed
    /* 0x2C */ f32 leader_max_speed;                    // 最速度（リ）- Leader Max Speed
    /* 0x30 */ f32 leader_cavalry_battle_max_speed;     // 騎馬戦最（リ）- Leader Cavalry Battle Max Speed
    /* 0x34 */ f32 mSingleRiderSpeed;
    /* 0x38 */ f32 player_recognition_dist;             // PL認識距離 - Player Recognition Distance
    /* 0x3C */ f32 mPlayerMountedMaxSpeed;
    /* 0x40 */ f32 mPlayerMountedMotionPlaybackSpeed;
    /* 0x44 */ s16 mPlayerMountedDashTime;
    /* 0x48 */ f32 mSearchIgnoreDistance1;
    /* 0x4C */ f32 mSearchIgnoreDistance2;
    /* 0x50 */ f32 mGuidanceDisplayDistance1;
    /* 0x54 */ f32 mGuidanceDisplayDistance2;
    /* 0x58 */ u8 field_0x58;
    /* 0x59 */ u8 mNoReins;
};

STATIC_ASSERT(sizeof(daE_WB_HIO_c) == 0x5C);

static u8 const lit_3882[12] = {0};

daE_WB_HIO_c::daE_WB_HIO_c() {
    mId = -1;
    base_size = 1.2f;
    leader_size_ratio = 1.2f;
    movement_speed = 3.5f;
    player_recognition_dist = 600.0f;
    max_speed = 37.0f;
    cavalry_battle_max_speed = 50.0f;
    leader_walking_speed = 10.0f;
    leader_max_speed = 40.0f;
    leader_cavalry_battle_max_speed = 54.0f;
    normal_speed_vi = 25.0f;
    medium_speed_vi = 45.0f;
    mMaxSpeedVi = 55.0f;
    mSingleRiderSpeed = 50.0f;
    mPlayerMountedMaxSpeed = 30.0f;
    mPlayerMountedMotionPlaybackSpeed = 0.80000001f;
    mPlayerMountedDashTime = 300;
    mSearchIgnoreDistance1 = 500.0f;
    mSearchIgnoreDistance2 = 500.0f;
    mGuidanceDisplayDistance1 = 3500.0f;
    mGuidanceDisplayDistance2 = 3500.0f;
    field_0x58 = 0;
    mNoReins = 0;
}

#if DEBUG
void daE_WB_HIO_c::genMessage(JORMContext* ctx) {
