/**
 * @file d_a_mg_rod.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_mg_rod.h"
#include "d/d_com_inf_game.h"
#include "d/d_s_play.h"
#include "d/actor/d_a_alink.h"
#include "d/actor/d_a_canoe.h"
#include "d/actor/d_a_npc_henna.h"
#include "d/actor/d_a_obj_lp.h"
#include "d/actor/d_a_e_sg.h"
#include "d/actor/d_a_obj_life_container.h"
#include "d/d_menu_window.h"
#include "d/d_meter2_info.h"
#include "d/d_msg_object.h"
#include "d/d_item.h"
#include "f_op/f_op_kankyo_mng.h"
#include "c/c_damagereaction.h"
#include "SSystem/SComponent/c_counter.h"
#include "Z2AudioLib/Z2Instances.h"
#include <cmath.h>

class dmg_rod_HIO_c : public JORReflexible {
public:
    dmg_rod_HIO_c();
    virtual ~dmg_rod_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 id;
    /* 0x08 */ f32 field_0x8;
    /* 0x0C */ f32 field_0xc;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ f32 field_0x14;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 field_0x1c;
    /* 0x20 */ f32 field_0x20;
    /* 0x24 */ u8 force_fish_msg_output;
};

static u8 const lit_3879[12] = {
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
};

static u16 check_kind[] = {
    0xF57F, 0xF47F, 0xF37F, 0xF27F,
};

dmg_rod_HIO_c::dmg_rod_HIO_c() {
    id = -1;
    field_0x8 = 1.0f;
    field_0x20 = 0.3f;
    field_0xc = 0.7f;
    field_0x10 = -7.0f;
    field_0x14 = 35.0f;
    field_0x18 = 0.8f;
    field_0x1c = 1.5f;
    force_fish_msg_output = 0;
}

#if DEBUG
void dmg_rod_HIO_c::genMessage(JORMContext* ctx) {
    // Fishing System
    ctx->genLabel("　釣りシステム　", 0x80000001, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->startComboBox("強制魚メッセージ出力", &force_fish_msg_output, 0, NULL, 0xFFFF, 0xFFFF, 0x100, 0x1A);
    ctx->genComboBoxItem("通常", 0); // Normal
    ctx->genComboBoxItem("バス", 1); // Bass
    ctx->genComboBoxItem("ドジョウ", 2); //Loach
    ctx->genComboBoxItem("パイク", 3); // Pike
    ctx->genComboBoxItem("ナマズ", 4); // Catfish
    ctx->genComboBoxItem("マス", 5); // Trout
