/**
 * @file d_a_myna.cpp
 * 
*/

#include "d/dolzel_rel.h"

#include "d/actor/d_a_myna.h"
#include "d/actor/d_a_player.h"
#include "d/d_kankyo.h"
#include "d/d_msg_object.h"
#include "d/actor/d_a_obj_ss_item.h"
#include "d/actor/d_a_tag_myna_light.h"
#include "SSystem/SComponent/c_math.h"

class daMyna_HIO_c : public mDoHIO_entry_c {
public:
    /* 8094A960 */ virtual ~daMyna_HIO_c() {}

    // Must be inlined but defined in .cpp for sinit to match
    inline daMyna_HIO_c();

    void genMessage(JORMContext*);

    /* 0x04 */ f32 field_0x04;  // DAT_8094ba40
    /* 0x08 */ f32 field_0x08;  // DAT_8094ba44
    /* 0x0C */ f32 field_0x0C;  // DAT_8094ba48
    /* 0x10 */ f32 field_0x10;  // DAT_8094ba4c
    /* 0x14 */ f32 field_0x14;  // DAT_8094ba50
    /* 0x18 */ f32 field_0x18;  // DAT_8094ba54
    /* 0x1C */ f32 field_0x1C;  // DAT_8094ba58
    /* 0x20 */ f32 field_0x20;  // DAT_8094ba5c
    /* 0x24 */ s16 field_0x24;  // DAT_8094ba60
    /* 0x26 */ s16 field_0x26;  // DAT_8094ba62
    /* 0x28 */ s16 field_0x28;  // DAT_8094ba64
    /* 0x2A */ s16 field_0x2A;  // DAT_8094ba66
    /* 0x2C */ s16 field_0x2C;  // DAT_8094ba68
    /* 0x2E */ s16 field_0x2E;  // DAT_8094ba6a
    /* 0x30 */ s16 field_0x30;  // DAT_8094ba6c
};

STATIC_ASSERT(sizeof(daMyna_HIO_c) == 0x34);

/* 8094B488-8094B590 000128 0108+00 2/3 0/0 0/0 .data            init_proc */
static daMyna_c::ProcFunc init_proc[] = {
    &daMyna_c::attack_wait_init,
    &daMyna_c::attack_before_talk_init,
    &daMyna_c::attack_fly_init,
    &daMyna_c::attack_init,
    &daMyna_c::attack_after_talk_init,
    &daMyna_c::greet_wait_init,
    &daMyna_c::greet_talk_init,
    &daMyna_c::shopping_wait_init,
    &daMyna_c::shopping_talk_init,
    &daMyna_c::thanks_talk_init,
    &daMyna_c::byebye_talk_init,
    &daMyna_c::turn_on_start_init,
    &daMyna_c::turn_on_init,
    &daMyna_c::turn_on_end1_init,
    &daMyna_c::turn_on_end2_init,
    &daMyna_c::turn_on_end3_init,
    &daMyna_c::wolf_talk_init,
    &daMyna_c::attack_wait2_init,
    &daMyna_c::attack_before_talk2_init,
    &daMyna_c::attack_fly2_init,
    &daMyna_c::attack2_init,
    &daMyna_c::attack2_talk_init,
};

