/**
 * @file d_a_e_hz.cpp
 *
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "Z2AudioLib/Z2Instances.h"
#include "d/actor/d_a_e_hz.h"
#include "../assets/GZ2E01/res/Object/E_hz.h"
#include "d/d_camera.h"
#include "f_op/f_op_actor_enemy.h"
#include "d/d_debug_viewer.h"

enum daE_HZ_Action {
    /*  0 */ ACTION_WAIT,
    /*  1 */ ACTION_HIDE,
    /*  2 */ ACTION_ATTACK,
    /*  3 */ ACTION_AWAY,
    /*  4 */ ACTION_WIND,
    /*  5 */ ACTION_DAMAGE,
    /*  6 */ ACTION_DEATH,
    /*  7 */ ACTION_CHANCE,
    /*  8 */ ACTION_WIND_CHANCE,
    /*  9 */ ACTION_WIND_WALK,
    /* 10 */ ACTION_WATER_DEATH,
    /* 11 */ ACTION_DEATH_WAIT
};

class daE_HZ_HIO_c : public JORReflexible {
public:
    daE_HZ_HIO_c();
    virtual ~daE_HZ_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x4 */ s8 enemy_sample;
    /* 0x8 */ f32 basic_size;
    /* 0xC */ u8 pl_detection_radius_display;
    /* 0x10 */ f32 pl_detection_radius_in;
    /* 0x14 */ f32 pl_detection_radius_outside;
    /* 0x18 */ f32 escape_speed;
    /* 0x1C */ f32 piyori_time;
    /* 0x20 */ f32 extension_time;
    /* 0x24 */ f32 stretch_anim_speed;
    /* 0x28 */ f32 retention_time_before_stretch;
    /* 0x2C */ f32 reeling_rotation_speed;
    /* 0x30 */ f32 y_position_wrap;
    /* 0x34 */ f32 camera_on_timer;
    /* 0x38 */ f32 camera_off_timer;
};

daE_HZ_HIO_c::daE_HZ_HIO_c() {
    enemy_sample = -1;
    basic_size = 1.0f;
    pl_detection_radius_display = 0;
    pl_detection_radius_in = 700.0f;
    pl_detection_radius_outside = 1200.0f;
    escape_speed = 20.0f;
    piyori_time = 160.0f;
    reeling_rotation_speed = 5000.0f;
    y_position_wrap = 400.0f;
    extension_time = 15.0f;
    stretch_anim_speed = 0.7f;
    retention_time_before_stretch = 7.0f;
    camera_on_timer = 1.0f;
    camera_off_timer = 50.0f;
}

#if DEBUG
void daE_HZ_HIO_c::genMessage(JORMContext* ctx) {
    ctx->genLabel("  敵サンプル", 0x80000001, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("基本サイズ", &basic_size, 0.0f, 5.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genCheckBox("PL発見半径表示", &pl_detection_radius_display, 1, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
    ctx->genSlider("PL発見半径（内）", &pl_detection_radius_in, 0.0f, 5000.0f, 0, NULL, 0xFFFF, 0xFFFF, 0x200, 0x18);
