/**
* @file d_a_e_s1.cpp
 *
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_s1.h"
#include "SSystem/SComponent/c_math.h"
#include "Z2AudioLib/Z2Instances.h"
#include "d/actor/d_a_player.h"
#include "d/d_com_inf_game.h"
#include "d/d_path.h"
#include "d/d_s_play.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"

class daE_S1_HIO_c {
public:
    daE_S1_HIO_c();
    virtual ~daE_S1_HIO_c() {}

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 mBaseSize;
    /* 0x0C */ f32 mMoveSpeed;
    /* 0x10 */ u8 field_0x10[0x14 - 0x10];
    /* 0x14 */ f32 mDashSpeed;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ s16 mFallSEWaitTime;
    /* 0x1E */ s16 mAllDeadWaitTime;
    /* 0x20 */ f32 mReactionDist;
    /* 0x24 */ f32 mReactionAngle;
    /* 0x28 */ s16 mReactionTime;
    /* 0x2A */ u8 mInvincible;
};

#define ANM_ATTACK 5
#define ANM_ATTACK_02 6
#define ANM_DAMAGED 7
#define ANM_DASH_01 8
#define ANM_DASH_02 9
#define ANM_DEAD_02 10
#define ANM_DEAD_03 11
#define ANM_DEAD_04 12
#define ANM_DEADWAIT_02 13
#define ANM_DEADWAIT_03 14
#define ANM_DEADWAIT_04 15
#define ANM_DEADWAKE_02 16
#define ANM_DEADWAKE_03 17
#define ANM_DEADWAKE_04 18
#define ANM_DOWN 19
#define ANM_HANGED 20
#define ANM_HANG_DAMAGE 21
#define ANM_HANG_BRUSH 22
#define ANM_HANG_BRUSH2 23
#define ANM_HANG_WAIT 24
#define ANM_SHOUT 25
#define ANM_SHRINK 26
#define ANM_SHRINK_DOWN 27
#define ANM_STICK 28
#define ANM_WAIT_01 29
#define ANM_WAIT_02 30
#define ANM_WALK 31

enum daE_S1_ACTION {
    ACT_WAIT,
    ACT_ROOF,
    ACT_FIGHT_RUN,
    ACT_FIGHT,
    ACT_BIBIRI,
    ACT_DAMAGE,
    ACT_INVINCIBLE,  // does not exist anymore
    ACT_PATH,
    ACT_WOLFBITE,
    ACT_FAIL_WAIT,
    ACT_FAIL,
    ACT_SHOUT,
    ACT_WARP_APPEAR = 20,
};

daE_S1_HIO_c::daE_S1_HIO_c() {
