/**
 * d_a_e_ge.cpp
 * Enemy - Guay
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_boomerang.h"
#include "d/actor/d_a_e_ge.h"
#include "d/d_cc_d.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"


class daE_GE_HIO_c : public JORReflexible {
public:
    daE_GE_HIO_c();
    virtual ~daE_GE_HIO_c() {}

    void genMessage(JORMContext*);

    /* 0x04 */ s8 id;
    /* 0x08 */ f32 player_recognition_distance;
    /* 0x0C */ f32 arrow_recognition_distance;
    /* 0x10 */ f32 peer_recognition_distance;
    /* 0x14 */ f32 attack_speed;
    /* 0x18 */ f32 turning_speed;
    /* 0x1C */ f32 attack_turn_altitude;
    /* 0x20 */ f32 attack_turn_radius;
    /* 0x24 */ f32 attack_start_angle;
    /* 0x28 */ f32 add_attack_descent_speed;
    /* 0x2C */ f32 minimum_attack_radius;
    /* 0x30 */ f32 next_attack_timer;
};

enum daE_GE_Action {
    /* 0 */ ACTION_WAIT,
    /* 1 */ ACTION_FLY,
    /* 2 */ ACTION_ATTACK,
    /* 3 */ ACTION_BACK,
    /* 4 */ ACTION_DOWN,
    /* 5 */ ACTION_SURPRISE,
    /* 6 */ ACTION_CAW,
    /* 7 */ ACTION_WIND,
    /* 8 */ ACTION_SHIELD,
    /* 9 */ ACTION_MAX
};

static u8 hio_set;

static daE_GE_HIO_c l_HIO;

daE_GE_HIO_c::daE_GE_HIO_c() {
    id = -1;
    player_recognition_distance = 1000.0f;
    arrow_recognition_distance = 300.0f;
    peer_recognition_distance = 600.0f;
    attack_speed = 15.0f;
    turning_speed = 15.0f;
    attack_turn_altitude = 600.0f;
    attack_turn_radius = 1000.0f;
    attack_start_angle = 28000.0f;
    add_attack_descent_speed = 1.3f;
    minimum_attack_radius = 500.0f;
    next_attack_timer = 110.0f;
}

void daE_GE_c::bckSet(int i_index, f32 i_morf, u8 i_attr, f32 i_rate) {
    J3DAnmTransform* transform = (J3DAnmTransform*)dComIfG_getObjectRes("E_GE", i_index);
