/**
 * @file d_a_e_sf.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_e_sf.h"
#include "d/d_cc_d.h"
#include "dol2asm.h"
#include "d/d_camera.h"
#include "f_op/f_op_actor_enemy.h"
#include "f_op/f_op_camera_mng.h"
#include "Z2AudioLib/Z2Instances.h"

class daE_SF_HIO_c {
public:
    /* 8078512C */ daE_SF_HIO_c();
    /* 8078977C */ virtual ~daE_SF_HIO_c() {}

    /* スタルフォス - Stalfos */
    /* 0x04 */ s8 id;
    /* 0x08 */ f32 basic_size;              // 基本サイズ - Basic Size
    /* 0x0C */ f32 move_spd;                // 移動速度 - Movement Speed
    /* 0x10 */ f32 charge_spd;              // 突進速度 - Charge Speed
    /* 0x14 */ f32 p_recognize_dist_m;      // P認識距離　M - P Recognition Distance M
    /* 0x18 */ f32 combat_start_range;      // 戦闘開始範囲 - Combat Start Range
    /* 0x1C */ f32 attack_start_range;      // 攻撃開始範囲 - Attack Start Range
    /* 0x20 */ f32 defense_recognize_range; // 防御認識範囲 - Defense Recognition Range
    /* 0x24 */ u8 invulnerable;             // 不死身 - Invulnerable
};


//
// Forward References:
//

extern "C" void __ct__12daE_SF_HIO_cFv();
extern "C" static void anm_init__FP10e_sf_classifUcf();
extern "C" static void nodeCallBack__FP8J3DJointi();
extern "C" static void daE_SF_Draw__FP10e_sf_class();
extern "C" static void other_bg_check__FP10e_sf_classP10fopAc_ac_c();
extern "C" static void player_way_check__FP10e_sf_class();
extern "C" static void way_bg_check__FP10e_sf_classff();
extern "C" static void pl_check__FP10e_sf_classfs();
extern "C" static void e_sf_normal__FP10e_sf_class();
extern "C" static void e_sf_drawback__FP10e_sf_class();
extern "C" static void e_sf_fight_run__FP10e_sf_class();
extern "C" static void at_hit_check__FP10e_sf_class();
extern "C" static void e_sf_attack_0__FP10e_sf_class();
extern "C" static void e_sf_attack__FP10e_sf_class();
extern "C" static void e_sf_guard__FP10e_sf_class();
extern "C" static void e_sf_s_damage__FP10e_sf_class();
