/**
 * @file d_a_b_gm.cpp
 * 
*/

#include "d/dolzel_rel.h" // IWYU pragma: keep

#include "d/actor/d_a_b_gm.h"
#include "d/actor/d_a_e_gm.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_obj_ystone.h"
#include "d/d_s_play.h"
#include "d/d_com_inf_game.h"
#include "c/c_damagereaction.h"
#include "SSystem/SComponent/c_math.h"
#include "f_op/f_op_camera_mng.h"
#include "f_op/f_op_msg_mng.h"
#include "Z2AudioLib/Z2Instances.h"

#define ANM_EYE_TEST            6
#define ANM_GM_BEAM             7
#define ANM_GOMA_ATTACK_01      8
#define ANM_GOMA_ATTACK_A       9
#define ANM_GOMA_ATTACK_B       10
#define ANM_GOMA_ATTACK_C       11
#define ANM_GOMA_DAMAGE_01      12
#define ANM_GOMA_DAMAGE_02      13
#define ANM_GOMA_DAMAGE_WAIT    14
#define ANM_GOMA_DASH           15
#define ANM_GOMA_DEATH          16
#define ANM_GOMA_FALL_LOOP      17
#define ANM_GOMA_LANDING        18
#define ANM_GOMA_LANDING_DAMAGE 19
#define ANM_GOMA_LANDING_WAIT   20
#define ANM_GOMA_LAY_EGGS       21
#define ANM_GOMA_MOVE           22
#define ANM_GOMA_RETURN         23
#define ANM_GOMA_ROOF_DAMAGE    24
#define ANM_GOMA_SLOW_MOVE      25
#define ANM_GOMA_STEP_L         26
#define ANM_GOMA_STEP_R         27
#define ANM_GOMA_UP             28
#define ANM_GOMA_UP_02          29
#define ANM_GOMA_WAIT           30

enum daB_GM_ACTION {
    ACTION_WAIT,
    ACTION_MOVE,

    ACTION_BEAM = 5,
    ACTION_KOGOMA,

    ACTION_DAMAGE = 10,
    ACTION_DROP,
};

class daB_GM_HIO_c {
public:
    daB_GM_HIO_c();
    virtual ~daB_GM_HIO_c() {}

    /* 0x04 */ s8 field_0x4;
    /* 0x08 */ f32 model_size;
    /* 0x0C */ f32 check_size;
    /* 0x10 */ f32 dash_speed;
    /* 0x14 */ f32 dash_anm_speed;
    /* 0x18 */ f32 move_speed;
    /* 0x1C */ f32 move_anm_speed;
    /* 0x20 */ f32 wait_anm_speed;
    /* 0x24 */ f32 range;
    /* 0x28 */ s16 smoke_prim_R;
    /* 0x2A */ s16 smoke_prim_G;
    /* 0x2C */ s16 smoke_prim_B;
    /* 0x2E */ s16 smoke_env_R;
    /* 0x30 */ s16 smoke_env_G;
    /* 0x32 */ s16 smoke_env_B;
    /* 0x34 */ s16 smoke_alpha;
    /* 0x36 */ s16 field_0x36;
    /* 0x38 */ f32 smoke_blend;
    /* 0x3C */ f32 bend_degree_1;
    /* 0x40 */ f32 bend_degree_2;
    /* 0x44 */ f32 bend_degree_3;
    /* 0x48 */ u8 foot_pos_check;
    /* 0x49 */ u8 eye_check;
};

daB_GM_HIO_c::daB_GM_HIO_c() {
    field_0x4 = 0xFF;
    model_size = 1.0f;
    check_size = 1.5f;

    dash_speed = 35.0f;
    dash_anm_speed = 1.0f;
    move_speed = 15.0f;
    move_anm_speed = 1.0f;
    wait_anm_speed = 1.0f;
    range = 1300.0f;

    smoke_prim_R = 205;
    smoke_prim_G = 200;
    smoke_prim_B = 180;
    smoke_env_R = 103;
    smoke_env_G = 100;
    smoke_env_B = 90;
    smoke_alpha = 110;
    smoke_blend = 0.3;

    bend_degree_1 = 1.0f;
    bend_degree_2 = 1.0f;
    bend_degree_3 = -1.0f;

    foot_pos_check = false;
    eye_check = false;
}

static void anm_init(b_gm_class* i_this, int i_anmID, f32 i_morf, u8 i_attr, f32 i_speed) {
    i_this->mpModelMorf->setAnm((J3DAnmTransform*)dComIfG_getObjectRes("B_gm", i_anmID), i_attr, i_morf, i_speed, 0.0f, -1.0f);
    i_this->mAnmID = i_anmID;
}

static int nodeCallBack(J3DJoint* i_joint, int param_1) {
    if (param_1 == 0) {
        int jnt_no = i_joint->getJntNo();
